Repository: samba-team/samba
Catalog: webapps/qooxdoo-0.6.5-sdk/frontend/application/showcase/source/translation/*.po
Languages: it

source: Choose a locale:
it: Scegli una localizzazione:

source: A date:
it: Una data:

source: Undo
it: Annulla

source: Redo
it: Ripeti

source: Cut
it: Taglia

source: Copy
it: Copia

source: Paste
it: Incolla

source: Delete
it: Cancella

source: Select All
it: Seleziona tutto

source: Search
it: Cerca

source: Search Again
it: Carca ancora

source: Command Menu (keyboard shortcuts)
it: Menu dei comandi (abbreviazioni da tastiera)

source: Open Color Popup
it: Apri il selettore dei colori

source: Basic Colors
it: Colori Base

source: Template Colors
it: Colori Modello

source: Recent Colors
it: Colori Recenti

source: Locale information
it: Informazione sulla localizzazione

source: Locale:
it: Localizzazione:

source: Territory code:
it: Codice del territorio:

source: Date format medium:
it: Formato data medio:

source: Date medium:
it: Data in formato medio:

source: Date format long:
it: Formato data lungo:

source: Date long:
it: Data in formato lungo:

source: Date format full:
it: Formato data completo:

source: Date full:
it: Data in formato completo:

source: Time format short:
it: Formato orario breve:

source: Time short:
it: Orario in formato breve:

source: Time format long:
it: Formato orario lungo:

source: Time long:
it: Orario in formato lungo:

source: Week start:
it: Inizio della settimana:

source: Format of %1:
it: Formato di %1
