<?xml version="1.0" ?>
<policyDefinitions revision="1.0" schemaVersion="1.0">
  <policyNamespaces>
    <target prefix="fullarmor" namespace="FullArmor.Policies.98BB16AF_01EE_4D17_870D_A3311A44D6C2" />
    <using prefix="windows" namespace="Microsoft.Policies.Windows" />
  </policyNamespaces>
  <supersededAdm fileName="" />
  <resources minRequiredRevision="1.0" />
  <categories>
    <category name="CAT_3338C1DD_8A00_4273_8547_158D8B8C19E9" displayName="$(string.CAT_3338C1DD_8A00_4273_8547_158D8B8C19E9)" />
    <category name="CAT_7D8D7DC8_5A9D_4BE1_8227_F09CDD5AFFC6" displayName="$(string.CAT_7D8D7DC8_5A9D_4BE1_8227_F09CDD5AFFC6)">
      <parentCategory ref="CAT_3338C1DD_8A00_4273_8547_158D8B8C19E9" />
    </category>
    <category name="CAT_2B6D622C_5721_4C23_A2D6_5C70D6E059BA" displayName="$(string.CAT_2B6D622C_5721_4C23_A2D6_5C70D6E059BA)">
      <parentCategory ref="CAT_7D8D7DC8_5A9D_4BE1_8227_F09CDD5AFFC6" />
    </category>
    <category name="CAT_9DEF582D_447A_47E9_A1F5_363558D03FA9" displayName="$(string.CAT_9DEF582D_447A_47E9_A1F5_363558D03FA9)">
      <parentCategory ref="CAT_7D8D7DC8_5A9D_4BE1_8227_F09CDD5AFFC6" />
    </category>
    <category displayName="$(string.CAT_10827749_64ED_5052_87F7_E81AD421856A)" name="CAT_10827749_64ED_5052_87F7_E81AD421856A">
      <parentCategory ref="CAT_3338C1DD_8A00_4273_8547_158D8B8C19E9"/>
    </category>
    <category name="CAT_371A8FF5_990F_47DD_B200_D436AC28A4F9" displayName="$(string.CAT_371A8FF5_990F_47DD_B200_D436AC28A4F9)">
      <parentCategory ref="CAT_7D8D7DC8_5A9D_4BE1_8227_F09CDD5AFFC6" />
    </category>
  </categories>
  <policies>
    <policy name="POL_9320E11F_AC80_4A7D_A5C8_1C0F3F727061" class="Both" displayName="$(string.POL_9320E11F_AC80_4A7D_A5C8_1C0F3F727061)" explainText="$(string.POL_9320E11F_AC80_4A7D_A5C8_1C0F3F727061_Help)" presentation="$(presentation.POL_9320E11F_AC80_4A7D_A5C8_1C0F3F727061)" key="Software\Policies\Samba\Unix Settings">
      <parentCategory ref="CAT_2B6D622C_5721_4C23_A2D6_5C70D6E059BA" />
      <supportedOn ref="windows:SUPPORTED_WindowsVista" />
      <elements>
        <list id="LST_2E9A4684_3C0E_415B_8FD6_D4AF68BC8AC6" key="Software\Policies\Samba\Unix Settings\Daily Scripts" valueName="Daily Scripts" />
      </elements>
    </policy>
    <policy name="POL_825D441F_905E_4C7E_9E4B_03013697C6C1" class="Both" displayName="$(string.POL_825D441F_905E_4C7E_9E4B_03013697C6C1)" explainText="$(string.POL_825D441F_905E_4C7E_9E4B_03013697C6C1_Help)" presentation="$(presentation.POL_825D441F_905E_4C7E_9E4B_03013697C6C1)" key="Software\Policies\Samba\Unix Settings">
      <parentCategory ref="CAT_2B6D622C_5721_4C23_A2D6_5C70D6E059BA" />
      <supportedOn ref="windows:SUPPORTED_WindowsVista" />
      <elements>
        <list id="LST_1AA93D59_6372_4F1E_90BB_D4CBBBB77238" key="Software\Policies\Samba\Unix Settings\Hourly Scripts" valueName="Hourly Scripts" />
      </elements>
    </policy>
    <policy name="POL_D298F3BD_44D9_426D_AF11_3163D31582F6" class="Both" displayName="$(string.POL_D298F3BD_44D9_426D_AF11_3163D31582F6)" explainText="$(string.POL_D298F3BD_44D9_426D_AF11_3163D31582F6_Help)" presentation="$(presentation.POL_D298F3BD_44D9_426D_AF11_3163D31582F6)" key="Software\Policies\Samba\Unix Settings">
      <parentCategory ref="CAT_2B6D622C_5721_4C23_A2D6_5C70D6E059BA" />
      <supportedOn ref="windows:SUPPORTED_WindowsVista" />
      <elements>
        <list id="LST_8BC6757D_B1FB_4780_83B4_F85F27BF6E60" key="Software\Policies\Samba\Unix Settings\Monthly Scripts" valueName="Monthly Scripts" />
      </elements>
    </policy>
    <policy name="POL_3ACC7ECD_8086_4F4A_96DF_85B8FDE2F674" class="Both" displayName="$(string.POL_3ACC7ECD_8086_4F4A_96DF_85B8FDE2F674)" explainText="$(string.POL_3ACC7ECD_8086_4F4A_96DF_85B8FDE2F674_Help)" presentation="$(presentation.POL_3ACC7ECD_8086_4F4A_96DF_85B8FDE2F674)" key="Software\Policies\Samba\Unix Settings">
      <parentCategory ref="CAT_2B6D622C_5721_4C23_A2D6_5C70D6E059BA" />
      <supportedOn ref="windows:SUPPORTED_WindowsVista" />
      <elements>
        <list id="LST_1E7198A6_7850_4CAB_B656_BC18752564FC" key="Software\Policies\Samba\Unix Settings\Weekly Scripts" valueName="Weekly Scripts" />
      </elements>
    </policy>
    <policy name="POL_DB5DF501_6F87_42D4_9FEC_E7F32C498BD3" class="Machine" displayName="$(string.POL_DB5DF501_6F87_42D4_9FEC_E7F32C498BD3)" explainText="$(string.POL_DB5DF501_6F87_42D4_9FEC_E7F32C498BD3_Help)" presentation="$(presentation.POL_DB5DF501_6F87_42D4_9FEC_E7F32C498BD3)" key="Software\Policies\Samba\Unix Settings">
      <parentCategory ref="CAT_7D8D7DC8_5A9D_4BE1_8227_F09CDD5AFFC6" />
      <supportedOn ref="windows:SUPPORTED_WindowsVista" />
      <elements>
        <list id="LST_4F4BA073_4F7B_4B64_A61D_8E75257A4B9F" key="Software\Policies\Samba\Unix Settings\Sudo Rights" valueName="Sudo Rights" />
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_33AAE399_07A8_5CC8_882A_393E4B96B259)" explainText="$(string.POL_33AAE399_07A8_5CC8_882A_393E4B96B259_Help)" key="Software\Policies\Samba\smb_conf" name="POL_33AAE399_07A8_5CC8_882A_393E4B96B259" presentation="$(presentation.POL_A3D6C2F2_2798_527E_861E_FA8BADBBE6E6)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <text id="TXT_F940E18B_16AE_594B_9669_96417E695AC9" key="Software\Policies\Samba\smb_conf\additional dns hostnames" valueName="additional dns hostnames"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_3CD2A970_826E_518E_B5F0_5E6725FF354D)" explainText="$(string.POL_3CD2A970_826E_518E_B5F0_5E6725FF354D_Help)" key="Software\Policies\Samba\smb_conf" name="POL_3CD2A970_826E_518E_B5F0_5E6725FF354D" presentation="$(presentation.POL_AC8777B4_88D7_5A1A_BB7E_E47AB5DBD6AA)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <boolean id="CHK_5C837672_BFBB_592A_907C_E378BEEDA2E4" key="Software\Policies\Samba\smb_conf\bind interfaces only" valueName="bind interfaces only"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_109FA3A4_0F92_5052_A7D9_D4BBCA75F765)" explainText="$(string.POL_109FA3A4_0F92_5052_A7D9_D4BBCA75F765_Help)" key="Software\Policies\Samba\smb_conf" name="POL_109FA3A4_0F92_5052_A7D9_D4BBCA75F765" presentation="$(presentation.POL_D03F1811_D0CA_56CF_9D18_B480E9B5AFAD)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <text id="TXT_03C82812_CCD0_5E35_8FA1_2704BAF796E9" key="Software\Policies\Samba\smb_conf\config backend" valueName="config backend"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_08734B25_7265_5D0B_B857_B2E831B624F1)" explainText="$(string.POL_08734B25_7265_5D0B_B857_B2E831B624F1_Help)" key="Software\Policies\Samba\smb_conf" name="POL_08734B25_7265_5D0B_B857_B2E831B624F1" presentation="$(presentation.POL_DE840DAF_58CD_5B21_A76B_70740BD125A1)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <text id="TXT_CF5594A6_FA4A_5AB4_881B_AD9270CE3523" key="Software\Policies\Samba\smb_conf\dos charset" valueName="dos charset"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_4CCDFFB7_07DF_58F9_904E_13A024A3F54A)" explainText="$(string.POL_4CCDFFB7_07DF_58F9_904E_13A024A3F54A_Help)" key="Software\Policies\Samba\smb_conf" name="POL_4CCDFFB7_07DF_58F9_904E_13A024A3F54A" presentation="$(presentation.POL_3783DBBE_7F1F_52B4_BECB_6176E8D43AE1)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <boolean id="CHK_A51834ED_BBB9_52C3_A7C5_A566ABE7AB3D" key="Software\Policies\Samba\smb_conf\enable core files" valueName="enable core files"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_5B751E57_31A9_5EC2_A3CD_A8511D74FCFB)" explainText="$(string.POL_5B751E57_31A9_5EC2_A3CD_A8511D74FCFB_Help)" key="Software\Policies\Samba\smb_conf" name="POL_5B751E57_31A9_5EC2_A3CD_A8511D74FCFB" presentation="$(presentation.POL_5EE2E645_A509_5C51_94FE_4F84668AC869)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <text id="TXT_3E2FB206_740F_580E_889D_B53C2540732C" key="Software\Policies\Samba\smb_conf\mdns name" valueName="mdns name"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_461A8AAF_F51E_5FF5_9433_A8D25BBCF783)" explainText="$(string.POL_461A8AAF_F51E_5FF5_9433_A8D25BBCF783_Help)" key="Software\Policies\Samba\smb_conf" name="POL_461A8AAF_F51E_5FF5_9433_A8D25BBCF783" presentation="$(presentation.POL_32EB220A_5721_51EC_810C_0BEF4B9EA706)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <boolean id="CHK_03FFDBD4_C185_5951_954F_189B0D4C40DA" key="Software\Policies\Samba\smb_conf\multicast dns register" valueName="multicast dns register"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_04F98D09_4223_5390_B66F_A6DA05F97FCC)" explainText="$(string.POL_04F98D09_4223_5390_B66F_A6DA05F97FCC_Help)" key="Software\Policies\Samba\smb_conf" name="POL_04F98D09_4223_5390_B66F_A6DA05F97FCC" presentation="$(presentation.POL_51EEB44F_42B8_5CEA_8DA6_CB78139F4804)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <text id="TXT_6A12C17F_F8CF_56F3_8D82_43CAB3C57F55" key="Software\Policies\Samba\smb_conf\netbios aliases" valueName="netbios aliases"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_90CE7832_31B7_51D8_9EF2_92FEF396F49B)" explainText="$(string.POL_90CE7832_31B7_51D8_9EF2_92FEF396F49B_Help)" key="Software\Policies\Samba\smb_conf" name="POL_90CE7832_31B7_51D8_9EF2_92FEF396F49B" presentation="$(presentation.POL_4AEFFAC4_3FBE_5DFA_9D3F_D78B50416B7C)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <text id="TXT_34827D8A_E97C_590B_BD8A_6DEA6A354BE8" key="Software\Policies\Samba\smb_conf\netbios name" valueName="netbios name"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_3B93FDE1_6461_572C_AD2E_6AEEAE4EA949)" explainText="$(string.POL_3B93FDE1_6461_572C_AD2E_6AEEAE4EA949_Help)" key="Software\Policies\Samba\smb_conf" name="POL_3B93FDE1_6461_572C_AD2E_6AEEAE4EA949" presentation="$(presentation.POL_24E6BE64_5FEA_56A1_83AF_844C8A96E96D)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <text id="TXT_0ED12914_E653_5CDA_9F46_E1C3AB2FC32E" key="Software\Policies\Samba\smb_conf\netbios scope" valueName="netbios scope"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_E633B0BE_9CF3_5D79_A9F1_CB782C82A19C)" explainText="$(string.POL_E633B0BE_9CF3_5D79_A9F1_CB782C82A19C_Help)" key="Software\Policies\Samba\smb_conf" name="POL_E633B0BE_9CF3_5D79_A9F1_CB782C82A19C" presentation="$(presentation.POL_0901DFB6_7C73_5D10_82CC_5D77CD14685D)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <decimal id="DXT_F0896598_D8F1_579A_B01D_09A48282AC76" key="Software\Policies\Samba\smb_conf\prefork backoff increment" valueName="prefork backoff increment"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_B4E848BD_E606_552C_8C9F_3F8CC1AEF191)" explainText="$(string.POL_B4E848BD_E606_552C_8C9F_3F8CC1AEF191_Help)" key="Software\Policies\Samba\smb_conf" name="POL_B4E848BD_E606_552C_8C9F_3F8CC1AEF191" presentation="$(presentation.POL_26F4B846_C66B_5649_AA7E_B06E899017CA)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <decimal id="DXT_BD459D8F_47F9_558D_A641_97892C9E577E" key="Software\Policies\Samba\smb_conf\prefork children" valueName="prefork children"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_D721EFAF_A53D_57B7_9639_3859CF9CE31E)" explainText="$(string.POL_D721EFAF_A53D_57B7_9639_3859CF9CE31E_Help)" key="Software\Policies\Samba\smb_conf" name="POL_D721EFAF_A53D_57B7_9639_3859CF9CE31E" presentation="$(presentation.POL_9C3E188A_07B9_5354_A206_DD0FA0B4A235)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <decimal id="DXT_16991D04_74C7_54C3_9E4F_52EF9C9AEDB4" key="Software\Policies\Samba\smb_conf\prefork maximum backoff" valueName="prefork maximum backoff"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_1630255E_61BA_5686_B3E0_995F8C4DAA5E)" explainText="$(string.POL_1630255E_61BA_5686_B3E0_995F8C4DAA5E_Help)" key="Software\Policies\Samba\smb_conf" name="POL_1630255E_61BA_5686_B3E0_995F8C4DAA5E" presentation="$(presentation.POL_609F7E6F_9AAC_56B4_B098_4E63BBBB98B4)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <text id="TXT_5B075596_6622_5C89_A426_B9DA3F43AC3A" key="Software\Policies\Samba\smb_conf\realm" valueName="realm"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_E1D45258_0E70_5AF8_AE28_DAB6B318BB8A)" explainText="$(string.POL_E1D45258_0E70_5AF8_AE28_DAB6B318BB8A_Help)" key="Software\Policies\Samba\smb_conf" name="POL_E1D45258_0E70_5AF8_AE28_DAB6B318BB8A" presentation="$(presentation.POL_68ED4DED_E13E_5C54_BD04_23E499D77D51)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <text id="TXT_E2BF4D58_613E_5C2D_850A_C3585BC311C2" key="Software\Policies\Samba\smb_conf\server services" valueName="server services"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_351CFFDA_9DC3_54FB_BE9A_E434F0DB9955)" explainText="$(string.POL_351CFFDA_9DC3_54FB_BE9A_E434F0DB9955_Help)" key="Software\Policies\Samba\smb_conf" name="POL_351CFFDA_9DC3_54FB_BE9A_E434F0DB9955" presentation="$(presentation.POL_584FF155_77A9_5209_AC2F_071DEAB5FA42)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <text id="TXT_EC20B2FC_7658_536F_A876_F0B61196042C" key="Software\Policies\Samba\smb_conf\server string" valueName="server string"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_32A7428D_00FC_5203_9943_2BDCDC3D9E0D)" explainText="$(string.POL_32A7428D_00FC_5203_9943_2BDCDC3D9E0D_Help)" key="Software\Policies\Samba\smb_conf" name="POL_32A7428D_00FC_5203_9943_2BDCDC3D9E0D" presentation="$(presentation.POL_3D10A56C_5C5B_516D_8718_0112384056DB)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <text id="TXT_682410E7_F583_5A97_BB60_6BBAA190DA1C" key="Software\Policies\Samba\smb_conf\share backend" valueName="share backend"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_ABDCEE90_90DE_55C2_A2DC_1C7D017F4B2B)" explainText="$(string.POL_ABDCEE90_90DE_55C2_A2DC_1C7D017F4B2B_Help)" key="Software\Policies\Samba\smb_conf" name="POL_ABDCEE90_90DE_55C2_A2DC_1C7D017F4B2B" presentation="$(presentation.POL_A64B2059_EC1C_5759_94E8_CD95EEB42F35)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <text id="TXT_3F03354B_7221_5D54_8D25_FA3229D9A026" key="Software\Policies\Samba\smb_conf\unix charset" valueName="unix charset"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_D1FAAF87_1E1E_596F_A915_BE72D67A5DC5)" explainText="$(string.POL_D1FAAF87_1E1E_596F_A915_BE72D67A5DC5_Help)" key="Software\Policies\Samba\smb_conf" name="POL_D1FAAF87_1E1E_596F_A915_BE72D67A5DC5" presentation="$(presentation.POL_38764DE0_53DC_587E_A94B_7C03323B0C69)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <text id="TXT_A1CD4626_197B_582B_9C09_E35945F84ECF" key="Software\Policies\Samba\smb_conf\workgroup" valueName="workgroup"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_163183B9_195A_5290_927E_08FBB6C76AA0)" explainText="$(string.POL_163183B9_195A_5290_927E_08FBB6C76AA0_Help)" key="Software\Policies\Samba\smb_conf" name="POL_163183B9_195A_5290_927E_08FBB6C76AA0" presentation="$(presentation.POL_DD5ADDCF_E8DF_50F9_9847_E821787C2C3C)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <text id="TXT_18F101C1_8754_5052_8D12_3D4B3755A739" key="Software\Policies\Samba\smb_conf\interfaces" valueName="interfaces"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_25731B61_FC84_5A83_93AE_296F7D6311C4)" explainText="$(string.POL_25731B61_FC84_5A83_93AE_296F7D6311C4_Help)" key="Software\Policies\Samba\smb_conf" name="POL_25731B61_FC84_5A83_93AE_296F7D6311C4" presentation="$(presentation.POL_EECBA792_3D9C_5624_A01E_F5876EF8224D)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <boolean id="CHK_1D40EF50_9DF5_5D95_B5EF_406C4F3774B8" key="Software\Policies\Samba\smb_conf\browse list" valueName="browse list"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_3E9E3188_6F1A_54F8_8E13_265E2AD1BE71)" explainText="$(string.POL_3E9E3188_6F1A_54F8_8E13_265E2AD1BE71_Help)" key="Software\Policies\Samba\smb_conf" name="POL_3E9E3188_6F1A_54F8_8E13_265E2AD1BE71" presentation="$(presentation.POL_414481A1_7B9D_551A_96F0_B235A226F141)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <text id="TXT_69092348_8194_5EA4_9EB2_AFFFF4A2A6C8" key="Software\Policies\Samba\smb_conf\domain master" valueName="domain master"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_E14519D2_9B84_5A1B_B4A4_89F6151BFCE2)" explainText="$(string.POL_E14519D2_9B84_5A1B_B4A4_89F6151BFCE2_Help)" key="Software\Policies\Samba\smb_conf" name="POL_E14519D2_9B84_5A1B_B4A4_89F6151BFCE2" presentation="$(presentation.POL_25D5E28F_5847_5A16_8CF5_01E528D1807D)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <boolean id="CHK_7A02FE2C_82BF_50CE_91F0_14B1191E7258" key="Software\Policies\Samba\smb_conf\enhanced browsing" valueName="enhanced browsing"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_7E8FBFDB_CBDD_5CE7_B101_07AB8AA71209)" explainText="$(string.POL_7E8FBFDB_CBDD_5CE7_B101_07AB8AA71209_Help)" key="Software\Policies\Samba\smb_conf" name="POL_7E8FBFDB_CBDD_5CE7_B101_07AB8AA71209" presentation="$(presentation.POL_7356F015_5915_5A1E_9154_AEE48849DC85)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <text id="TXT_9C07BE5E_EF60_51EC_B26C_CEA97CD41C69" key="Software\Policies\Samba\smb_conf\lm announce" valueName="lm announce"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_6D665B21_1F08_5183_B9CD_CFD712C1D4AB)" explainText="$(string.POL_6D665B21_1F08_5183_B9CD_CFD712C1D4AB_Help)" key="Software\Policies\Samba\smb_conf" name="POL_6D665B21_1F08_5183_B9CD_CFD712C1D4AB" presentation="$(presentation.POL_37CB9A35_D06B_581B_8BBC_96F636F2DF0D)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <decimal id="DXT_6B8EAB54_6B9E_5EE3_BBB3_286F512AC0F9" key="Software\Policies\Samba\smb_conf\lm interval" valueName="lm interval"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_40EA4C73_20A7_580A_A830_0EDA7FC72B7D)" explainText="$(string.POL_40EA4C73_20A7_580A_A830_0EDA7FC72B7D_Help)" key="Software\Policies\Samba\smb_conf" name="POL_40EA4C73_20A7_580A_A830_0EDA7FC72B7D" presentation="$(presentation.POL_00BB67E5_7846_53BF_990A_8B7D03F9D88E)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <boolean id="CHK_CFD7EF58_DD73_5465_B0CE_4C6B4E35F416" key="Software\Policies\Samba\smb_conf\local master" valueName="local master"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_95C311BC_3067_5654_A978_70326D928F48)" explainText="$(string.POL_95C311BC_3067_5654_A978_70326D928F48_Help)" key="Software\Policies\Samba\smb_conf" name="POL_95C311BC_3067_5654_A978_70326D928F48" presentation="$(presentation.POL_99809647_A4DC_5363_8E8B_A27B51B90E87)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <decimal id="DXT_3DF3E95D_2453_53C1_A98D_DB040E45E676" key="Software\Policies\Samba\smb_conf\os level" valueName="os level"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_516D10CE_AECD_50DE_B4F5_D9DBF85FA582)" explainText="$(string.POL_516D10CE_AECD_50DE_B4F5_D9DBF85FA582_Help)" key="Software\Policies\Samba\smb_conf" name="POL_516D10CE_AECD_50DE_B4F5_D9DBF85FA582" presentation="$(presentation.POL_69BB8325_FE45_56C0_8D34_F23EC38D2107)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <text id="TXT_82D47B73_2C75_5779_A283_E9A39FD54705" key="Software\Policies\Samba\smb_conf\preferred master" valueName="preferred master"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_E468B4EF_D43C_572D_9A57_390D5D22F485)" explainText="$(string.POL_E468B4EF_D43C_572D_9A57_390D5D22F485_Help)" key="Software\Policies\Samba\smb_conf" name="POL_E468B4EF_D43C_572D_9A57_390D5D22F485" presentation="$(presentation.POL_F664E709_2422_5047_BD55_E95C422B6B33)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <text id="TXT_BEC7C085_5840_5531_9E64_A727E258569A" key="Software\Policies\Samba\smb_conf\allow dns updates" valueName="allow dns updates"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_7E805DF0_F3AD_55F6_AC1E_B13987AE73FC)" explainText="$(string.POL_7E805DF0_F3AD_55F6_AC1E_B13987AE73FC_Help)" key="Software\Policies\Samba\smb_conf" name="POL_7E805DF0_F3AD_55F6_AC1E_B13987AE73FC" presentation="$(presentation.POL_C69048CD_ABF0_5333_B5CB_7455D5F226FF)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <text id="TXT_64C9BBC7_F73A_5844_A613_08685212F33C" key="Software\Policies\Samba\smb_conf\dns forwarder" valueName="dns forwarder"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_DE5786B0_C694_53AA_85F2_F9B4EB2F9923)" explainText="$(string.POL_DE5786B0_C694_53AA_85F2_F9B4EB2F9923_Help)" key="Software\Policies\Samba\smb_conf" name="POL_DE5786B0_C694_53AA_85F2_F9B4EB2F9923" presentation="$(presentation.POL_F9D5C585_21FD_5990_BE36_3A58B7AF326B)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <text id="TXT_05BC3827_6AE7_54BF_8E0C_008D698CC732" key="Software\Policies\Samba\smb_conf\dns update command" valueName="dns update command"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_C5C16F87_0017_5CC1_810B_398855115BC9)" explainText="$(string.POL_C5C16F87_0017_5CC1_810B_398855115BC9_Help)" key="Software\Policies\Samba\smb_conf" name="POL_C5C16F87_0017_5CC1_810B_398855115BC9" presentation="$(presentation.POL_2363A474_4143_52A2_A69B_05285C98E4CF)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <boolean id="CHK_3104780C_9730_550D_8DF9_5C5A226B2AAE" key="Software\Policies\Samba\smb_conf\dns zone scavenging" valueName="dns zone scavenging"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_23A4E426_BE59_5616_849E_94C825DDFC5B)" explainText="$(string.POL_23A4E426_BE59_5616_849E_94C825DDFC5B_Help)" key="Software\Policies\Samba\smb_conf" name="POL_23A4E426_BE59_5616_849E_94C825DDFC5B" presentation="$(presentation.POL_F2F11B02_D190_5766_95DC_FDB846EEEB13)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <text id="TXT_A8FD53BD_1ED7_54DB_9A7C_159348F47A6D" key="Software\Policies\Samba\smb_conf\gpo update command" valueName="gpo update command"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_D32F3D0B_74B1_5C8F_81B4_CC9574EAB9B7)" explainText="$(string.POL_D32F3D0B_74B1_5C8F_81B4_CC9574EAB9B7_Help)" key="Software\Policies\Samba\smb_conf" name="POL_D32F3D0B_74B1_5C8F_81B4_CC9574EAB9B7" presentation="$(presentation.POL_A83B176D_D2FE_5F41_9977_9A16F5B8C5ED)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <decimal id="DXT_E5687DEB_DB51_5266_ACDB_2E619982BAD7" key="Software\Policies\Samba\smb_conf\machine password timeout" valueName="machine password timeout"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_07339CF8_68F5_5B5F_9207_93D2E4526C44)" explainText="$(string.POL_07339CF8_68F5_5B5F_9207_93D2E4526C44_Help)" key="Software\Policies\Samba\smb_conf" name="POL_07339CF8_68F5_5B5F_9207_93D2E4526C44" presentation="$(presentation.POL_5BD73E55_C69F_5CCF_8D91_2513716FB1C6)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <text id="TXT_3BA3F934_5C9D_5EAB_BAEB_7FBDAE0268F5" key="Software\Policies\Samba\smb_conf\nsupdate command" valueName="nsupdate command"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_D0F6F805_6160_55CF_9B8B_F5AD874B1E2C)" explainText="$(string.POL_D0F6F805_6160_55CF_9B8B_F5AD874B1E2C_Help)" key="Software\Policies\Samba\smb_conf" name="POL_D0F6F805_6160_55CF_9B8B_F5AD874B1E2C" presentation="$(presentation.POL_E38856B0_C9B1_5577_9055_C48A4CCE499C)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <text id="TXT_041114D6_313A_501F_BFC9_FD004546248B" key="Software\Policies\Samba\smb_conf\spn update command" valueName="spn update command"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_6FFBB02C_6B3E_5D0E_9193_15F9B38E487D)" explainText="$(string.POL_6FFBB02C_6B3E_5D0E_9193_15F9B38E487D_Help)" key="Software\Policies\Samba\smb_conf" name="POL_6FFBB02C_6B3E_5D0E_9193_15F9B38E487D" presentation="$(presentation.POL_C2FCADD1_1EF0_5726_9CDE_0E155B0B6575)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <decimal id="DXT_0BA0C537_293A_525C_AC5C_9BB5C0524277" key="Software\Policies\Samba\smb_conf\mangle prefix" valueName="mangle prefix"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_BE8F8AE7_99AC_582E_8105_00326D511339)" explainText="$(string.POL_BE8F8AE7_99AC_582E_8105_00326D511339_Help)" key="Software\Policies\Samba\smb_conf" name="POL_BE8F8AE7_99AC_582E_8105_00326D511339" presentation="$(presentation.POL_620B56BA_84B7_5E72_AC2D_4F0574FBB199)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <text id="TXT_241061E9_3BDA_5AFE_87CB_13C53A164649" key="Software\Policies\Samba\smb_conf\mangling method" valueName="mangling method"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_62095050_5FA9_5E4F_8792_595D30BEF047)" explainText="$(string.POL_62095050_5FA9_5E4F_8792_595D30BEF047_Help)" key="Software\Policies\Samba\smb_conf" name="POL_62095050_5FA9_5E4F_8792_595D30BEF047" presentation="$(presentation.POL_E59D859C_7C78_5AB6_8DE3_27F672637189)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <decimal id="DXT_EA859956_0483_500A_9962_8A26A8B81BB4" key="Software\Policies\Samba\smb_conf\max stat cache size" valueName="max stat cache size"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_63F6A053_E2E9_57D0_A0F8_003024AD6470)" explainText="$(string.POL_63F6A053_E2E9_57D0_A0F8_003024AD6470_Help)" key="Software\Policies\Samba\smb_conf" name="POL_63F6A053_E2E9_57D0_A0F8_003024AD6470" presentation="$(presentation.POL_6BB5939F_7CE6_588E_A6E2_B114EF17F60F)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <boolean id="CHK_45471F8A_D0BD_53A3_B51F_393DE6CC03D2" key="Software\Policies\Samba\smb_conf\stat cache" valueName="stat cache"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_FBDCB316_EDD2_526C_AE9F_32F50A97A72F)" explainText="$(string.POL_FBDCB316_EDD2_526C_AE9F_32F50A97A72F_Help)" key="Software\Policies\Samba\smb_conf" name="POL_FBDCB316_EDD2_526C_AE9F_32F50A97A72F" presentation="$(presentation.POL_BE2B9E4A_5ABE_543F_8564_4CBDD1AF9179)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <text id="TXT_4A85EF32_894F_50AF_9917_B7F431720A82" key="Software\Policies\Samba\smb_conf\client ldap sasl wrapping" valueName="client ldap sasl wrapping"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_712CFB73_7887_55DD_975B_48DEDBDB9441)" explainText="$(string.POL_712CFB73_7887_55DD_975B_48DEDBDB9441_Help)" key="Software\Policies\Samba\smb_conf" name="POL_712CFB73_7887_55DD_975B_48DEDBDB9441" presentation="$(presentation.POL_F4937393_B88E_5B26_89F5_F9933BEBEF8B)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <text id="TXT_4B00C10F_7EBB_52D5_9AD1_C893F9C094C5" key="Software\Policies\Samba\smb_conf\ldap admin dn" valueName="ldap admin dn"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_CEAB52CA_95EB_5DE5_863B_2399BEF5C727)" explainText="$(string.POL_CEAB52CA_95EB_5DE5_863B_2399BEF5C727_Help)" key="Software\Policies\Samba\smb_conf" name="POL_CEAB52CA_95EB_5DE5_863B_2399BEF5C727" presentation="$(presentation.POL_5187BD6B_3008_59FC_887D_1C89E807B11E)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <decimal id="DXT_87AD8E93_91B6_5439_B928_9776BF986ED0" key="Software\Policies\Samba\smb_conf\ldap connection timeout" valueName="ldap connection timeout"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_4750A945_176C_5FFF_AB50_DF2BE31C3FBB)" explainText="$(string.POL_4750A945_176C_5FFF_AB50_DF2BE31C3FBB_Help)" key="Software\Policies\Samba\smb_conf" name="POL_4750A945_176C_5FFF_AB50_DF2BE31C3FBB" presentation="$(presentation.POL_96311867_A4DE_5B57_BD8C_3D25B5084F68)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <boolean id="CHK_2BC96AC0_ECEF_55D4_AEA4_039FDD24C999" key="Software\Policies\Samba\smb_conf\ldap delete dn" valueName="ldap delete dn"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_27BBF4DB_E2AE_58D3_8018_E83C4B185A3C)" explainText="$(string.POL_27BBF4DB_E2AE_58D3_8018_E83C4B185A3C_Help)" key="Software\Policies\Samba\smb_conf" name="POL_27BBF4DB_E2AE_58D3_8018_E83C4B185A3C" presentation="$(presentation.POL_193E7C6B_E70E_55EB_AB50_3788B93F4607)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <text id="TXT_FCC83065_2F1A_585B_A998_85AA52D99537" key="Software\Policies\Samba\smb_conf\ldap deref" valueName="ldap deref"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_B383A7ED_F6A4_5BD3_B85E_E6B6527D8D79)" explainText="$(string.POL_B383A7ED_F6A4_5BD3_B85E_E6B6527D8D79_Help)" key="Software\Policies\Samba\smb_conf" name="POL_B383A7ED_F6A4_5BD3_B85E_E6B6527D8D79" presentation="$(presentation.POL_E6D23CDA_DABC_5749_BEF1_D15FF80E02BF)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <text id="TXT_DEC758B4_6B3C_5882_B0B8_386473EECFD3" key="Software\Policies\Samba\smb_conf\ldap follow referral" valueName="ldap follow referral"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_E31CD0A8_5A4A_5657_8ACA_123A200C6E06)" explainText="$(string.POL_E31CD0A8_5A4A_5657_8ACA_123A200C6E06_Help)" key="Software\Policies\Samba\smb_conf" name="POL_E31CD0A8_5A4A_5657_8ACA_123A200C6E06" presentation="$(presentation.POL_6C44A469_31FA_512A_AB08_ACDADD5B7238)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <text id="TXT_B51FB55F_3A49_539E_A77A_7F7F2AF2CC39" key="Software\Policies\Samba\smb_conf\ldap group suffix" valueName="ldap group suffix"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_FC4495FC_4C6E_50C8_9B37_08D9955A883B)" explainText="$(string.POL_FC4495FC_4C6E_50C8_9B37_08D9955A883B_Help)" key="Software\Policies\Samba\smb_conf" name="POL_FC4495FC_4C6E_50C8_9B37_08D9955A883B" presentation="$(presentation.POL_83D7A344_AE69_5DCA_A3D9_A79DF817A7D4)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <text id="TXT_E49CAB56_E62A_5930_99DE_EEC0B04DBCF4" key="Software\Policies\Samba\smb_conf\ldap idmap suffix" valueName="ldap idmap suffix"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_2ED1402F_4CF6_5CED_BE40_9B112E1238DC)" explainText="$(string.POL_2ED1402F_4CF6_5CED_BE40_9B112E1238DC_Help)" key="Software\Policies\Samba\smb_conf" name="POL_2ED1402F_4CF6_5CED_BE40_9B112E1238DC" presentation="$(presentation.POL_07D748C7_B6EA_558D_B652_62F9BC2E9A1B)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <text id="TXT_2B9911E2_33DC_5CB0_A9CC_E7DD7B2A5799" key="Software\Policies\Samba\smb_conf\ldap machine suffix" valueName="ldap machine suffix"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_12C5B04D_D734_576A_99F1_7475BC9E90D7)" explainText="$(string.POL_12C5B04D_D734_576A_99F1_7475BC9E90D7_Help)" key="Software\Policies\Samba\smb_conf" name="POL_12C5B04D_D734_576A_99F1_7475BC9E90D7" presentation="$(presentation.POL_F831F898_66A7_53D3_B6EA_B90065F7EF41)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <decimal id="DXT_1C52332B_FC98_54CA_8C3D_64E63D450DD7" key="Software\Policies\Samba\smb_conf\ldap page size" valueName="ldap page size"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_DB427B53_CF02_5410_AE37_5BD4E8B968CE)" explainText="$(string.POL_DB427B53_CF02_5410_AE37_5BD4E8B968CE_Help)" key="Software\Policies\Samba\smb_conf" name="POL_DB427B53_CF02_5410_AE37_5BD4E8B968CE" presentation="$(presentation.POL_068B0430_6CF2_5CAC_BDC8_F7074411AA6C)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <text id="TXT_03529C2D_378A_5BE4_A342_9FF088AC8396" key="Software\Policies\Samba\smb_conf\ldap passwd sync" valueName="ldap passwd sync"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_0C51A40C_E06E_5A0A_B160_5EB21289B17D)" explainText="$(string.POL_0C51A40C_E06E_5A0A_B160_5EB21289B17D_Help)" key="Software\Policies\Samba\smb_conf" name="POL_0C51A40C_E06E_5A0A_B160_5EB21289B17D" presentation="$(presentation.POL_DC0C1ABD_D8CE_5175_A9AB_D58661AACFB1)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <decimal id="DXT_B21A5F63_507D_5407_B582_DA64138C6B97" key="Software\Policies\Samba\smb_conf\ldap replication sleep" valueName="ldap replication sleep"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_763BAFE2_3FE0_5C25_B3DC_34AE48F2F569)" explainText="$(string.POL_763BAFE2_3FE0_5C25_B3DC_34AE48F2F569_Help)" key="Software\Policies\Samba\smb_conf" name="POL_763BAFE2_3FE0_5C25_B3DC_34AE48F2F569" presentation="$(presentation.POL_F12B9752_4939_52A6_9A5E_52FFF53FC34F)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <text id="TXT_3ADB0A83_AA24_5C68_BD2E_3723FC2F2268" key="Software\Policies\Samba\smb_conf\ldapsam:editposix" valueName="ldapsam:editposix"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_F7979912_0010_5656_BC3A_08876A56418C)" explainText="$(string.POL_F7979912_0010_5656_BC3A_08876A56418C_Help)" key="Software\Policies\Samba\smb_conf" name="POL_F7979912_0010_5656_BC3A_08876A56418C" presentation="$(presentation.POL_90ECE51D_8CF8_50F9_809F_87A024DDCAAE)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <text id="TXT_B10770E9_1959_5A4A_8D44_F070923C2A12" key="Software\Policies\Samba\smb_conf\ldapsam:trusted" valueName="ldapsam:trusted"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_04D79AF3_042D_5ABC_BE8F_4C6628E0F703)" explainText="$(string.POL_04D79AF3_042D_5ABC_BE8F_4C6628E0F703_Help)" key="Software\Policies\Samba\smb_conf" name="POL_04D79AF3_042D_5ABC_BE8F_4C6628E0F703" presentation="$(presentation.POL_B58FAA75_79BA_53E3_A895_69D6DE3E547E)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <text id="TXT_9F11612E_1A6E_5CF7_BC96_4ADBD123A76D" key="Software\Policies\Samba\smb_conf\ldap server require strong auth" valueName="ldap server require strong auth"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_5B8B9520_4858_5C2F_AA85_F972FF86784A)" explainText="$(string.POL_5B8B9520_4858_5C2F_AA85_F972FF86784A_Help)" key="Software\Policies\Samba\smb_conf" name="POL_5B8B9520_4858_5C2F_AA85_F972FF86784A" presentation="$(presentation.POL_D6465FAC_2205_59C0_A3E6_1F1DE4C50A58)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <text id="TXT_950B2F92_3A19_5FC4_839A_3226C858811C" key="Software\Policies\Samba\smb_conf\ldap ssl" valueName="ldap ssl"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_42494B88_7254_5F5F_B738_D5D10BCFBC6C)" explainText="$(string.POL_42494B88_7254_5F5F_B738_D5D10BCFBC6C_Help)" key="Software\Policies\Samba\smb_conf" name="POL_42494B88_7254_5F5F_B738_D5D10BCFBC6C" presentation="$(presentation.POL_EAF3D0F1_C7E5_5864_AE5D_FBF9F6102FF4)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <boolean id="CHK_0D06C9D8_3A6A_509E_9B4A_DE497AFA6B58" key="Software\Policies\Samba\smb_conf\ldap ssl ads" valueName="ldap ssl ads"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_9B071174_FBD3_5CA8_82AA_3BD1EB7BCF45)" explainText="$(string.POL_9B071174_FBD3_5CA8_82AA_3BD1EB7BCF45_Help)" key="Software\Policies\Samba\smb_conf" name="POL_9B071174_FBD3_5CA8_82AA_3BD1EB7BCF45" presentation="$(presentation.POL_208E2789_E8A9_53CA_B756_2694096B8DAF)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <text id="TXT_ABB81954_F41C_5FAD_BD35_873007549C27" key="Software\Policies\Samba\smb_conf\ldap suffix" valueName="ldap suffix"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_40F4D046_B9E1_53B0_9DC9_1AE4DE9B1976)" explainText="$(string.POL_40F4D046_B9E1_53B0_9DC9_1AE4DE9B1976_Help)" key="Software\Policies\Samba\smb_conf" name="POL_40F4D046_B9E1_53B0_9DC9_1AE4DE9B1976" presentation="$(presentation.POL_D76D653B_C2A3_5939_BF95_9BAE0CF6C88C)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <decimal id="DXT_8B73DF13_A7A3_57B4_A4BE_AC816E59EBAB" key="Software\Policies\Samba\smb_conf\ldap timeout" valueName="ldap timeout"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_26984E46_7C64_57A4_B4BF_C2C2B13C330E)" explainText="$(string.POL_26984E46_7C64_57A4_B4BF_C2C2B13C330E_Help)" key="Software\Policies\Samba\smb_conf" name="POL_26984E46_7C64_57A4_B4BF_C2C2B13C330E" presentation="$(presentation.POL_B3FBC8E2_DD5D_5CEA_9FC5_44687CF36BB5)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <text id="TXT_B9F4F586_8F61_53D2_AFEE_B2011D0DFF43" key="Software\Policies\Samba\smb_conf\ldap user suffix" valueName="ldap user suffix"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_AB95F2C5_BFBC_5955_8062_8B446AF7E84C)" explainText="$(string.POL_AB95F2C5_BFBC_5955_8062_8B446AF7E84C_Help)" key="Software\Policies\Samba\smb_conf" name="POL_AB95F2C5_BFBC_5955_8062_8B446AF7E84C" presentation="$(presentation.POL_94ABA1F3_F411_52AE_ADAA_72B53F9198CA)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <decimal id="DXT_B7AEDDC2_0B5A_5C1C_AFA0_7518773C5F5F" key="Software\Policies\Samba\smb_conf\ldap max anonymous request size" valueName="ldap max anonymous request size"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_23FFECD5_A3C4_566C_AEB3_015F25B1A978)" explainText="$(string.POL_23FFECD5_A3C4_566C_AEB3_015F25B1A978_Help)" key="Software\Policies\Samba\smb_conf" name="POL_23FFECD5_A3C4_566C_AEB3_015F25B1A978" presentation="$(presentation.POL_A2C8FD60_A284_5409_B130_B135DEE4B615)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <decimal id="DXT_1B597D08_FFDB_5BA4_ABD9_31A8446A3625" key="Software\Policies\Samba\smb_conf\ldap max authenticated request size" valueName="ldap max authenticated request size"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_F7C651B1_70B4_5047_BC65_2E4D382CBD15)" explainText="$(string.POL_F7C651B1_70B4_5047_BC65_2E4D382CBD15_Help)" key="Software\Policies\Samba\smb_conf" name="POL_F7C651B1_70B4_5047_BC65_2E4D382CBD15" presentation="$(presentation.POL_695C7E25_8C69_519C_907E_9A71D1FE2EC3)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <decimal id="DXT_6FA557BE_E2D9_54CC_9A8D_FAA4BFCD552A" key="Software\Policies\Samba\smb_conf\ldap max search request size" valueName="ldap max search request size"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_B3B2B9CC_3DBC_5C45_AA31_7C1E52AFEFAF)" explainText="$(string.POL_B3B2B9CC_3DBC_5C45_AA31_7C1E52AFEFAF_Help)" key="Software\Policies\Samba\smb_conf" name="POL_B3B2B9CC_3DBC_5C45_AA31_7C1E52AFEFAF" presentation="$(presentation.POL_60E126C5_9E79_54DC_B201_A3E643352D00)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <decimal id="DXT_8D517C10_BE65_5D58_AC86_8A21017F479A" key="Software\Policies\Samba\smb_conf\lock spin time" valueName="lock spin time"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_4A0366F2_6815_5654_8DC2_F68E840E53F4)" explainText="$(string.POL_4A0366F2_6815_5654_8DC2_F68E840E53F4_Help)" key="Software\Policies\Samba\smb_conf" name="POL_4A0366F2_6815_5654_8DC2_F68E840E53F4" presentation="$(presentation.POL_6B50B6B6_D038_54C5_BD82_9D377C2E8C0C)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <decimal id="DXT_14C326D8_5326_5883_95FA_D903E07A457A" key="Software\Policies\Samba\smb_conf\oplock break wait time" valueName="oplock break wait time"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_B49FAE41_B4C1_5AFA_870E_9E1C35F9A96F)" explainText="$(string.POL_B49FAE41_B4C1_5AFA_870E_9E1C35F9A96F_Help)" key="Software\Policies\Samba\smb_conf" name="POL_B49FAE41_B4C1_5AFA_870E_9E1C35F9A96F" presentation="$(presentation.POL_D9E75BB0_F19B_5F72_A58E_22718E614EB3)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <boolean id="CHK_8649286E_DE5D_5DE7_A836_AA15E736A911" key="Software\Policies\Samba\smb_conf\smb2 leases" valueName="smb2 leases"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_1E9B5BE6_8C81_5141_88CD_B5AC0E8D964B)" explainText="$(string.POL_1E9B5BE6_8C81_5141_88CD_B5AC0E8D964B_Help)" key="Software\Policies\Samba\smb_conf" name="POL_1E9B5BE6_8C81_5141_88CD_B5AC0E8D964B" presentation="$(presentation.POL_D7003A7B_D00A_51AE_8D40_7446533B2974)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <boolean id="CHK_4915975F_60D1_5187_9E6A_F835D1086622" key="Software\Policies\Samba\smb_conf\debug class" valueName="debug class"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_07D2E039_C5A0_5123_BD71_0C74E2569310)" explainText="$(string.POL_07D2E039_C5A0_5123_BD71_0C74E2569310_Help)" key="Software\Policies\Samba\smb_conf" name="POL_07D2E039_C5A0_5123_BD71_0C74E2569310" presentation="$(presentation.POL_CF714212_43A8_52ED_BDAD_B1D6F82A6EF9)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <boolean id="CHK_ADDEF100_7619_5056_B632_ECEF204DBEC8" key="Software\Policies\Samba\smb_conf\debug hires timestamp" valueName="debug hires timestamp"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_E066DF4A_5BA1_5B35_A96F_90DE6CF27132)" explainText="$(string.POL_E066DF4A_5BA1_5B35_A96F_90DE6CF27132_Help)" key="Software\Policies\Samba\smb_conf" name="POL_E066DF4A_5BA1_5B35_A96F_90DE6CF27132" presentation="$(presentation.POL_CF524D7E_11CA_5027_9777_5398DD2804B4)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <boolean id="CHK_6D39A340_480D_596C_A9F5_3412FC28765D" key="Software\Policies\Samba\smb_conf\debug pid" valueName="debug pid"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_4B4EF8B5_3526_5583_8174_E3E332727970)" explainText="$(string.POL_4B4EF8B5_3526_5583_8174_E3E332727970_Help)" key="Software\Policies\Samba\smb_conf" name="POL_4B4EF8B5_3526_5583_8174_E3E332727970" presentation="$(presentation.POL_BDF671C9_3811_5B19_AB78_5F12B25CEC84)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <boolean id="CHK_2367747B_4E47_503A_A92C_1EA98AC3D5CC" key="Software\Policies\Samba\smb_conf\debug prefix timestamp" valueName="debug prefix timestamp"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_571A8B87_3CCC_5725_BA33_BDEE367BB740)" explainText="$(string.POL_571A8B87_3CCC_5725_BA33_BDEE367BB740_Help)" key="Software\Policies\Samba\smb_conf" name="POL_571A8B87_3CCC_5725_BA33_BDEE367BB740" presentation="$(presentation.POL_B76DE893_21E7_5B6A_81AB_23B8F00D782D)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <boolean id="CHK_5BD4217F_5C51_59D6_9582_3037FB4B6E4F" key="Software\Policies\Samba\smb_conf\debug uid" valueName="debug uid"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_2167CEE9_B2C9_5574_8F7D_F38DA9EBBFF1)" explainText="$(string.POL_2167CEE9_B2C9_5574_8F7D_F38DA9EBBFF1_Help)" key="Software\Policies\Samba\smb_conf" name="POL_2167CEE9_B2C9_5574_8F7D_F38DA9EBBFF1" presentation="$(presentation.POL_BACB061C_C7A0_5830_80FE_15FA009DEAA2)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <decimal id="DXT_DBF1992F_D735_55E7_9029_AE5D9EBA66FB" key="Software\Policies\Samba\smb_conf\ldap debug level" valueName="ldap debug level"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_F324946B_9B0D_53F0_AD4F_56800DD63085)" explainText="$(string.POL_F324946B_9B0D_53F0_AD4F_56800DD63085_Help)" key="Software\Policies\Samba\smb_conf" name="POL_F324946B_9B0D_53F0_AD4F_56800DD63085" presentation="$(presentation.POL_B51CE2D4_7EFD_577E_97EC_8EEA650C0F0F)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <decimal id="DXT_2D488F55_5DE8_5AC6_85AE_F77BE4429364" key="Software\Policies\Samba\smb_conf\ldap debug threshold" valueName="ldap debug threshold"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_3A601C55_A5EB_5E86_817B_38DACFD45CF9)" explainText="$(string.POL_3A601C55_A5EB_5E86_817B_38DACFD45CF9_Help)" key="Software\Policies\Samba\smb_conf" name="POL_3A601C55_A5EB_5E86_817B_38DACFD45CF9" presentation="$(presentation.POL_1C03B9BE_5E74_58CF_A649_CDFD9E91F6CC)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <text id="TXT_2C83A41B_5CDA_5130_8343_1278307321CD" key="Software\Policies\Samba\smb_conf\log file" valueName="log file"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_A3E0303F_93B5_5C1F_8C01_362881F843CC)" explainText="$(string.POL_A3E0303F_93B5_5C1F_8C01_362881F843CC_Help)" key="Software\Policies\Samba\smb_conf" name="POL_A3E0303F_93B5_5C1F_8C01_362881F843CC" presentation="$(presentation.POL_FA6B22DA_628C_5C5E_8BAD_97BBCE0E4F1F)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <text id="TXT_2533346E_4C1C_5ACB_9355_B40495EB63CD" key="Software\Policies\Samba\smb_conf\logging" valueName="logging"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_E077BD91_3587_5DBA_A7CB_13044D97E451)" explainText="$(string.POL_E077BD91_3587_5DBA_A7CB_13044D97E451_Help)" key="Software\Policies\Samba\smb_conf" name="POL_E077BD91_3587_5DBA_A7CB_13044D97E451" presentation="$(presentation.POL_C4E11396_B289_5D98_9F39_6BD19BBB4330)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <text id="TXT_60E8D3F6_8EC7_5FDC_8645_3E4E3EF85512" key="Software\Policies\Samba\smb_conf\log level" valueName="log level"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_7E7EB779_098F_5383_A0B3_66216F434918)" explainText="$(string.POL_7E7EB779_098F_5383_A0B3_66216F434918_Help)" key="Software\Policies\Samba\smb_conf" name="POL_7E7EB779_098F_5383_A0B3_66216F434918" presentation="$(presentation.POL_EA5127A5_4C6A_5B8A_9D52_D5D17D9E8AFE)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <decimal id="DXT_60E6F44F_5185_576D_91C2_9B10FB853416" key="Software\Policies\Samba\smb_conf\max log size" valueName="max log size"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_57C1D731_63A4_519D_BD0B_05683B94BFDB)" explainText="$(string.POL_57C1D731_63A4_519D_BD0B_05683B94BFDB_Help)" key="Software\Policies\Samba\smb_conf" name="POL_57C1D731_63A4_519D_BD0B_05683B94BFDB" presentation="$(presentation.POL_69FD7A6B_0BA2_570F_9BB1_B869C7404630)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <decimal id="DXT_FCD3912D_FD93_54A5_91E4_A834457B8F2E" key="Software\Policies\Samba\smb_conf\syslog" valueName="syslog"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_07C28AF5_BA9B_5B55_A018_28B10E803B26)" explainText="$(string.POL_07C28AF5_BA9B_5B55_A018_28B10E803B26_Help)" key="Software\Policies\Samba\smb_conf" name="POL_07C28AF5_BA9B_5B55_A018_28B10E803B26" presentation="$(presentation.POL_FD3A0B38_1664_58B4_983A_3A21EC4A76EA)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <boolean id="CHK_88778A4E_D102_588A_A01C_E930BEE81D6C" key="Software\Policies\Samba\smb_conf\syslog only" valueName="syslog only"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_C2541812_F829_51FC_93D7_75BA34C1F487)" explainText="$(string.POL_C2541812_F829_51FC_93D7_75BA34C1F487_Help)" key="Software\Policies\Samba\smb_conf" name="POL_C2541812_F829_51FC_93D7_75BA34C1F487" presentation="$(presentation.POL_AB153BC2_9291_51D0_81AC_1A78B1A0DE6F)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <boolean id="CHK_16FD7E9E_1FCF_58D9_940E_42D45860825B" key="Software\Policies\Samba\smb_conf\timestamp logs" valueName="timestamp logs"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_3B7BF4ED_04E2_5466_9368_8610A5657F8F)" explainText="$(string.POL_3B7BF4ED_04E2_5466_9368_8610A5657F8F_Help)" key="Software\Policies\Samba\smb_conf" name="POL_3B7BF4ED_04E2_5466_9368_8610A5657F8F" presentation="$(presentation.POL_7C7A3857_7762_5F1F_BDB5_A621FEBD0E99)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <text id="TXT_6716C37B_3C84_5AB4_8A8D_B6D070787CEB" key="Software\Policies\Samba\smb_conf\abort shutdown script" valueName="abort shutdown script"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_7EEBACBA_ED90_5C68_826F_737212B364EF)" explainText="$(string.POL_7EEBACBA_ED90_5C68_826F_737212B364EF_Help)" key="Software\Policies\Samba\smb_conf" name="POL_7EEBACBA_ED90_5C68_826F_737212B364EF" presentation="$(presentation.POL_A6105481_F59A_5B08_8B4C_B100EF112BD9)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <text id="TXT_BB6CFFBF_3E2F_5FDF_A2CC_E255231A3370" key="Software\Policies\Samba\smb_conf\add group script" valueName="add group script"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_96F9DA59_163C_56B8_9F66_40CAAD868F91)" explainText="$(string.POL_96F9DA59_163C_56B8_9F66_40CAAD868F91_Help)" key="Software\Policies\Samba\smb_conf" name="POL_96F9DA59_163C_56B8_9F66_40CAAD868F91" presentation="$(presentation.POL_01C79ED8_2727_54DF_AF75_96E5A25722DD)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <text id="TXT_C3FD37B5_A643_57DF_AE57_048E75B21BDF" key="Software\Policies\Samba\smb_conf\add machine script" valueName="add machine script"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_4AEC4EDA_3303_57E2_BC12_784F40DACA8F)" explainText="$(string.POL_4AEC4EDA_3303_57E2_BC12_784F40DACA8F_Help)" key="Software\Policies\Samba\smb_conf" name="POL_4AEC4EDA_3303_57E2_BC12_784F40DACA8F" presentation="$(presentation.POL_BA7787E8_0D26_5963_8F44_498B278A4703)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <text id="TXT_56C28546_216A_5AFF_B212_FFEC207F3FFD" key="Software\Policies\Samba\smb_conf\add user script" valueName="add user script"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_5268249C_58BD_59DA_B44F_DA9109370C58)" explainText="$(string.POL_5268249C_58BD_59DA_B44F_DA9109370C58_Help)" key="Software\Policies\Samba\smb_conf" name="POL_5268249C_58BD_59DA_B44F_DA9109370C58" presentation="$(presentation.POL_077466DB_CB4D_5489_8934_C2F22592D94A)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <text id="TXT_218549FC_FD8A_5036_8199_9B2AB628624F" key="Software\Policies\Samba\smb_conf\add user to group script" valueName="add user to group script"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_89206841_7524_5BFF_872C_444F45C82318)" explainText="$(string.POL_89206841_7524_5BFF_872C_444F45C82318_Help)" key="Software\Policies\Samba\smb_conf" name="POL_89206841_7524_5BFF_872C_444F45C82318" presentation="$(presentation.POL_8F632169_4F0C_500B_BE8B_88960312C345)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <boolean id="CHK_61299541_E6C3_50AD_9CCD_409DBABC3DA2" key="Software\Policies\Samba\smb_conf\allow nt4 crypto" valueName="allow nt4 crypto"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_9A41AF51_88E9_5566_B12E_36DEA5C42D49)" explainText="$(string.POL_9A41AF51_88E9_5566_B12E_36DEA5C42D49_Help)" key="Software\Policies\Samba\smb_conf" name="POL_9A41AF51_88E9_5566_B12E_36DEA5C42D49" presentation="$(presentation.POL_5A6DC206_1A48_5FFE_8B2D_897EF95CCBAD)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <boolean id="CHK_F34DA878_4D45_5E26_8454_77BAE0D9FCAA" key="Software\Policies\Samba\smb_conf\auth event notification" valueName="auth event notification"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_1CAC5DAB_3CB5_586A_AB6F_84E39DDF4796)" explainText="$(string.POL_1CAC5DAB_3CB5_586A_AB6F_84E39DDF4796_Help)" key="Software\Policies\Samba\smb_conf" name="POL_1CAC5DAB_3CB5_586A_AB6F_84E39DDF4796" presentation="$(presentation.POL_3152501B_87A8_5907_AAD5_00B3F7752516)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <text id="TXT_F75A550B_6B11_57A4_9EAD_27361359E4CB" key="Software\Policies\Samba\smb_conf\delete group script" valueName="delete group script"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_789E0632_E8D7_5FD6_86C6_0EBD079D28C4)" explainText="$(string.POL_789E0632_E8D7_5FD6_86C6_0EBD079D28C4_Help)" key="Software\Policies\Samba\smb_conf" name="POL_789E0632_E8D7_5FD6_86C6_0EBD079D28C4" presentation="$(presentation.POL_676F211D_0B27_54F6_9FF0_1B6F6CC88CA6)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <text id="TXT_E6287F6E_CDD6_57CC_A6CF_59E26391473A" key="Software\Policies\Samba\smb_conf\delete user from group script" valueName="delete user from group script"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_A399CF3E_C0C6_594B_8F31_F2AA4A18B5AC)" explainText="$(string.POL_A399CF3E_C0C6_594B_8F31_F2AA4A18B5AC_Help)" key="Software\Policies\Samba\smb_conf" name="POL_A399CF3E_C0C6_594B_8F31_F2AA4A18B5AC" presentation="$(presentation.POL_3033EDC8_8938_5A64_A8B9_1F7349DC1149)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <text id="TXT_1FC62BD1_6541_5C03_B233_B5DE1B987775" key="Software\Policies\Samba\smb_conf\delete user script" valueName="delete user script"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_B35B056A_EEB8_5B89_9FCC_127565F4A6AC)" explainText="$(string.POL_B35B056A_EEB8_5B89_9FCC_127565F4A6AC_Help)" key="Software\Policies\Samba\smb_conf" name="POL_B35B056A_EEB8_5B89_9FCC_127565F4A6AC" presentation="$(presentation.POL_27365CD7_D0DF_5A41_9140_A1C6970CB3D0)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <boolean id="CHK_B67618DB_ED7B_5A2E_AC14_C2E808E1A927" key="Software\Policies\Samba\smb_conf\domain logons" valueName="domain logons"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_3B3E3AD6_FB80_5225_8EDA_6066E5987CE1)" explainText="$(string.POL_3B3E3AD6_FB80_5225_8EDA_6066E5987CE1_Help)" key="Software\Policies\Samba\smb_conf" name="POL_3B3E3AD6_FB80_5225_8EDA_6066E5987CE1" presentation="$(presentation.POL_49526C11_2F64_5D85_A25D_A90D2152195E)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <boolean id="CHK_A6532133_05F0_5D5F_983E_8924AB2334D5" key="Software\Policies\Samba\smb_conf\enable privileges" valueName="enable privileges"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_130E1C0E_9AED_52F5_B1AB_20FD88C999E8)" explainText="$(string.POL_130E1C0E_9AED_52F5_B1AB_20FD88C999E8_Help)" key="Software\Policies\Samba\smb_conf" name="POL_130E1C0E_9AED_52F5_B1AB_20FD88C999E8" presentation="$(presentation.POL_026CF0E2_B95C_5B67_BBAA_E95C5F809B28)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <decimal id="DXT_1FD373A1_8A61_5884_9208_07A886F6334F" key="Software\Policies\Samba\smb_conf\init logon delay" valueName="init logon delay"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_EEBDC4C9_64BA_58DF_B7A3_C384D6972690)" explainText="$(string.POL_EEBDC4C9_64BA_58DF_B7A3_C384D6972690_Help)" key="Software\Policies\Samba\smb_conf" name="POL_EEBDC4C9_64BA_58DF_B7A3_C384D6972690" presentation="$(presentation.POL_B9587C82_562E_5CA5_8BBD_835B3940D00D)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <text id="TXT_633A0D2D_C7E6_54EF_BCE0_46ECFB6B2C1E" key="Software\Policies\Samba\smb_conf\init logon delayed hosts" valueName="init logon delayed hosts"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_2FCE2207_11A6_5B55_9ECC_49D171438176)" explainText="$(string.POL_2FCE2207_11A6_5B55_9ECC_49D171438176_Help)" key="Software\Policies\Samba\smb_conf" name="POL_2FCE2207_11A6_5B55_9ECC_49D171438176" presentation="$(presentation.POL_84F161E0_6C65_55C2_9DB5_CC61E66CEA9F)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <text id="TXT_8F910181_D80D_58A5_937D_186E347E6433" key="Software\Policies\Samba\smb_conf\logon drive" valueName="logon drive"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_12DCA5BB_14ED_5BC6_AB9D_E6A57E943B24)" explainText="$(string.POL_12DCA5BB_14ED_5BC6_AB9D_E6A57E943B24_Help)" key="Software\Policies\Samba\smb_conf" name="POL_12DCA5BB_14ED_5BC6_AB9D_E6A57E943B24" presentation="$(presentation.POL_508CD547_53D7_59ED_BB1F_E6EE939C1AF2)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <text id="TXT_3C94DDFB_94DD_598E_BC0D_B70465DA9C0C" key="Software\Policies\Samba\smb_conf\logon home" valueName="logon home"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_6C04D9F3_27E3_51A9_82B5_BEB5265E1236)" explainText="$(string.POL_6C04D9F3_27E3_51A9_82B5_BEB5265E1236_Help)" key="Software\Policies\Samba\smb_conf" name="POL_6C04D9F3_27E3_51A9_82B5_BEB5265E1236" presentation="$(presentation.POL_204A522A_CF55_5E96_A2AD_B58E105AA80C)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <text id="TXT_05B40781_B875_53DD_B1DD_4CA590B56E4A" key="Software\Policies\Samba\smb_conf\logon path" valueName="logon path"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_D354C217_6C18_5AD8_B0A2_DDC89463D0C6)" explainText="$(string.POL_D354C217_6C18_5AD8_B0A2_DDC89463D0C6_Help)" key="Software\Policies\Samba\smb_conf" name="POL_D354C217_6C18_5AD8_B0A2_DDC89463D0C6" presentation="$(presentation.POL_A1B5FFEC_19C2_5415_ACE0_38E5D118E369)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <text id="TXT_C1B894A7_BDF5_52B8_AC59_900953D453AC" key="Software\Policies\Samba\smb_conf\logon script" valueName="logon script"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_0AABECB8_5A60_50DA_973A_7EED1138DB0C)" explainText="$(string.POL_0AABECB8_5A60_50DA_973A_7EED1138DB0C_Help)" key="Software\Policies\Samba\smb_conf" name="POL_0AABECB8_5A60_50DA_973A_7EED1138DB0C" presentation="$(presentation.POL_DD7A32CE_6F63_596B_8E15_43B11C82E2AF)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <boolean id="CHK_805FD143_5242_56DE_BD51_0B514A588E9F" key="Software\Policies\Samba\smb_conf\reject md5 clients" valueName="reject md5 clients"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_68A94D8F_DA35_5CEC_90E6_4FB245FF32D3)" explainText="$(string.POL_68A94D8F_DA35_5CEC_90E6_4FB245FF32D3_Help)" key="Software\Policies\Samba\smb_conf" name="POL_68A94D8F_DA35_5CEC_90E6_4FB245FF32D3" presentation="$(presentation.POL_2AD85924_5D09_571B_B048_E996EC819C57)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <text id="TXT_B00F123E_2430_5EA0_A543_92D22A0F5FD4" key="Software\Policies\Samba\smb_conf\set primary group script" valueName="set primary group script"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_5CDF89E1_F318_5495_BEA0_DA44F0542D49)" explainText="$(string.POL_5CDF89E1_F318_5495_BEA0_DA44F0542D49_Help)" key="Software\Policies\Samba\smb_conf" name="POL_5CDF89E1_F318_5495_BEA0_DA44F0542D49" presentation="$(presentation.POL_A8F30942_8D30_583F_8C0F_877BD20D9B26)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <text id="TXT_74A021FE_F97F_5D54_9C4E_023D1964D37E" key="Software\Policies\Samba\smb_conf\shutdown script" valueName="shutdown script"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_3F1B0630_F3F0_5FDE_B66B_1A315CC059B3)" explainText="$(string.POL_3F1B0630_F3F0_5FDE_B66B_1A315CC059B3_Help)" key="Software\Policies\Samba\smb_conf" name="POL_3F1B0630_F3F0_5FDE_B66B_1A315CC059B3" presentation="$(presentation.POL_F0D581AB_54B4_58AA_9B84_6794FB8D3D55)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <text id="TXT_C77D6CE7_BED5_52A8_BD8C_0259439992FA" key="Software\Policies\Samba\smb_conf\add share command" valueName="add share command"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_66A8EC32_6235_5E7C_A085_189166239268)" explainText="$(string.POL_66A8EC32_6235_5E7C_A085_189166239268_Help)" key="Software\Policies\Samba\smb_conf" name="POL_66A8EC32_6235_5E7C_A085_189166239268" presentation="$(presentation.POL_91CEEB79_E73B_563E_84CC_0C1483141142)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <decimal id="DXT_FBB1DAD6_26B9_5FB1_9678_EB499E48CC26" key="Software\Policies\Samba\smb_conf\afs token lifetime" valueName="afs token lifetime"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_78946CAB_73BD_507E_96D5_C643814290D0)" explainText="$(string.POL_78946CAB_73BD_507E_96D5_C643814290D0_Help)" key="Software\Policies\Samba\smb_conf" name="POL_78946CAB_73BD_507E_96D5_C643814290D0" presentation="$(presentation.POL_77D04206_AF73_51DE_9BE8_63524E440826)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <text id="TXT_22E4592F_8119_5A26_AF4F_0624F1AC5E0E" key="Software\Policies\Samba\smb_conf\afs username map" valueName="afs username map"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_DEF84B6C_B415_56EB_B3E7_1ED683BFEDE5)" explainText="$(string.POL_DEF84B6C_B415_56EB_B3E7_1ED683BFEDE5_Help)" key="Software\Policies\Samba\smb_conf" name="POL_DEF84B6C_B415_56EB_B3E7_1ED683BFEDE5" presentation="$(presentation.POL_5FA91D1E_B675_5681_9FE8_E14B3E1BA737)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <boolean id="CHK_AC4E2E8E_74FE_5FD1_B6F4_3637B4582348" key="Software\Policies\Samba\smb_conf\allow insecure wide links" valueName="allow insecure wide links"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_8539DC0B_8971_5145_8173_C77681F13A94)" explainText="$(string.POL_8539DC0B_8971_5145_8173_C77681F13A94_Help)" key="Software\Policies\Samba\smb_conf" name="POL_8539DC0B_8971_5145_8173_C77681F13A94" presentation="$(presentation.POL_153D9711_80CD_56CD_8A51_DDA71A3800C0)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <boolean id="CHK_D36441A8_7E2F_5174_8483_4DFE0503C16D" key="Software\Policies\Samba\smb_conf\allow unsafe cluster upgrade" valueName="allow unsafe cluster upgrade"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_A05EAA54_C6F4_567A_8DE6_7541F9B11046)" explainText="$(string.POL_A05EAA54_C6F4_567A_8DE6_7541F9B11046_Help)" key="Software\Policies\Samba\smb_conf" name="POL_A05EAA54_C6F4_567A_8DE6_7541F9B11046" presentation="$(presentation.POL_DFD4B19F_8874_5AE7_83CE_F8F507F26D51)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <boolean id="CHK_E37B6C82_F04E_5025_B457_01D9296753BE" key="Software\Policies\Samba\smb_conf\async smb echo handler" valueName="async smb echo handler"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_087EEAB6_7F83_50CF_A3D0_97B4C6F94F67)" explainText="$(string.POL_087EEAB6_7F83_50CF_A3D0_97B4C6F94F67_Help)" key="Software\Policies\Samba\smb_conf" name="POL_087EEAB6_7F83_50CF_A3D0_97B4C6F94F67" presentation="$(presentation.POL_AA42E677_62D1_5408_A8B7_98222854E79B)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <text id="TXT_34B124B0_A219_5575_BFDC_EAC426D7A3A5" key="Software\Policies\Samba\smb_conf\auto services" valueName="auto services"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_5518624A_7DB9_51BA_A891_F00A40152354)" explainText="$(string.POL_5518624A_7DB9_51BA_A891_F00A40152354_Help)" key="Software\Policies\Samba\smb_conf" name="POL_5518624A_7DB9_51BA_A891_F00A40152354" presentation="$(presentation.POL_2099F7FC_F033_5E2F_B2D0_17E1CCB2969A)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <text id="TXT_07FAF490_385F_5A63_8A03_BF34531D019D" key="Software\Policies\Samba\smb_conf\cache directory" valueName="cache directory"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_3E23F826_A699_511F_9370_F79DBB4977A9)" explainText="$(string.POL_3E23F826_A699_511F_9370_F79DBB4977A9_Help)" key="Software\Policies\Samba\smb_conf" name="POL_3E23F826_A699_511F_9370_F79DBB4977A9" presentation="$(presentation.POL_2CD315A0_5DDA_5123_A973_79C1DE40BC82)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <boolean id="CHK_1A966B04_20C5_5E97_8C75_71519DB4783C" key="Software\Policies\Samba\smb_conf\change notify" valueName="change notify"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_3EF254FF_4CC2_58A5_9A1B_4E0655610DCA)" explainText="$(string.POL_3EF254FF_4CC2_58A5_9A1B_4E0655610DCA_Help)" key="Software\Policies\Samba\smb_conf" name="POL_3EF254FF_4CC2_58A5_9A1B_4E0655610DCA" presentation="$(presentation.POL_2D514759_876D_5B59_B854_8DC51888BB02)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <text id="TXT_B8991748_9729_56D2_8DAD_5BAFEC5A7A8A" key="Software\Policies\Samba\smb_conf\change share command" valueName="change share command"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_93ADB149_A45A_56A2_9462_0BE437084E47)" explainText="$(string.POL_93ADB149_A45A_56A2_9462_0BE437084E47_Help)" key="Software\Policies\Samba\smb_conf" name="POL_93ADB149_A45A_56A2_9462_0BE437084E47" presentation="$(presentation.POL_239BABBB_C9C7_538A_B6CF_0FA2FC980562)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <text id="TXT_E05A6480_11BB_5FF4_8E6E_37E281DA95F6" key="Software\Policies\Samba\smb_conf\cluster addresses" valueName="cluster addresses"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_306A8E87_1400_5208_8ABF_B9802BFA685B)" explainText="$(string.POL_306A8E87_1400_5208_8ABF_B9802BFA685B_Help)" key="Software\Policies\Samba\smb_conf" name="POL_306A8E87_1400_5208_8ABF_B9802BFA685B" presentation="$(presentation.POL_92925554_781D_56B7_958E_DD33A753ED22)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <boolean id="CHK_D800E6F3_FB17_5561_9C47_88EB4384129D" key="Software\Policies\Samba\smb_conf\clustering" valueName="clustering"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_2D29302D_8AD7_5BC3_B681_8C54D0A61E68)" explainText="$(string.POL_2D29302D_8AD7_5BC3_B681_8C54D0A61E68_Help)" key="Software\Policies\Samba\smb_conf" name="POL_2D29302D_8AD7_5BC3_B681_8C54D0A61E68" presentation="$(presentation.POL_F2210D02_1B94_561B_9B05_1C5B896AF6D4)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <text id="TXT_EB6161C1_BF92_5E6F_A106_AAE90FBD9EBD" key="Software\Policies\Samba\smb_conf\config file" valueName="config file"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_3838911B_D4E6_50BD_B168_85F113E29165)" explainText="$(string.POL_3838911B_D4E6_50BD_B168_85F113E29165_Help)" key="Software\Policies\Samba\smb_conf" name="POL_3838911B_D4E6_50BD_B168_85F113E29165" presentation="$(presentation.POL_2EED8B7C_AF41_514A_A33D_8100A5F831AC)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <text id="TXT_E56A7A49_B6A1_502F_AF0E_A3944A5DBFFA" key="Software\Policies\Samba\smb_conf\ctdbd socket" valueName="ctdbd socket"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_57D6924C_3F94_5C29_8F63_39808A84FA0F)" explainText="$(string.POL_57D6924C_3F94_5C29_8F63_39808A84FA0F_Help)" key="Software\Policies\Samba\smb_conf" name="POL_57D6924C_3F94_5C29_8F63_39808A84FA0F" presentation="$(presentation.POL_0DE178AC_0A5A_5CDD_8BE6_0E24150CF2BA)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <decimal id="DXT_BB942009_69C3_5BAD_8507_AF692DF05CA1" key="Software\Policies\Samba\smb_conf\ctdb locktime warn threshold" valueName="ctdb locktime warn threshold"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_6392B974_5997_5E87_916F_FCDCCCCA6069)" explainText="$(string.POL_6392B974_5997_5E87_916F_FCDCCCCA6069_Help)" key="Software\Policies\Samba\smb_conf" name="POL_6392B974_5997_5E87_916F_FCDCCCCA6069" presentation="$(presentation.POL_026C959C_5371_5698_903A_03F46EEDEBE9)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <decimal id="DXT_8A4C2887_09B3_542A_A22B_EEC3404DBEF8" key="Software\Policies\Samba\smb_conf\ctdb timeout" valueName="ctdb timeout"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_65E02D5E_EC95_5CD1_9976_6FF4E023ADDD)" explainText="$(string.POL_65E02D5E_EC95_5CD1_9976_6FF4E023ADDD_Help)" key="Software\Policies\Samba\smb_conf" name="POL_65E02D5E_EC95_5CD1_9976_6FF4E023ADDD" presentation="$(presentation.POL_C16447B8_9E34_57E6_A1F7_A6F87E66CF73)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <text id="TXT_70112D53_C921_5D1F_9AFC_15D4890131CE" key="Software\Policies\Samba\smb_conf\default service" valueName="default service"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_6CD86A19_3EBF_5E3B_A686_462CA044C5D8)" explainText="$(string.POL_6CD86A19_3EBF_5E3B_A686_462CA044C5D8_Help)" key="Software\Policies\Samba\smb_conf" name="POL_6CD86A19_3EBF_5E3B_A686_462CA044C5D8" presentation="$(presentation.POL_41887133_D321_5526_B73E_2D5BEDA6B644)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <text id="TXT_7B81ED14_1277_5697_B4DE_2CCFB8F79BC3" key="Software\Policies\Samba\smb_conf\delete share command" valueName="delete share command"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_EA272781_6D7D_5FD5_96BF_069193C67F65)" explainText="$(string.POL_EA272781_6D7D_5FD5_96BF_069193C67F65_Help)" key="Software\Policies\Samba\smb_conf" name="POL_EA272781_6D7D_5FD5_96BF_069193C67F65" presentation="$(presentation.POL_B93F17F1_6F2A_5D04_AC96_EA043AC87144)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <boolean id="CHK_3D317248_E078_5FDD_B3C7_B7051C10506D" key="Software\Policies\Samba\smb_conf\dsdb event notification" valueName="dsdb event notification"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_560BC356_6AEC_5D1A_9859_6479FE0F97C0)" explainText="$(string.POL_560BC356_6AEC_5D1A_9859_6479FE0F97C0_Help)" key="Software\Policies\Samba\smb_conf" name="POL_560BC356_6AEC_5D1A_9859_6479FE0F97C0" presentation="$(presentation.POL_ED5A8D54_C086_5C46_985E_746D4ED62FEA)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <boolean id="CHK_F76A8EFA_4388_54E3_B283_976BA2DD2A2E" key="Software\Policies\Samba\smb_conf\dsdb group change notification" valueName="dsdb group change notification"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_2CF8E791_3F03_5CE3_AC93_0B8078E9667D)" explainText="$(string.POL_2CF8E791_3F03_5CE3_AC93_0B8078E9667D_Help)" key="Software\Policies\Samba\smb_conf" name="POL_2CF8E791_3F03_5CE3_AC93_0B8078E9667D" presentation="$(presentation.POL_5B2313F4_5239_57E8_88E9_822DBB4C0E77)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <boolean id="CHK_4B61A9A1_8E18_56CF_9B9E_6904A78328A0" key="Software\Policies\Samba\smb_conf\dsdb password event notification" valueName="dsdb password event notification"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_C8A040D9_B798_5FE4_A736_BAD9C81CE976)" explainText="$(string.POL_C8A040D9_B798_5FE4_A736_BAD9C81CE976_Help)" key="Software\Policies\Samba\smb_conf" name="POL_C8A040D9_B798_5FE4_A736_BAD9C81CE976" presentation="$(presentation.POL_B86BF972_B64C_57B2_9E82_96C5EECFAFA7)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <text id="TXT_7AB84D08_FB4A_5676_B106_B4DB68C5F577" key="Software\Policies\Samba\smb_conf\elasticsearch:mappings" valueName="elasticsearch:mappings"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_66C9072D_C818_5DFB_AB72_5EDDD4CAE999)" explainText="$(string.POL_66C9072D_C818_5DFB_AB72_5EDDD4CAE999_Help)" key="Software\Policies\Samba\smb_conf" name="POL_66C9072D_C818_5DFB_AB72_5EDDD4CAE999" presentation="$(presentation.POL_444019F3_369A_5807_805C_AB00E59CDD4B)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <boolean id="CHK_9EA28A80_4AA6_5D4A_8A14_E22205D488CD" key="Software\Policies\Samba\smb_conf\fss: prune stale" valueName="fss: prune stale"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_A7F4325A_910F_5437_B911_6D94050EF882)" explainText="$(string.POL_A7F4325A_910F_5437_B911_6D94050EF882_Help)" key="Software\Policies\Samba\smb_conf" name="POL_A7F4325A_910F_5437_B911_6D94050EF882" presentation="$(presentation.POL_472F0591_240C_5E5D_827C_49E760A75B8E)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <decimal id="DXT_D5D56481_74EE_5D10_8476_B3FDB82AE518" key="Software\Policies\Samba\smb_conf\fss: sequence timeout" valueName="fss: sequence timeout"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_529A6287_1697_57CA_A6D0_811F61A441A0)" explainText="$(string.POL_529A6287_1697_57CA_A6D0_811F61A441A0_Help)" key="Software\Policies\Samba\smb_conf" name="POL_529A6287_1697_57CA_A6D0_811F61A441A0" presentation="$(presentation.POL_DADF0887_C19B_5B14_9CEF_6721596557EB)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <text id="TXT_B001AD6C_7FA0_5EE0_8C4D_D506EECFF497" key="Software\Policies\Samba\smb_conf\homedir map" valueName="homedir map"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_3EE25C0A_C920_54B4_8B7B_D0A91CF3E3F1)" explainText="$(string.POL_3EE25C0A_C920_54B4_8B7B_D0A91CF3E3F1_Help)" key="Software\Policies\Samba\smb_conf" name="POL_3EE25C0A_C920_54B4_8B7B_D0A91CF3E3F1" presentation="$(presentation.POL_AFF4FEEA_8C88_5AED_9414_F4A320074A99)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <boolean id="CHK_F273132D_C805_596F_A0E1_B6ECB4752ADB" key="Software\Policies\Samba\smb_conf\kernel change notify" valueName="kernel change notify"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_15EAB330_0CF4_537E_AD96_8FCECB55194F)" explainText="$(string.POL_15EAB330_0CF4_537E_AD96_8FCECB55194F_Help)" key="Software\Policies\Samba\smb_conf" name="POL_15EAB330_0CF4_537E_AD96_8FCECB55194F" presentation="$(presentation.POL_4F279322_30AA_564B_844F_7827454574D2)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <text id="TXT_A384C210_BD62_5E63_B7EB_BC26844F51C8" key="Software\Policies\Samba\smb_conf\lock directory" valueName="lock directory"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_A53007F8_7951_51F3_9753_B6FA4B38B9B7)" explainText="$(string.POL_A53007F8_7951_51F3_9753_B6FA4B38B9B7_Help)" key="Software\Policies\Samba\smb_conf" name="POL_A53007F8_7951_51F3_9753_B6FA4B38B9B7" presentation="$(presentation.POL_1120E96A_0F8E_5827_A6D2_3CA7AD66D689)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <boolean id="CHK_EB18668D_E754_524B_B2D7_CC74BA90421D" key="Software\Policies\Samba\smb_conf\log writeable files on exit" valueName="log writeable files on exit"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_7DD9B43E_A2B8_59F8_9927_2B56698E65B6)" explainText="$(string.POL_7DD9B43E_A2B8_59F8_9927_2B56698E65B6_Help)" key="Software\Policies\Samba\smb_conf" name="POL_7DD9B43E_A2B8_59F8_9927_2B56698E65B6" presentation="$(presentation.POL_63067D3C_4F00_5193_92FE_A58651D4BACC)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <text id="TXT_18DDFF0D_D5DB_5617_AE32_D93BE7E38C4B" key="Software\Policies\Samba\smb_conf\message command" valueName="message command"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_3BDFEE33_A965_5CA9_BC8C_7E5FDA1BB1D5)" explainText="$(string.POL_3BDFEE33_A965_5CA9_BC8C_7E5FDA1BB1D5_Help)" key="Software\Policies\Samba\smb_conf" name="POL_3BDFEE33_A965_5CA9_BC8C_7E5FDA1BB1D5" presentation="$(presentation.POL_8765A188_6EFA_515B_B602_8F67140CFE7F)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <text id="TXT_C551A0C4_E3B9_5985_9492_C7F42D10E75C" key="Software\Policies\Samba\smb_conf\nbt client socket address" valueName="nbt client socket address"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_C4D98472_F115_59FD_A3E6_A7984D662B99)" explainText="$(string.POL_C4D98472_F115_59FD_A3E6_A7984D662B99_Help)" key="Software\Policies\Samba\smb_conf" name="POL_C4D98472_F115_59FD_A3E6_A7984D662B99" presentation="$(presentation.POL_D7C62F7B_B1B6_57B3_AE48_34D09A88ECFE)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <text id="TXT_1A090CE6_58F5_56F0_A29C_175CADD196D7" key="Software\Policies\Samba\smb_conf\ncalrpc dir" valueName="ncalrpc dir"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_4308D035_8B4B_575A_8984_BAC33A169EBA)" explainText="$(string.POL_4308D035_8B4B_575A_8984_BAC33A169EBA_Help)" key="Software\Policies\Samba\smb_conf" name="POL_4308D035_8B4B_575A_8984_BAC33A169EBA" presentation="$(presentation.POL_CCC72421_6131_58BC_BFE1_D9EC7399CD57)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <boolean id="CHK_8E5A65B4_42A2_5F00_8558_E69C28758E1B" key="Software\Policies\Samba\smb_conf\NIS homedir" valueName="NIS homedir"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_359CDEF8_9711_56A5_8621_C50718A5B8A1)" explainText="$(string.POL_359CDEF8_9711_56A5_8621_C50718A5B8A1_Help)" key="Software\Policies\Samba\smb_conf" name="POL_359CDEF8_9711_56A5_8621_C50718A5B8A1" presentation="$(presentation.POL_3E9DEECC_9015_5720_9251_CF804FAB2602)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <boolean id="CHK_49457A99_B4CF_594B_B796_916B9AB74838" key="Software\Policies\Samba\smb_conf\nmbd bind explicit broadcast" valueName="nmbd bind explicit broadcast"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_23418947_2DAF_54B3_812C_D9B43F49CFCB)" explainText="$(string.POL_23418947_2DAF_54B3_812C_D9B43F49CFCB_Help)" key="Software\Policies\Samba\smb_conf" name="POL_23418947_2DAF_54B3_812C_D9B43F49CFCB" presentation="$(presentation.POL_5A63DA17_F433_5414_A47F_26C5B9BE57C2)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <text id="TXT_A21115E3_D3E1_505B_9D2C_84A3DC428246" key="Software\Policies\Samba\smb_conf\panic action" valueName="panic action"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_C5C3267E_6E80_5311_96A5_B492C8C3C0AF)" explainText="$(string.POL_C5C3267E_6E80_5311_96A5_B492C8C3C0AF_Help)" key="Software\Policies\Samba\smb_conf" name="POL_C5C3267E_6E80_5311_96A5_B492C8C3C0AF" presentation="$(presentation.POL_50CDC71F_7927_5631_A40A_C0BD12899CA1)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <text id="TXT_6C7D4E2F_9ABE_5C67_9A8C_18D11AEF6038" key="Software\Policies\Samba\smb_conf\perfcount module" valueName="perfcount module"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_02EAE588_9ED7_589C_A454_5B168B65A48A)" explainText="$(string.POL_02EAE588_9ED7_589C_A454_5B168B65A48A_Help)" key="Software\Policies\Samba\smb_conf" name="POL_02EAE588_9ED7_589C_A454_5B168B65A48A" presentation="$(presentation.POL_A02E7761_E359_5528_A160_F2B67024244F)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <text id="TXT_DC19A229_4604_5CC9_8C83_CA2A1323653A" key="Software\Policies\Samba\smb_conf\pid directory" valueName="pid directory"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_77C5FC2D_BBFA_5B4E_906F_ED49B11BF069)" explainText="$(string.POL_77C5FC2D_BBFA_5B4E_906F_ED49B11BF069_Help)" key="Software\Policies\Samba\smb_conf" name="POL_77C5FC2D_BBFA_5B4E_906F_ED49B11BF069" presentation="$(presentation.POL_C030CCF1_08E7_5B6F_9239_F19B792C2157)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <boolean id="CHK_0200BA53_C2E5_5136_8A69_D8561A556A50" key="Software\Policies\Samba\smb_conf\registry shares" valueName="registry shares"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_0FB22970_94A4_5403_888E_3CF8242A955C)" explainText="$(string.POL_0FB22970_94A4_5403_888E_3CF8242A955C_Help)" key="Software\Policies\Samba\smb_conf" name="POL_0FB22970_94A4_5403_888E_3CF8242A955C" presentation="$(presentation.POL_ADE18BC6_D01E_58CF_98FA_BCDCC7CDDC37)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <text id="TXT_D765EA37_D1F5_50B2_91CE_49E66F462943" key="Software\Policies\Samba\smb_conf\remote announce" valueName="remote announce"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_B570A06A_7945_5818_B81D_D27007986548)" explainText="$(string.POL_B570A06A_7945_5818_B81D_D27007986548_Help)" key="Software\Policies\Samba\smb_conf" name="POL_B570A06A_7945_5818_B81D_D27007986548" presentation="$(presentation.POL_2D35EC75_4D7A_533F_96C8_3A331BDEDF34)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <text id="TXT_F44D8D8A_1E1F_5BEE_AB4F_B3DAAFB7DBA9" key="Software\Policies\Samba\smb_conf\remote browse sync" valueName="remote browse sync"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_BA134175_B8C1_5781_9585_AF3A47C44354)" explainText="$(string.POL_BA134175_B8C1_5781_9585_AF3A47C44354_Help)" key="Software\Policies\Samba\smb_conf" name="POL_BA134175_B8C1_5781_9585_AF3A47C44354" presentation="$(presentation.POL_2594A0C3_CF98_5B89_B182_1BB9C275B742)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <boolean id="CHK_57B96280_EA3D_5DAC_83DE_13338587A0D6" key="Software\Policies\Samba\smb_conf\reset on zero vc" valueName="reset on zero vc"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_F0071286_C011_5F1C_A520_2DD14DF7682C)" explainText="$(string.POL_F0071286_C011_5F1C_A520_2DD14DF7682C_Help)" key="Software\Policies\Samba\smb_conf" name="POL_F0071286_C011_5F1C_A520_2DD14DF7682C" presentation="$(presentation.POL_17837A58_88D4_5F29_8D41_479688BD8CBD)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <text id="TXT_90158AA7_C0BE_5650_9204_2AFC0BD9D5E8" key="Software\Policies\Samba\smb_conf\rpc_daemon:DAEMON" valueName="rpc_daemon:DAEMON"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_820BF686_A78C_5314_A371_3633A8448DC2)" explainText="$(string.POL_820BF686_A78C_5314_A371_3633A8448DC2_Help)" key="Software\Policies\Samba\smb_conf" name="POL_820BF686_A78C_5314_A371_3633A8448DC2" presentation="$(presentation.POL_AC41C088_31DF_569D_8FC8_8747C4A30548)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <text id="TXT_31E1741F_829C_5B90_9A2F_B0E0DC5F1E75" key="Software\Policies\Samba\smb_conf\rpc_server:SERVER" valueName="rpc_server:SERVER"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_70434A64_4979_53D2_80EE_09FBF1562741)" explainText="$(string.POL_70434A64_4979_53D2_80EE_09FBF1562741_Help)" key="Software\Policies\Samba\smb_conf" name="POL_70434A64_4979_53D2_80EE_09FBF1562741" presentation="$(presentation.POL_1233682B_A71D_5081_9CF1_F5112A62EE3B)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <text id="TXT_B5965925_60A9_5A4E_B348_80C590F7AF7A" key="Software\Policies\Samba\smb_conf\smbd profiling level" valueName="smbd profiling level"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_9598A191_3D22_5B49_8188_8D6901A5B4CE)" explainText="$(string.POL_9598A191_3D22_5B49_8188_8D6901A5B4CE_Help)" key="Software\Policies\Samba\smb_conf" name="POL_9598A191_3D22_5B49_8188_8D6901A5B4CE" presentation="$(presentation.POL_C2788566_CBC3_59A3_80A2_72D92E42C276)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <text id="TXT_58CF9CC7_1A14_55B0_8E4E_52E962A10EE4" key="Software\Policies\Samba\smb_conf\state directory" valueName="state directory"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_73FD8B56_579A_5BC6_A49A_4000BE94A02F)" explainText="$(string.POL_73FD8B56_579A_5BC6_A49A_4000BE94A02F_Help)" key="Software\Policies\Samba\smb_conf" name="POL_73FD8B56_579A_5BC6_A49A_4000BE94A02F" presentation="$(presentation.POL_6AF97A17_10D7_553C_8CEC_09C8466A2AA4)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <boolean id="CHK_2D14A430_BA96_5B3F_970F_CE1AE9F7E8AA" key="Software\Policies\Samba\smb_conf\usershare allow guests" valueName="usershare allow guests"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_A0CE47E8_AE8A_5602_8265_1C8D3AEC6064)" explainText="$(string.POL_A0CE47E8_AE8A_5602_8265_1C8D3AEC6064_Help)" key="Software\Policies\Samba\smb_conf" name="POL_A0CE47E8_AE8A_5602_8265_1C8D3AEC6064" presentation="$(presentation.POL_35B0CCC2_C387_5AED_9345_A2E4DE654F5F)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <decimal id="DXT_AD83F27E_4FF7_5E8D_A441_0A8925C9D917" key="Software\Policies\Samba\smb_conf\usershare max shares" valueName="usershare max shares"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_411611B5_93F6_546F_B68B_05167A064628)" explainText="$(string.POL_411611B5_93F6_546F_B68B_05167A064628_Help)" key="Software\Policies\Samba\smb_conf" name="POL_411611B5_93F6_546F_B68B_05167A064628" presentation="$(presentation.POL_4E1A7DA3_3014_5C3C_9B0B_1919ECADACFB)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <boolean id="CHK_950CF79D_4898_55EB_A6A8_24F2A6867B1D" key="Software\Policies\Samba\smb_conf\usershare owner only" valueName="usershare owner only"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_DD97B40A_CB2A_5818_8D39_F94911EB3F13)" explainText="$(string.POL_DD97B40A_CB2A_5818_8D39_F94911EB3F13_Help)" key="Software\Policies\Samba\smb_conf" name="POL_DD97B40A_CB2A_5818_8D39_F94911EB3F13" presentation="$(presentation.POL_F2D66EF9_F99C_5347_A075_E8733603E83D)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <text id="TXT_D24709D9_FFEF_5871_AF49_5E3A3466761C" key="Software\Policies\Samba\smb_conf\usershare path" valueName="usershare path"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_4AAFAB11_EB55_5600_A574_08E074B5DC28)" explainText="$(string.POL_4AAFAB11_EB55_5600_A574_08E074B5DC28_Help)" key="Software\Policies\Samba\smb_conf" name="POL_4AAFAB11_EB55_5600_A574_08E074B5DC28" presentation="$(presentation.POL_568D23D8_683D_5E32_96B8_5CCF81F0BDEC)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <text id="TXT_C0DF82DC_7C0A_5B7F_9B93_19D517976672" key="Software\Policies\Samba\smb_conf\usershare prefix allow list" valueName="usershare prefix allow list"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_1D783E13_3E5A_5FEB_B1C0_486FF385960E)" explainText="$(string.POL_1D783E13_3E5A_5FEB_B1C0_486FF385960E_Help)" key="Software\Policies\Samba\smb_conf" name="POL_1D783E13_3E5A_5FEB_B1C0_486FF385960E" presentation="$(presentation.POL_8A095F7E_AF4C_5F23_8C6D_327CF9225A8E)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <text id="TXT_0CE59443_3FA6_5849_9671_8D70B1EA7E50" key="Software\Policies\Samba\smb_conf\usershare prefix deny list" valueName="usershare prefix deny list"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_2974E59A_2225_59CA_A4C8_C967FDB0E588)" explainText="$(string.POL_2974E59A_2225_59CA_A4C8_C967FDB0E588_Help)" key="Software\Policies\Samba\smb_conf" name="POL_2974E59A_2225_59CA_A4C8_C967FDB0E588" presentation="$(presentation.POL_ABD81045_A7F0_5D9D_93E5_0D96C0BD7AA8)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <text id="TXT_029600AB_FD39_52B7_AE5D_AE0D7138153A" key="Software\Policies\Samba\smb_conf\usershare template share" valueName="usershare template share"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_99ADA47F_F025_52B8_B8F5_DDFA0EEFEF31)" explainText="$(string.POL_99ADA47F_F025_52B8_B8F5_DDFA0EEFEF31_Help)" key="Software\Policies\Samba\smb_conf" name="POL_99ADA47F_F025_52B8_B8F5_DDFA0EEFEF31" presentation="$(presentation.POL_238B28BE_5F6B_5251_B47B_4932EA213DAE)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <boolean id="CHK_651BA339_0B8E_5456_99AA_E4CD4BE64F51" key="Software\Policies\Samba\smb_conf\utmp" valueName="utmp"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_21565354_4253_5482_97D2_9C2558461C47)" explainText="$(string.POL_21565354_4253_5482_97D2_9C2558461C47_Help)" key="Software\Policies\Samba\smb_conf" name="POL_21565354_4253_5482_97D2_9C2558461C47" presentation="$(presentation.POL_BB0E4D55_D6E9_5FDD_A75B_59F7403CF67C)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <text id="TXT_C85A703E_0428_51EF_8A2A_D4803BE9446E" key="Software\Policies\Samba\smb_conf\utmp directory" valueName="utmp directory"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_4F8E9BC0_CFAB_52F8_9C49_B8BB7400E60A)" explainText="$(string.POL_4F8E9BC0_CFAB_52F8_9C49_B8BB7400E60A_Help)" key="Software\Policies\Samba\smb_conf" name="POL_4F8E9BC0_CFAB_52F8_9C49_B8BB7400E60A" presentation="$(presentation.POL_2AD1815C_5DBC_5A7E_8DC9_CEE194030C59)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <text id="TXT_CF0F4D90_5001_57CB_A6C8_58575659305D" key="Software\Policies\Samba\smb_conf\wtmp directory" valueName="wtmp directory"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_83F826D3_2069_552C_8376_C0512E99728D)" explainText="$(string.POL_83F826D3_2069_552C_8376_C0512E99728D_Help)" key="Software\Policies\Samba\smb_conf" name="POL_83F826D3_2069_552C_8376_C0512E99728D" presentation="$(presentation.POL_63B9016C_EBE5_5EA7_85B0_493E3155F943)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <text id="TXT_63999B72_41DB_5A45_A6DE_66574F1F442F" key="Software\Policies\Samba\smb_conf\addport command" valueName="addport command"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_B4BE84FF_FB13_5496_AC34_B15BF764F654)" explainText="$(string.POL_B4BE84FF_FB13_5496_AC34_B15BF764F654_Help)" key="Software\Policies\Samba\smb_conf" name="POL_B4BE84FF_FB13_5496_AC34_B15BF764F654" presentation="$(presentation.POL_778F868C_7119_5059_9D0D_62B468410A7D)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <text id="TXT_5581F365_D9D7_535E_A25B_A58F2FBABCBB" key="Software\Policies\Samba\smb_conf\addprinter command" valueName="addprinter command"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_D9D048A2_779C_5D85_A26E_131535508B70)" explainText="$(string.POL_D9D048A2_779C_5D85_A26E_131535508B70_Help)" key="Software\Policies\Samba\smb_conf" name="POL_D9D048A2_779C_5D85_A26E_131535508B70" presentation="$(presentation.POL_E4EA6E76_DFE6_5C90_8D2F_544185E10581)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <decimal id="DXT_21FF9D0E_70B9_5790_9877_F218D435CAA2" key="Software\Policies\Samba\smb_conf\cups connection timeout" valueName="cups connection timeout"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_AB9D00A2_AB72_5D21_94C6_8EC1238F2793)" explainText="$(string.POL_AB9D00A2_AB72_5D21_94C6_8EC1238F2793_Help)" key="Software\Policies\Samba\smb_conf" name="POL_AB9D00A2_AB72_5D21_94C6_8EC1238F2793" presentation="$(presentation.POL_5A6F3F97_C655_501A_8A1D_D3B96E22D189)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <text id="TXT_90A3BD2E_13EF_5BC9_970F_32A3CE582200" key="Software\Policies\Samba\smb_conf\cups encrypt" valueName="cups encrypt"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_CDEAD263_A87A_550A_A067_3FF8C0C60986)" explainText="$(string.POL_CDEAD263_A87A_550A_A067_3FF8C0C60986_Help)" key="Software\Policies\Samba\smb_conf" name="POL_CDEAD263_A87A_550A_A067_3FF8C0C60986" presentation="$(presentation.POL_713C453D_7C4E_5446_99F0_93FDC97CBD6E)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <text id="TXT_E3EF87B6_2525_530F_96D9_36770179DBEF" key="Software\Policies\Samba\smb_conf\cups server" valueName="cups server"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_7CC90037_633A_5C8D_99C5_380E6B2E1EF0)" explainText="$(string.POL_7CC90037_633A_5C8D_99C5_380E6B2E1EF0_Help)" key="Software\Policies\Samba\smb_conf" name="POL_7CC90037_633A_5C8D_99C5_380E6B2E1EF0" presentation="$(presentation.POL_7801A389_C366_5376_9D03_631BD51C46C4)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <text id="TXT_6477B02C_3AE4_5724_B00B_0A11F16A1ECD" key="Software\Policies\Samba\smb_conf\deleteprinter command" valueName="deleteprinter command"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_60B548F0_E8B3_576F_B520_D4954AF3ED8E)" explainText="$(string.POL_60B548F0_E8B3_576F_B520_D4954AF3ED8E_Help)" key="Software\Policies\Samba\smb_conf" name="POL_60B548F0_E8B3_576F_B520_D4954AF3ED8E" presentation="$(presentation.POL_8AEEC70D_CC12_55A5_A39F_ED0C3A3B652E)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <boolean id="CHK_BA883BE5_77CE_5478_BBC8_10B796EF09C2" key="Software\Policies\Samba\smb_conf\disable spoolss" valueName="disable spoolss"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_EAFBD5E6_54EC_5776_A757_5401DE77BBCE)" explainText="$(string.POL_EAFBD5E6_54EC_5776_A757_5401DE77BBCE_Help)" key="Software\Policies\Samba\smb_conf" name="POL_EAFBD5E6_54EC_5776_A757_5401DE77BBCE" presentation="$(presentation.POL_D8A14125_4BEE_575E_B7A2_A6D2809A0CC9)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <boolean id="CHK_76C31A1A_3CCA_54F4_A09B_01ED9C31465A" key="Software\Policies\Samba\smb_conf\enable spoolss" valueName="enable spoolss"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_88C2E1AE_E15B_561A_83B3_A7A7610CB3A2)" explainText="$(string.POL_88C2E1AE_E15B_561A_83B3_A7A7610CB3A2_Help)" key="Software\Policies\Samba\smb_conf" name="POL_88C2E1AE_E15B_561A_83B3_A7A7610CB3A2" presentation="$(presentation.POL_E95AFA3E_7680_5281_88E1_BC2B9DE7C60D)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <text id="TXT_9B7FB891_910F_5AB1_96BC_432F871E50AA" key="Software\Policies\Samba\smb_conf\enumports command" valueName="enumports command"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_5247D3AE_60E1_526B_B3A0_956818E2EA49)" explainText="$(string.POL_5247D3AE_60E1_526B_B3A0_956818E2EA49_Help)" key="Software\Policies\Samba\smb_conf" name="POL_5247D3AE_60E1_526B_B3A0_956818E2EA49" presentation="$(presentation.POL_D0CE14C7_93FC_54DA_84A8_FB6579A01A95)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <text id="TXT_CEDD5E8E_4BCB_515F_B962_7C06E9E4EBE6" key="Software\Policies\Samba\smb_conf\iprint server" valueName="iprint server"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_A6ACC104_2480_55A0_A53C_D38DFF7A093B)" explainText="$(string.POL_A6ACC104_2480_55A0_A53C_D38DFF7A093B_Help)" key="Software\Policies\Samba\smb_conf" name="POL_A6ACC104_2480_55A0_A53C_D38DFF7A093B" presentation="$(presentation.POL_2AA9A3C9_2D35_5140_AAFD_5A6D4A8B46A9)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <boolean id="CHK_01150395_D329_542B_8848_2D352BA599CA" key="Software\Policies\Samba\smb_conf\load printers" valueName="load printers"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_5CC89C3B_45B2_5C52_ADE0_79FB968E5EDE)" explainText="$(string.POL_5CC89C3B_45B2_5C52_ADE0_79FB968E5EDE_Help)" key="Software\Policies\Samba\smb_conf" name="POL_5CC89C3B_45B2_5C52_ADE0_79FB968E5EDE" presentation="$(presentation.POL_CB7375CD_3BD9_5AFF_885F_5CD41077D92A)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <decimal id="DXT_86697EF6_0F2B_59EA_AC0A_2A6B16860DC2" key="Software\Policies\Samba\smb_conf\lpq cache time" valueName="lpq cache time"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_45819251_B577_5069_AA0C_AD798BFDC903)" explainText="$(string.POL_45819251_B577_5069_AA0C_AD798BFDC903_Help)" key="Software\Policies\Samba\smb_conf" name="POL_45819251_B577_5069_AA0C_AD798BFDC903" presentation="$(presentation.POL_6C573DCA_ADF2_503D_86F1_167FB4B20390)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <text id="TXT_60176F30_80AE_5289_8984_1213DB736520" key="Software\Policies\Samba\smb_conf\os2 driver map" valueName="os2 driver map"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_40CAC79E_549A_5AAA_8FD3_DDF6FDC3EF35)" explainText="$(string.POL_40CAC79E_549A_5AAA_8FD3_DDF6FDC3EF35_Help)" key="Software\Policies\Samba\smb_conf" name="POL_40CAC79E_549A_5AAA_8FD3_DDF6FDC3EF35" presentation="$(presentation.POL_4E996FBA_21B1_54D2_AF3E_0290231D9225)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <decimal id="DXT_30FEC2C2_FB9E_59DC_86AC_0952A9904B2F" key="Software\Policies\Samba\smb_conf\printcap cache time" valueName="printcap cache time"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_A0530959_BE77_53B1_82AC_B3E11CA6D2D8)" explainText="$(string.POL_A0530959_BE77_53B1_82AC_B3E11CA6D2D8_Help)" key="Software\Policies\Samba\smb_conf" name="POL_A0530959_BE77_53B1_82AC_B3E11CA6D2D8" presentation="$(presentation.POL_9E502331_FC16_56A6_BAA2_8A4F8CD7403E)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <text id="TXT_8288D727_1C29_5CDF_A162_3F5701E803B2" key="Software\Policies\Samba\smb_conf\printcap name" valueName="printcap name"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_73B2297D_6138_544A_BAF8_A31CC8192C22)" explainText="$(string.POL_73B2297D_6138_544A_BAF8_A31CC8192C22_Help)" key="Software\Policies\Samba\smb_conf" name="POL_73B2297D_6138_544A_BAF8_A31CC8192C22" presentation="$(presentation.POL_63DFC41F_0FA5_52C6_95CC_071B309E09A9)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <boolean id="CHK_21859C56_D5DA_5C2E_9215_BA75864C9B4B" key="Software\Policies\Samba\smb_conf\show add printer wizard" valueName="show add printer wizard"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_3CD8EF2C_23D9_58C5_A92C_3E1C2E4F3A4A)" explainText="$(string.POL_3CD8EF2C_23D9_58C5_A92C_3E1C2E4F3A4A_Help)" key="Software\Policies\Samba\smb_conf" name="POL_3CD8EF2C_23D9_58C5_A92C_3E1C2E4F3A4A" presentation="$(presentation.POL_C105B217_101D_5080_B2F2_28F453585AF3)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <text id="TXT_C9E18177_8584_5290_8B40_37D46546DDB1" key="Software\Policies\Samba\smb_conf\spoolss: architecture" valueName="spoolss: architecture"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_DE5BD97B_EB5B_571A_98EE_814B2C006262)" explainText="$(string.POL_DE5BD97B_EB5B_571A_98EE_814B2C006262_Help)" key="Software\Policies\Samba\smb_conf" name="POL_DE5BD97B_EB5B_571A_98EE_814B2C006262" presentation="$(presentation.POL_B7405490_DE98_5CC9_A096_8B6F690536A5)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <decimal id="DXT_1D4352B8_DB79_5551_A486_7D4D33F8D4D9" key="Software\Policies\Samba\smb_conf\spoolss: os_major" valueName="spoolss: os_major"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_5EB4315D_6DDE_50E9_A228_2F5062CB23B9)" explainText="$(string.POL_5EB4315D_6DDE_50E9_A228_2F5062CB23B9_Help)" key="Software\Policies\Samba\smb_conf" name="POL_5EB4315D_6DDE_50E9_A228_2F5062CB23B9" presentation="$(presentation.POL_5049AEF7_B2E3_5F11_BB76_CD05A0F405D1)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <decimal id="DXT_6F51D95E_66DD_50B2_B62F_7665EF471B52" key="Software\Policies\Samba\smb_conf\spoolss: os_minor" valueName="spoolss: os_minor"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_FEE2B5DC_E367_5173_8A6A_43EB82F22680)" explainText="$(string.POL_FEE2B5DC_E367_5173_8A6A_43EB82F22680_Help)" key="Software\Policies\Samba\smb_conf" name="POL_FEE2B5DC_E367_5173_8A6A_43EB82F22680" presentation="$(presentation.POL_52B0D644_BD3A_5C9D_873F_3DF18D2FDB60)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <decimal id="DXT_B21A8651_347B_5648_94FA_37B943B6A547" key="Software\Policies\Samba\smb_conf\spoolss: os_build" valueName="spoolss: os_build"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_6E7AC428_65F6_5006_97A7_B985AE445E43)" explainText="$(string.POL_6E7AC428_65F6_5006_97A7_B985AE445E43_Help)" key="Software\Policies\Samba\smb_conf" name="POL_6E7AC428_65F6_5006_97A7_B985AE445E43" presentation="$(presentation.POL_4B72C056_F162_529E_A137_1F557D5FDFCE)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <decimal id="DXT_6188EEA1_529A_508D_B9D5_378CAB822D89" key="Software\Policies\Samba\smb_conf\spoolss_client: os_major" valueName="spoolss_client: os_major"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_732E108C_5701_547E_903E_6112EDF3E999)" explainText="$(string.POL_732E108C_5701_547E_903E_6112EDF3E999_Help)" key="Software\Policies\Samba\smb_conf" name="POL_732E108C_5701_547E_903E_6112EDF3E999" presentation="$(presentation.POL_1855B435_5BFA_512B_A805_E30B09CFD23F)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <decimal id="DXT_A21AB0C1_D47D_5B8C_8609_171B9D2F4C27" key="Software\Policies\Samba\smb_conf\spoolss_client: os_minor" valueName="spoolss_client: os_minor"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_CBC8563A_7BEB_54F3_8554_74815EF130DF)" explainText="$(string.POL_CBC8563A_7BEB_54F3_8554_74815EF130DF_Help)" key="Software\Policies\Samba\smb_conf" name="POL_CBC8563A_7BEB_54F3_8554_74815EF130DF" presentation="$(presentation.POL_F173249E_078E_531E_A8DC_85931745FBF9)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <decimal id="DXT_EC7D7A9D_C0D7_5665_9030_9C85D402BDB1" key="Software\Policies\Samba\smb_conf\spoolss_client: os_build" valueName="spoolss_client: os_build"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_A51777A2_FA82_5D61_B7E1_9B223537A750)" explainText="$(string.POL_A51777A2_FA82_5D61_B7E1_9B223537A750_Help)" key="Software\Policies\Samba\smb_conf" name="POL_A51777A2_FA82_5D61_B7E1_9B223537A750" presentation="$(presentation.POL_A3C35AAF_A7F5_5DCD_B328_C7ABD0F2FDFF)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <decimal id="DXT_BCC54168_D5A8_5014_903F_D0689B350906" key="Software\Policies\Samba\smb_conf\cldap port" valueName="cldap port"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_E2162FCB_2AF4_5BED_8254_84C87787CAA8)" explainText="$(string.POL_E2162FCB_2AF4_5BED_8254_84C87787CAA8_Help)" key="Software\Policies\Samba\smb_conf" name="POL_E2162FCB_2AF4_5BED_8254_84C87787CAA8" presentation="$(presentation.POL_7D6BFF26_946F_5B18_B213_0B9EE147C3C9)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <text id="TXT_BC8B7A29_65FA_5B55_BC11_A7574ECD0AA8" key="Software\Policies\Samba\smb_conf\client ipc max protocol" valueName="client ipc max protocol"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_86DD41DB_D3AE_5445_8E2D_335E8182ECDF)" explainText="$(string.POL_86DD41DB_D3AE_5445_8E2D_335E8182ECDF_Help)" key="Software\Policies\Samba\smb_conf" name="POL_86DD41DB_D3AE_5445_8E2D_335E8182ECDF" presentation="$(presentation.POL_4D5635CC_F944_5F32_83F0_7730FC9DE680)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <text id="TXT_2FAFBF21_5429_5CF1_9152_921CF9CEEC6C" key="Software\Policies\Samba\smb_conf\client ipc min protocol" valueName="client ipc min protocol"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_8E18914D_E4D5_5B9E_8641_02F84DEA8092)" explainText="$(string.POL_8E18914D_E4D5_5B9E_8641_02F84DEA8092_Help)" key="Software\Policies\Samba\smb_conf" name="POL_8E18914D_E4D5_5B9E_8641_02F84DEA8092" presentation="$(presentation.POL_79B1D2DB_C2F7_57FA_8D6F_83D756A43A40)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <text id="TXT_6E173477_D6E4_5C47_BC6C_5961404DB0CD" key="Software\Policies\Samba\smb_conf\client max protocol" valueName="client max protocol"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_277C30D1_A2C2_5AB4_8748_A9ECC063AE91)" explainText="$(string.POL_277C30D1_A2C2_5AB4_8748_A9ECC063AE91_Help)" key="Software\Policies\Samba\smb_conf" name="POL_277C30D1_A2C2_5AB4_8748_A9ECC063AE91" presentation="$(presentation.POL_E5D3402E_7A4B_555E_AC54_E5C7AE196EF2)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <text id="TXT_30573924_1A09_5202_8DF8_9B24FA69C14E" key="Software\Policies\Samba\smb_conf\client min protocol" valueName="client min protocol"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_89A40B64_721B_55DF_841D_C3481F32C2FF)" explainText="$(string.POL_89A40B64_721B_55DF_841D_C3481F32C2FF_Help)" key="Software\Policies\Samba\smb_conf" name="POL_89A40B64_721B_55DF_841D_C3481F32C2FF" presentation="$(presentation.POL_B86463E0_7A50_5BD1_9CD5_A43C20A5E087)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <boolean id="CHK_5549EDCC_940D_5AEA_8465_B771FEE013BC" key="Software\Policies\Samba\smb_conf\client use spnego" valueName="client use spnego"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_FCF4AF88_1B2D_5A6E_B630_7E88FA13F4EB)" explainText="$(string.POL_FCF4AF88_1B2D_5A6E_B630_7E88FA13F4EB_Help)" key="Software\Policies\Samba\smb_conf" name="POL_FCF4AF88_1B2D_5A6E_B630_7E88FA13F4EB" presentation="$(presentation.POL_F0990CDC_21DF_538D_9282_2749E00AF99E)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <text id="TXT_E8C89EE3_FF60_5216_A5C7_803A3AA8D790" key="Software\Policies\Samba\smb_conf\dcerpc endpoint servers" valueName="dcerpc endpoint servers"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_73CE9581_7CF3_5CD8_ABBD_3DD273E7ED10)" explainText="$(string.POL_73CE9581_7CF3_5CD8_ABBD_3DD273E7ED10_Help)" key="Software\Policies\Samba\smb_conf" name="POL_73CE9581_7CF3_5CD8_ABBD_3DD273E7ED10" presentation="$(presentation.POL_BD3F8921_7AF6_57F8_894A_9C73D40C6202)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <boolean id="CHK_AA0DA4CF_4431_509C_8E2D_27BD0DD5CCAB" key="Software\Policies\Samba\smb_conf\defer sharing violations" valueName="defer sharing violations"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_951C9DAC_2C21_58B0_8B22_D9D2CCEB1755)" explainText="$(string.POL_951C9DAC_2C21_58B0_8B22_D9D2CCEB1755_Help)" key="Software\Policies\Samba\smb_conf" name="POL_951C9DAC_2C21_58B0_8B22_D9D2CCEB1755" presentation="$(presentation.POL_0C775437_E6FD_5657_9A04_AF137F18FACE)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <decimal id="DXT_8E6D975D_6C56_56F9_9853_60394A2CEFA7" key="Software\Policies\Samba\smb_conf\dgram port" valueName="dgram port"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_401F735E_7E1F_5EBC_A3E3_9642A9F023DA)" explainText="$(string.POL_401F735E_7E1F_5EBC_A3E3_9642A9F023DA_Help)" key="Software\Policies\Samba\smb_conf" name="POL_401F735E_7E1F_5EBC_A3E3_9642A9F023DA" presentation="$(presentation.POL_614DA2E7_D77F_5434_9C73_137D1D89D086)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <boolean id="CHK_D433FDEC_A984_5B75_AD88_924962077009" key="Software\Policies\Samba\smb_conf\disable netbios" valueName="disable netbios"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_6BB5884D_D948_5765_B165_FCB496E3A64A)" explainText="$(string.POL_6BB5884D_D948_5765_B165_FCB496E3A64A_Help)" key="Software\Policies\Samba\smb_conf" name="POL_6BB5884D_D948_5765_B165_FCB496E3A64A" presentation="$(presentation.POL_35845C32_CE1D_5395_A07C_142BCFD9744C)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <boolean id="CHK_31A76B18_E56F_57E6_BBC1_A5988C8D731C" key="Software\Policies\Samba\smb_conf\enable asu support" valueName="enable asu support"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_D389B35D_C2C8_5971_A195_FBD8C0AAC94C)" explainText="$(string.POL_D389B35D_C2C8_5971_A195_FBD8C0AAC94C_Help)" key="Software\Policies\Samba\smb_conf" name="POL_D389B35D_C2C8_5971_A195_FBD8C0AAC94C" presentation="$(presentation.POL_000AF517_65A2_5220_B1DD_7187EFC59AAB)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <text id="TXT_3A3CA4FB_B0F0_5D20_AA43_D6CAECA189E1" key="Software\Policies\Samba\smb_conf\eventlog list" valueName="eventlog list"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_04CE2D0D_386E_5CA3_B450_F1BC9FC9CC9B)" explainText="$(string.POL_04CE2D0D_386E_5CA3_B450_F1BC9FC9CC9B_Help)" key="Software\Policies\Samba\smb_conf" name="POL_04CE2D0D_386E_5CA3_B450_F1BC9FC9CC9B" presentation="$(presentation.POL_B4BFA8D2_FF42_5E4A_ADE8_D7829A2CC94A)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <boolean id="CHK_21EE7A7A_DF8F_56F7_85FB_6EC5DD083DD6" key="Software\Policies\Samba\smb_conf\large readwrite" valueName="large readwrite"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_63F5048E_6174_5012_8637_738DD79034E5)" explainText="$(string.POL_63F5048E_6174_5012_8637_738DD79034E5_Help)" key="Software\Policies\Samba\smb_conf" name="POL_63F5048E_6174_5012_8637_738DD79034E5" presentation="$(presentation.POL_644A4C74_3ECB_5A01_8E2B_1FA9E74EC778)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <boolean id="CHK_52E0D939_4722_5165_AAFE_A5FD7584E12C" key="Software\Policies\Samba\smb_conf\lsa over netlogon" valueName="lsa over netlogon"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_87E8C778_F6AC_5666_8855_D40F11853504)" explainText="$(string.POL_87E8C778_F6AC_5666_8855_D40F11853504_Help)" key="Software\Policies\Samba\smb_conf" name="POL_87E8C778_F6AC_5666_8855_D40F11853504" presentation="$(presentation.POL_EAE8C258_343E_522B_A09C_69E9FD81B535)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <decimal id="DXT_549D41B9_4692_55A3_B8C0_11D91DBCC133" key="Software\Policies\Samba\smb_conf\max mux" valueName="max mux"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_E754670E_4295_5CAC_8817_8C848E31BA0B)" explainText="$(string.POL_E754670E_4295_5CAC_8817_8C848E31BA0B_Help)" key="Software\Policies\Samba\smb_conf" name="POL_E754670E_4295_5CAC_8817_8C848E31BA0B" presentation="$(presentation.POL_2BAFBEFD_9CEA_53C2_9E78_04807EA6531F)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <decimal id="DXT_F5E2AC7A_E892_5316_81C3_368BC6F5E4C4" key="Software\Policies\Samba\smb_conf\max ttl" valueName="max ttl"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_0AAACA11_DE41_5664_A306_F44D752598C5)" explainText="$(string.POL_0AAACA11_DE41_5664_A306_F44D752598C5_Help)" key="Software\Policies\Samba\smb_conf" name="POL_0AAACA11_DE41_5664_A306_F44D752598C5" presentation="$(presentation.POL_7D30022C_3DDE_56D1_8D07_D90741127527)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <decimal id="DXT_8A171231_CF95_5684_B665_9B1F5B046ABD" key="Software\Policies\Samba\smb_conf\max xmit" valueName="max xmit"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_24E58521_FFD2_5ADE_A9C8_4050EE408BC2)" explainText="$(string.POL_24E58521_FFD2_5ADE_A9C8_4050EE408BC2_Help)" key="Software\Policies\Samba\smb_conf" name="POL_24E58521_FFD2_5ADE_A9C8_4050EE408BC2" presentation="$(presentation.POL_02E42B0E_C3F3_5E0B_83C1_6F3ABFEEF251)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <decimal id="DXT_0B40F1AE_EF9C_58E0_9E35_6D119671AAE1" key="Software\Policies\Samba\smb_conf\min receivefile size" valueName="min receivefile size"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_1DDE423B_1CCB_5179_87D3_1FEE7D4CA621)" explainText="$(string.POL_1DDE423B_1CCB_5179_87D3_1FEE7D4CA621_Help)" key="Software\Policies\Samba\smb_conf" name="POL_1DDE423B_1CCB_5179_87D3_1FEE7D4CA621" presentation="$(presentation.POL_9AA4C867_EE0B_5742_94F0_4D2243C2E368)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <text id="TXT_7C9CF069_5856_5D63_94DD_AF9530B8D495" key="Software\Policies\Samba\smb_conf\name resolve order" valueName="name resolve order"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_B1C3F6FC_E4FB_58A7_9CE4_50090EF8FF17)" explainText="$(string.POL_B1C3F6FC_E4FB_58A7_9CE4_50090EF8FF17_Help)" key="Software\Policies\Samba\smb_conf" name="POL_B1C3F6FC_E4FB_58A7_9CE4_50090EF8FF17" presentation="$(presentation.POL_0EAD5917_3B68_5B59_92E1_69BD263150EA)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <decimal id="DXT_F06BA6AF_533A_520F_B2E1_EA508FF26E55" key="Software\Policies\Samba\smb_conf\nbt port" valueName="nbt port"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_E2A4C01A_1EFC_5826_9D3A_A4AD065518EF)" explainText="$(string.POL_E2A4C01A_1EFC_5826_9D3A_A4AD065518EF_Help)" key="Software\Policies\Samba\smb_conf" name="POL_E2A4C01A_1EFC_5826_9D3A_A4AD065518EF" presentation="$(presentation.POL_3FA711F7_BD87_5CF6_9A5A_77CF771AAFF2)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <boolean id="CHK_DAAC7C86_8FD9_55BF_9125_9C95E2D52AFE" key="Software\Policies\Samba\smb_conf\nt pipe support" valueName="nt pipe support"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_C1F0941D_67B4_55EA_A915_6F5E9A945E57)" explainText="$(string.POL_C1F0941D_67B4_55EA_A915_6F5E9A945E57_Help)" key="Software\Policies\Samba\smb_conf" name="POL_C1F0941D_67B4_55EA_A915_6F5E9A945E57" presentation="$(presentation.POL_85D402BD_4D59_5CE0_8EA2_3331CABD23CA)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <boolean id="CHK_95DD62AA_03E3_5679_AD11_D5616CD25255" key="Software\Policies\Samba\smb_conf\nt status support" valueName="nt status support"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_CDB6A4B8_D076_5332_9EA2_CC994C8B45C7)" explainText="$(string.POL_CDB6A4B8_D076_5332_9EA2_CC994C8B45C7_Help)" key="Software\Policies\Samba\smb_conf" name="POL_CDB6A4B8_D076_5332_9EA2_CC994C8B45C7" presentation="$(presentation.POL_9045A4F7_5DED_5A70_B01D_D92B419B6634)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <boolean id="CHK_B11F35D5_3196_5D92_9B1D_9C746F9162FA" key="Software\Policies\Samba\smb_conf\read raw" valueName="read raw"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_F9AD06B5_1870_5BE4_87A9_08E3821667E4)" explainText="$(string.POL_F9AD06B5_1870_5BE4_87A9_08E3821667E4_Help)" key="Software\Policies\Samba\smb_conf" name="POL_F9AD06B5_1870_5BE4_87A9_08E3821667E4" presentation="$(presentation.POL_9926B5F8_3F22_569B_BB6C_06F2CDF21381)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <boolean id="CHK_CCA3E37C_1A5F_5493_BFC6_AD75B7AEF1D7" key="Software\Policies\Samba\smb_conf\rpc big endian" valueName="rpc big endian"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_380E7843_58D7_505E_9092_392FE1FC4BA2)" explainText="$(string.POL_380E7843_58D7_505E_9092_392FE1FC4BA2_Help)" key="Software\Policies\Samba\smb_conf" name="POL_380E7843_58D7_505E_9092_392FE1FC4BA2" presentation="$(presentation.POL_56DBEBB2_3508_5C9E_91B2_3E55EF357FFB)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <decimal id="DXT_9489E35C_10BA_57DF_BCA8_E482D719B220" key="Software\Policies\Samba\smb_conf\rpc server port" valueName="rpc server port"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_D910FC29_975B_5105_97C8_BD75D68FDC5F)" explainText="$(string.POL_D910FC29_975B_5105_97C8_BD75D68FDC5F_Help)" key="Software\Policies\Samba\smb_conf" name="POL_D910FC29_975B_5105_97C8_BD75D68FDC5F" presentation="$(presentation.POL_738E8CDC_C229_5926_8153_E0009CC07424)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <text id="TXT_B22408B0_8FF5_5F41_BB61_F89CF80FB1C4" key="Software\Policies\Samba\smb_conf\server max protocol" valueName="server max protocol"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_98D56061_466A_5DDE_BFF3_8A194DE5FE2E)" explainText="$(string.POL_98D56061_466A_5DDE_BFF3_8A194DE5FE2E_Help)" key="Software\Policies\Samba\smb_conf" name="POL_98D56061_466A_5DDE_BFF3_8A194DE5FE2E" presentation="$(presentation.POL_00778E7A_F34D_546E_9FA8_3968A937392B)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <text id="TXT_633970D9_6038_55ED_856F_A39492AE0173" key="Software\Policies\Samba\smb_conf\server min protocol" valueName="server min protocol"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_2A034462_D418_5914_B24C_6535DD368A66)" explainText="$(string.POL_2A034462_D418_5914_B24C_6535DD368A66_Help)" key="Software\Policies\Samba\smb_conf" name="POL_2A034462_D418_5914_B24C_6535DD368A66" presentation="$(presentation.POL_B33A00A2_B848_59D9_9C41_582F886C008A)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <text id="TXT_3C8506A1_3A67_58AF_BB1F_DD3A931A7FBE" key="Software\Policies\Samba\smb_conf\share:fake_fscaps" valueName="share:fake_fscaps"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_A3F9ABC7_494B_5007_B5A1_1DA0B9FC345D)" explainText="$(string.POL_A3F9ABC7_494B_5007_B5A1_1DA0B9FC345D_Help)" key="Software\Policies\Samba\smb_conf" name="POL_A3F9ABC7_494B_5007_B5A1_1DA0B9FC345D" presentation="$(presentation.POL_0BC6C240_419F_5F72_9A24_DA191CFFE18E)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <decimal id="DXT_4FCC3712_A2B7_5C65_933A_621697E78E8F" key="Software\Policies\Samba\smb_conf\smb2 max credits" valueName="smb2 max credits"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_209C2DE8_5843_50FC_9B61_A3F3EBFE95B5)" explainText="$(string.POL_209C2DE8_5843_50FC_9B61_A3F3EBFE95B5_Help)" key="Software\Policies\Samba\smb_conf" name="POL_209C2DE8_5843_50FC_9B61_A3F3EBFE95B5" presentation="$(presentation.POL_908FC006_7CE8_5B56_A049_A3E582C281F3)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <decimal id="DXT_8D17E70E_8AA1_5DEC_86C2_154031314317" key="Software\Policies\Samba\smb_conf\smb2 max read" valueName="smb2 max read"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_0696582B_7928_558B_B4DA_9A0C647CFBB8)" explainText="$(string.POL_0696582B_7928_558B_B4DA_9A0C647CFBB8_Help)" key="Software\Policies\Samba\smb_conf" name="POL_0696582B_7928_558B_B4DA_9A0C647CFBB8" presentation="$(presentation.POL_84ED1A25_58B9_5C00_8261_11A7D387EAB9)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <decimal id="DXT_0923E7AF_8C15_54FD_A360_41E09D67D24C" key="Software\Policies\Samba\smb_conf\smb2 max trans" valueName="smb2 max trans"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_DA17FE47_6637_50D0_9AD1_A95AAA49F717)" explainText="$(string.POL_DA17FE47_6637_50D0_9AD1_A95AAA49F717_Help)" key="Software\Policies\Samba\smb_conf" name="POL_DA17FE47_6637_50D0_9AD1_A95AAA49F717" presentation="$(presentation.POL_A1955D87_2287_524B_9A8C_454C8218F590)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <decimal id="DXT_AC8EA085_B897_5581_8260_25EC8761048F" key="Software\Policies\Samba\smb_conf\smb2 max write" valueName="smb2 max write"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_97C2005C_F45B_5675_B450_75842A4139F0)" explainText="$(string.POL_97C2005C_F45B_5675_B450_75842A4139F0_Help)" key="Software\Policies\Samba\smb_conf" name="POL_97C2005C_F45B_5675_B450_75842A4139F0" presentation="$(presentation.POL_796581A5_F65E_5D31_BB5C_2CC641B8D03C)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <text id="TXT_07CA0480_16BB_5E14_B1E8_716E293305F7" key="Software\Policies\Samba\smb_conf\smb ports" valueName="smb ports"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_5B8B1A0B_AC6B_5E89_8FDE_4CBE538A9CB8)" explainText="$(string.POL_5B8B1A0B_AC6B_5E89_8FDE_4CBE538A9CB8_Help)" key="Software\Policies\Samba\smb_conf" name="POL_5B8B1A0B_AC6B_5E89_8FDE_4CBE538A9CB8" presentation="$(presentation.POL_C141D92D_B912_54D7_88D6_CC3A12A4739D)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <text id="TXT_7312B2B6_2E91_5D9E_BE33_A1C73675950E" key="Software\Policies\Samba\smb_conf\svcctl list" valueName="svcctl list"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_0E701672_524B_56CE_9C43_D9DE631558EA)" explainText="$(string.POL_0E701672_524B_56CE_9C43_D9DE631558EA_Help)" key="Software\Policies\Samba\smb_conf" name="POL_0E701672_524B_56CE_9C43_D9DE631558EA" presentation="$(presentation.POL_747C776B_2150_5FD4_9A47_9832FD35EBC5)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <boolean id="CHK_838A32D7_1BA5_55CB_9FA4_95280DFB26F6" key="Software\Policies\Samba\smb_conf\time server" valueName="time server"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_B8322D3C_E4C4_5EAD_AE99_B912C35C56C8)" explainText="$(string.POL_B8322D3C_E4C4_5EAD_AE99_B912C35C56C8_Help)" key="Software\Policies\Samba\smb_conf" name="POL_B8322D3C_E4C4_5EAD_AE99_B912C35C56C8" presentation="$(presentation.POL_69C69BCA_D38B_54E1_817C_E6993FF1AB91)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <boolean id="CHK_2280B94E_EB17_5A5E_80F0_B48BE0CBC2CB" key="Software\Policies\Samba\smb_conf\unicode" valueName="unicode"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_4A31BF60_B9E4_5E35_B979_A1C15754CA9A)" explainText="$(string.POL_4A31BF60_B9E4_5E35_B979_A1C15754CA9A_Help)" key="Software\Policies\Samba\smb_conf" name="POL_4A31BF60_B9E4_5E35_B979_A1C15754CA9A" presentation="$(presentation.POL_063DDC7C_E490_5F1B_866D_06D25ABAED90)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <boolean id="CHK_E429FAE8_6D3B_5B56_8EFF_B3B7C25B3DE1" key="Software\Policies\Samba\smb_conf\unix extensions" valueName="unix extensions"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_911349A8_68E0_5370_B0C8_1E5D4DD47DA4)" explainText="$(string.POL_911349A8_68E0_5370_B0C8_1E5D4DD47DA4_Help)" key="Software\Policies\Samba\smb_conf" name="POL_911349A8_68E0_5370_B0C8_1E5D4DD47DA4" presentation="$(presentation.POL_CC4C4C4D_0BA2_52C2_A510_1C4F669856F3)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <boolean id="CHK_4FD77295_65FD_5553_AB18_D6CF04394DAB" key="Software\Policies\Samba\smb_conf\write raw" valueName="write raw"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_585034D0_C9E6_568C_AF40_354A01C24E02)" explainText="$(string.POL_585034D0_C9E6_568C_AF40_354A01C24E02_Help)" key="Software\Policies\Samba\smb_conf" name="POL_585034D0_C9E6_568C_AF40_354A01C24E02" presentation="$(presentation.POL_D1D0620C_FFC1_5C7D_9733_4005F5F61A8D)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <boolean id="CHK_82B2446C_9CAB_5880_AF33_2803AE49B294" key="Software\Policies\Samba\smb_conf\server multi channel support" valueName="server multi channel support"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_4553EC0B_4966_52CE_83C6_948DAC67A281)" explainText="$(string.POL_4553EC0B_4966_52CE_83C6_948DAC67A281_Help)" key="Software\Policies\Samba\smb_conf" name="POL_4553EC0B_4966_52CE_83C6_948DAC67A281" presentation="$(presentation.POL_D0AC80B8_9AFD_5848_B779_1E43C144D7B3)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <boolean id="CHK_B6B60597_42F0_58D3_98BB_DB6B75D07112" key="Software\Policies\Samba\smb_conf\smb2 disable lock sequence checking" valueName="smb2 disable lock sequence checking"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_690A701E_D101_57E5_A180_30E9E54B8B38)" explainText="$(string.POL_690A701E_D101_57E5_A180_30E9E54B8B38_Help)" key="Software\Policies\Samba\smb_conf" name="POL_690A701E_D101_57E5_A180_30E9E54B8B38" presentation="$(presentation.POL_85DD283F_59E2_5E1D_A694_D52FD7C7627A)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <boolean id="CHK_B83E6646_94FD_5882_B57A_15B4BA0AABFD" key="Software\Policies\Samba\smb_conf\smb2 disable oplock break retry" valueName="smb2 disable oplock break retry"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_7564C5C4_88AA_576B_A9E8_091901A3D6E0)" explainText="$(string.POL_7564C5C4_88AA_576B_A9E8_091901A3D6E0_Help)" key="Software\Policies\Samba\smb_conf" name="POL_7564C5C4_88AA_576B_A9E8_091901A3D6E0" presentation="$(presentation.POL_9E9B6ADB_2118_5108_9C2D_9899DDDC59AF)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <text id="TXT_28520FBC_2959_5800_B0C5_FE205973260B" key="Software\Policies\Samba\smb_conf\rpc server dynamic port range" valueName="rpc server dynamic port range"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_8D3A68BB_46F0_55A8_B53F_A4AA70C39B46)" explainText="$(string.POL_8D3A68BB_46F0_55A8_B53F_A4AA70C39B46_Help)" key="Software\Policies\Samba\smb_conf" name="POL_8D3A68BB_46F0_55A8_B53F_A4AA70C39B46" presentation="$(presentation.POL_9B792D3F_06B3_5683_92D9_45D323276228)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <decimal id="DXT_9EFB50AC_B3B6_51C1_AD40_298F546733DC" key="Software\Policies\Samba\smb_conf\algorithmic rid base" valueName="algorithmic rid base"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_4A36DCFC_E9DB_5CD6_A67B_F94F3D95224F)" explainText="$(string.POL_4A36DCFC_E9DB_5CD6_A67B_F94F3D95224F_Help)" key="Software\Policies\Samba\smb_conf" name="POL_4A36DCFC_E9DB_5CD6_A67B_F94F3D95224F" presentation="$(presentation.POL_F30A212E_4A35_5E67_8902_5D28B4E37CE7)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <boolean id="CHK_EAA911EE_CB2D_5459_AF50_DC1CA4719686" key="Software\Policies\Samba\smb_conf\allow dcerpc auth level connect" valueName="allow dcerpc auth level connect"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_F3A8A539_E774_5498_B8B7_5D295841A159)" explainText="$(string.POL_F3A8A539_E774_5498_B8B7_5D295841A159_Help)" key="Software\Policies\Samba\smb_conf" name="POL_F3A8A539_E774_5498_B8B7_5D295841A159" presentation="$(presentation.POL_2725BCA8_877C_519D_A248_D6EE701DAD53)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <boolean id="CHK_83FBBE91_8F41_5C06_BD1D_9A47A10B07FE" key="Software\Policies\Samba\smb_conf\allow trusted domains" valueName="allow trusted domains"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_DF7112E5_5322_5A42_A1AD_45085CB6EC86)" explainText="$(string.POL_DF7112E5_5322_5A42_A1AD_45085CB6EC86_Help)" key="Software\Policies\Samba\smb_conf" name="POL_DF7112E5_5322_5A42_A1AD_45085CB6EC86" presentation="$(presentation.POL_92DB14AD_A920_5D74_BA74_0C51B13AECBF)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <text id="TXT_D70FDB73_012F_5168_8371_B68B4B2FF60E" key="Software\Policies\Samba\smb_conf\binddns dir" valueName="binddns dir"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_41C0408D_BF8C_5BA3_992E_6D58CF58FF84)" explainText="$(string.POL_41C0408D_BF8C_5BA3_992E_6D58CF58FF84_Help)" key="Software\Policies\Samba\smb_conf" name="POL_41C0408D_BF8C_5BA3_992E_6D58CF58FF84" presentation="$(presentation.POL_C95900AB_E4E2_5313_9EF5_9AC181CD63A7)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <text id="TXT_D6E02483_EC02_52E1_AB5A_E65E2C7FD5C8" key="Software\Policies\Samba\smb_conf\check password script" valueName="check password script"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_9869726F_8F58_512B_A708_C7360AC9146F)" explainText="$(string.POL_9869726F_8F58_512B_A708_C7360AC9146F_Help)" key="Software\Policies\Samba\smb_conf" name="POL_9869726F_8F58_512B_A708_C7360AC9146F" presentation="$(presentation.POL_0DDAC1B2_5E35_5770_B177_333E21EF2A80)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <text id="TXT_28B76952_9A9C_5E2D_89C6_28CA8ABBEFD4" key="Software\Policies\Samba\smb_conf\client ipc signing" valueName="client ipc signing"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_309DB173_58D7_5326_B21D_8DF044225CB9)" explainText="$(string.POL_309DB173_58D7_5326_B21D_8DF044225CB9_Help)" key="Software\Policies\Samba\smb_conf" name="POL_309DB173_58D7_5326_B21D_8DF044225CB9" presentation="$(presentation.POL_045DA01B_9A96_5BB1_A5AD_9EA38ECFC199)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <boolean id="CHK_5203727D_209F_5E8A_AA94_F9DC1BB27027" key="Software\Policies\Samba\smb_conf\client lanman auth" valueName="client lanman auth"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_0F39ED01_BB64_5653_839C_CB26A70EC531)" explainText="$(string.POL_0F39ED01_BB64_5653_839C_CB26A70EC531_Help)" key="Software\Policies\Samba\smb_conf" name="POL_0F39ED01_BB64_5653_839C_CB26A70EC531" presentation="$(presentation.POL_B1954186_3F6B_5F1F_B066_9105058C20A6)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <boolean id="CHK_B6DB6C5E_8C6F_5288_B469_0C54B947EA2F" key="Software\Policies\Samba\smb_conf\client NTLMv2 auth" valueName="client NTLMv2 auth"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_94342D11_937E_5F14_BBEA_C9B370F6A523)" explainText="$(string.POL_94342D11_937E_5F14_BBEA_C9B370F6A523_Help)" key="Software\Policies\Samba\smb_conf" name="POL_94342D11_937E_5F14_BBEA_C9B370F6A523" presentation="$(presentation.POL_676B4751_B95E_5720_A513_203DC3A33B5C)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <boolean id="CHK_3DCC027B_9C81_5EDE_A64D_D6F956AFE5B8" key="Software\Policies\Samba\smb_conf\client plaintext auth" valueName="client plaintext auth"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_DCB591D5_0F63_58EC_A0BB_F5F81064B714)" explainText="$(string.POL_DCB591D5_0F63_58EC_A0BB_F5F81064B714_Help)" key="Software\Policies\Samba\smb_conf" name="POL_DCB591D5_0F63_58EC_A0BB_F5F81064B714" presentation="$(presentation.POL_C3248F39_498F_5B9B_B82D_E99AB08FD0AF)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <text id="TXT_4A77A711_9230_5D41_A77C_97123E4789B7" key="Software\Policies\Samba\smb_conf\client schannel" valueName="client schannel"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_F35419AB_2114_5382_8060_B1AAED24F2A1)" explainText="$(string.POL_F35419AB_2114_5382_8060_B1AAED24F2A1_Help)" key="Software\Policies\Samba\smb_conf" name="POL_F35419AB_2114_5382_8060_B1AAED24F2A1" presentation="$(presentation.POL_0A922D59_F39C_57B5_82CE_E08DB4EFC5F9)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <text id="TXT_E3513F2F_1C85_5D8C_8DEE_741059C1F393" key="Software\Policies\Samba\smb_conf\client signing" valueName="client signing"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_F761A7A7_2852_560C_B6D7_A50C613C5431)" explainText="$(string.POL_F761A7A7_2852_560C_B6D7_A50C613C5431_Help)" key="Software\Policies\Samba\smb_conf" name="POL_F761A7A7_2852_560C_B6D7_A50C613C5431" presentation="$(presentation.POL_952DF975_FF04_55BD_8C6B_1D0CF167106B)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <boolean id="CHK_E5D1CBBE_5B07_5559_8885_E8F6DBA75A18" key="Software\Policies\Samba\smb_conf\client use spnego principal" valueName="client use spnego principal"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_158C42B4_685B_5FDE_BF9D_C42504E8C09C)" explainText="$(string.POL_158C42B4_685B_5FDE_BF9D_C42504E8C09C_Help)" key="Software\Policies\Samba\smb_conf" name="POL_158C42B4_685B_5FDE_BF9D_C42504E8C09C" presentation="$(presentation.POL_D9E8EB33_0AE9_5DA5_BA48_00221DCE75EB)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <boolean id="CHK_711A458E_DC58_57EC_B315_0FEF0D2354BF" key="Software\Policies\Samba\smb_conf\debug encryption" valueName="debug encryption"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_8853D1A2_6482_58E1_9748_192D92523750)" explainText="$(string.POL_8853D1A2_6482_58E1_9748_192D92523750_Help)" key="Software\Policies\Samba\smb_conf" name="POL_8853D1A2_6482_58E1_9748_192D92523750" presentation="$(presentation.POL_B7875E95_FF94_5579_956F_6E2CEB41AB91)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <text id="TXT_F17E81EB_DEBF_56F4_B372_D6F61F5516E3" key="Software\Policies\Samba\smb_conf\dedicated keytab file" valueName="dedicated keytab file"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_3C1941B5_4894_501A_A7FD_F0C6BCE77DA9)" explainText="$(string.POL_3C1941B5_4894_501A_A7FD_F0C6BCE77DA9_Help)" key="Software\Policies\Samba\smb_conf" name="POL_3C1941B5_4894_501A_A7FD_F0C6BCE77DA9" presentation="$(presentation.POL_1EE4C27C_051F_55A6_8385_E55B6776D7E4)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <boolean id="CHK_EC390E59_1CA4_5C42_960E_B0EEA3B0C1F4" key="Software\Policies\Samba\smb_conf\encrypt passwords" valueName="encrypt passwords"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_99472FC1_E6CE_5476_9EC3_EB2EF52862AE)" explainText="$(string.POL_99472FC1_E6CE_5476_9EC3_EB2EF52862AE_Help)" key="Software\Policies\Samba\smb_conf" name="POL_99472FC1_E6CE_5476_9EC3_EB2EF52862AE" presentation="$(presentation.POL_59E14991_089B_550D_A563_8FB90A8333FB)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <text id="TXT_92855060_EFF4_5BCA_B30B_10C364F30E2E" key="Software\Policies\Samba\smb_conf\guest account" valueName="guest account"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_75BBDBCB_46D1_55DE_9A7C_9EEA7DD026BF)" explainText="$(string.POL_75BBDBCB_46D1_55DE_9A7C_9EEA7DD026BF_Help)" key="Software\Policies\Samba\smb_conf" name="POL_75BBDBCB_46D1_55DE_9A7C_9EEA7DD026BF" presentation="$(presentation.POL_772B9223_59BD_57E8_8FA7_17AF0E0EC8EC)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <text id="TXT_751BA79F_27EA_55BE_B787_D424CBD47CED" key="Software\Policies\Samba\smb_conf\kerberos encryption types" valueName="kerberos encryption types"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_4AE746EE_4A10_55CC_8934_7E4FEF028E4D)" explainText="$(string.POL_4AE746EE_4A10_55CC_8934_7E4FEF028E4D_Help)" key="Software\Policies\Samba\smb_conf" name="POL_4AE746EE_4A10_55CC_8934_7E4FEF028E4D" presentation="$(presentation.POL_F11FAFDE_22DF_5BB6_9F63_007597D313BD)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <text id="TXT_30977E18_9746_5A78_A6DC_82AC5157781F" key="Software\Policies\Samba\smb_conf\kerberos method" valueName="kerberos method"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_C0E75830_A92F_5E76_A2CF_8E864DF58497)" explainText="$(string.POL_C0E75830_A92F_5E76_A2CF_8E864DF58497_Help)" key="Software\Policies\Samba\smb_conf" name="POL_C0E75830_A92F_5E76_A2CF_8E864DF58497" presentation="$(presentation.POL_F37DD404_E28E_50F2_BFF4_90142620EA2F)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <decimal id="DXT_3E0E91A2_1877_54F2_AFFE_13F912C4B534" key="Software\Policies\Samba\smb_conf\kpasswd port" valueName="kpasswd port"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_37987863_7B25_5531_81BE_8EB427F3D0E1)" explainText="$(string.POL_37987863_7B25_5531_81BE_8EB427F3D0E1_Help)" key="Software\Policies\Samba\smb_conf" name="POL_37987863_7B25_5531_81BE_8EB427F3D0E1" presentation="$(presentation.POL_E6FCD1B7_7104_5EF9_BAA7_73E15CC49EE2)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <decimal id="DXT_41AD8F69_347F_58D1_9DA4_B9A600C32EAE" key="Software\Policies\Samba\smb_conf\krb5 port" valueName="krb5 port"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_91CB69F0_B95B_565D_B50D_0BC441ED9E34)" explainText="$(string.POL_91CB69F0_B95B_565D_B50D_0BC441ED9E34_Help)" key="Software\Policies\Samba\smb_conf" name="POL_91CB69F0_B95B_565D_B50D_0BC441ED9E34" presentation="$(presentation.POL_F77B9807_0B1E_5EA5_A1CB_62B310FE5034)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <boolean id="CHK_7460D4AE_3934_5090_9E10_BBF60CD5A983" key="Software\Policies\Samba\smb_conf\lanman auth" valueName="lanman auth"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_89CBBE4F_9104_594C_88D1_F9C11246B21F)" explainText="$(string.POL_89CBBE4F_9104_594C_88D1_F9C11246B21F_Help)" key="Software\Policies\Samba\smb_conf" name="POL_89CBBE4F_9104_594C_88D1_F9C11246B21F" presentation="$(presentation.POL_3D0B6848_AEF7_54A0_8FA0_B6EAD987D449)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <text id="TXT_E576122E_9E34_5B1D_9362_2EF751F22E3F" key="Software\Policies\Samba\smb_conf\log nt token command" valueName="log nt token command"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_6BE3D165_D5BE_5252_A0A2_31CD0E777478)" explainText="$(string.POL_6BE3D165_D5BE_5252_A0A2_31CD0E777478_Help)" key="Software\Policies\Samba\smb_conf" name="POL_6BE3D165_D5BE_5252_A0A2_31CD0E777478" presentation="$(presentation.POL_32F00B99_2861_5EFE_B961_1F52B4FC0530)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <text id="TXT_12B82358_1926_5FEC_B016_946E52DDC7A7" key="Software\Policies\Samba\smb_conf\map to guest" valueName="map to guest"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_56EEE2C2_6458_524A_95A8_C59B86A453E0)" explainText="$(string.POL_56EEE2C2_6458_524A_95A8_C59B86A453E0_Help)" key="Software\Policies\Samba\smb_conf" name="POL_56EEE2C2_6458_524A_95A8_C59B86A453E0" presentation="$(presentation.POL_6D23275C_279D_571C_8835_3DA99356979C)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <text id="TXT_4C14ACC2_4652_5801_BF08_1D9E81090E16" key="Software\Policies\Samba\smb_conf\mit kdc command" valueName="mit kdc command"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_E82BE4E4_3F51_5B03_9809_03101186CE80)" explainText="$(string.POL_E82BE4E4_3F51_5B03_9809_03101186CE80_Help)" key="Software\Policies\Samba\smb_conf" name="POL_E82BE4E4_3F51_5B03_9809_03101186CE80" presentation="$(presentation.POL_3AE05749_32F8_5D7C_BEF0_D0DFB206EA34)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <text id="TXT_E71B9BA6_F3A9_510D_AE73_34CC2E7AF19F" key="Software\Policies\Samba\smb_conf\ntlm auth" valueName="ntlm auth"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_BEB01EAD_B60E_5832_BDD5_5C8ACE276FD4)" explainText="$(string.POL_BEB01EAD_B60E_5832_BDD5_5C8ACE276FD4_Help)" key="Software\Policies\Samba\smb_conf" name="POL_BEB01EAD_B60E_5832_BDD5_5C8ACE276FD4" presentation="$(presentation.POL_7A4CC1D5_FF89_5D5A_9711_B783227B92CE)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <text id="TXT_9AB44C0C_849E_55AD_BF88_30862CC83464" key="Software\Policies\Samba\smb_conf\ntp signd socket directory" valueName="ntp signd socket directory"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_C04AB7ED_DBC2_50A6_8082_AD0D6CCB758A)" explainText="$(string.POL_C04AB7ED_DBC2_50A6_8082_AD0D6CCB758A_Help)" key="Software\Policies\Samba\smb_conf" name="POL_C04AB7ED_DBC2_50A6_8082_AD0D6CCB758A" presentation="$(presentation.POL_1F95F2F6_790E_5946_8F22_F93441D1B91D)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <boolean id="CHK_905844C6_A433_5422_9020_A275A062AB6F" key="Software\Policies\Samba\smb_conf\null passwords" valueName="null passwords"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_E305251F_7C82_54A6_8F9D_CFBB7934B1DF)" explainText="$(string.POL_E305251F_7C82_54A6_8F9D_CFBB7934B1DF_Help)" key="Software\Policies\Samba\smb_conf" name="POL_E305251F_7C82_54A6_8F9D_CFBB7934B1DF" presentation="$(presentation.POL_4B855392_C467_5D42_B793_3EC858462C02)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <boolean id="CHK_FFDDD176_BDAB_58E3_A455_F60861FD2C63" key="Software\Policies\Samba\smb_conf\obey pam restrictions" valueName="obey pam restrictions"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_DD8E3C33_F1AE_59CB_B2B6_3358FFBF41AF)" explainText="$(string.POL_DD8E3C33_F1AE_59CB_B2B6_3358FFBF41AF_Help)" key="Software\Policies\Samba\smb_conf" name="POL_DD8E3C33_F1AE_59CB_B2B6_3358FFBF41AF" presentation="$(presentation.POL_F388E520_9E19_53AC_9AFA_D6DAAE139BFE)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <decimal id="DXT_1D580B43_F65E_5F39_A938_BE0D03A04F2B" key="Software\Policies\Samba\smb_conf\old password allowed period" valueName="old password allowed period"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_B65F086B_4235_5646_8C8B_AF4C16B6E4AD)" explainText="$(string.POL_B65F086B_4235_5646_8C8B_AF4C16B6E4AD_Help)" key="Software\Policies\Samba\smb_conf" name="POL_B65F086B_4235_5646_8C8B_AF4C16B6E4AD" presentation="$(presentation.POL_FC62DA5F_6B94_5AD6_B9E6_51A9F5F52E2E)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <boolean id="CHK_49F56502_4B93_5C98_A4BB_327120E5F7D8" key="Software\Policies\Samba\smb_conf\pam password change" valueName="pam password change"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_755D3500_5D11_5DF0_82AC_E5E964C7707B)" explainText="$(string.POL_755D3500_5D11_5DF0_82AC_E5E964C7707B_Help)" key="Software\Policies\Samba\smb_conf" name="POL_755D3500_5D11_5DF0_82AC_E5E964C7707B" presentation="$(presentation.POL_6F5A4F7B_B2BC_50D0_84F6_64202749462B)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <text id="TXT_38925248_C56C_5F67_959E_45860FA3CEDE" key="Software\Policies\Samba\smb_conf\passdb backend" valueName="passdb backend"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_2F42A35D_FAD2_545A_9ACE_84CD88BEBDB4)" explainText="$(string.POL_2F42A35D_FAD2_545A_9ACE_84CD88BEBDB4_Help)" key="Software\Policies\Samba\smb_conf" name="POL_2F42A35D_FAD2_545A_9ACE_84CD88BEBDB4" presentation="$(presentation.POL_F3E8ECEA_80D4_529F_8F7B_97B8847E3101)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <boolean id="CHK_4D782AF0_E6B7_5C3E_AE8F_90D07527724B" key="Software\Policies\Samba\smb_conf\passdb expand explicit" valueName="passdb expand explicit"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_87D22064_A317_506A_8057_62D7EB06E246)" explainText="$(string.POL_87D22064_A317_506A_8057_62D7EB06E246_Help)" key="Software\Policies\Samba\smb_conf" name="POL_87D22064_A317_506A_8057_62D7EB06E246" presentation="$(presentation.POL_EE00148B_DAEA_5039_B087_B342E865E3AE)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <text id="TXT_9E734663_521F_5654_A01C_E8B5C19A4684" key="Software\Policies\Samba\smb_conf\passwd chat" valueName="passwd chat"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_FB5B5BAF_88EA_547F_B6C1_C26EF698C89B)" explainText="$(string.POL_FB5B5BAF_88EA_547F_B6C1_C26EF698C89B_Help)" key="Software\Policies\Samba\smb_conf" name="POL_FB5B5BAF_88EA_547F_B6C1_C26EF698C89B" presentation="$(presentation.POL_A0D04F58_1760_5152_AE42_748ABA7B15D8)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <boolean id="CHK_6F2AD6B8_489E_512B_A7CC_EDB6FA628D1E" key="Software\Policies\Samba\smb_conf\passwd chat debug" valueName="passwd chat debug"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_885CA09B_77E8_5E63_85E8_108397557B0B)" explainText="$(string.POL_885CA09B_77E8_5E63_85E8_108397557B0B_Help)" key="Software\Policies\Samba\smb_conf" name="POL_885CA09B_77E8_5E63_85E8_108397557B0B" presentation="$(presentation.POL_0F8503B0_2D17_54A4_AECA_C8954FC2F1B3)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <decimal id="DXT_849C03F3_A9CF_5B20_81B9_D4EEE2435447" key="Software\Policies\Samba\smb_conf\passwd chat timeout" valueName="passwd chat timeout"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_E710453F_700A_5430_BE8D_5364117F7E85)" explainText="$(string.POL_E710453F_700A_5430_BE8D_5364117F7E85_Help)" key="Software\Policies\Samba\smb_conf" name="POL_E710453F_700A_5430_BE8D_5364117F7E85" presentation="$(presentation.POL_484C71CF_D856_514E_A645_C94805B51752)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <text id="TXT_97FDEF1F_BA9C_5995_BB37_93AF59ADB59C" key="Software\Policies\Samba\smb_conf\passwd program" valueName="passwd program"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_77F6400F_03D4_53F9_AB7B_E0464F72E61F)" explainText="$(string.POL_77F6400F_03D4_53F9_AB7B_E0464F72E61F_Help)" key="Software\Policies\Samba\smb_conf" name="POL_77F6400F_03D4_53F9_AB7B_E0464F72E61F" presentation="$(presentation.POL_DE8AED8D_92DF_5DC8_A412_F374508B2DF2)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <text id="TXT_DF9C4D42_5129_5D7A_A155_18F2DBB5B2E7" key="Software\Policies\Samba\smb_conf\password hash gpg key ids" valueName="password hash gpg key ids"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_5EA8345D_5B61_554F_AAF5_2C069A37DFCA)" explainText="$(string.POL_5EA8345D_5B61_554F_AAF5_2C069A37DFCA_Help)" key="Software\Policies\Samba\smb_conf" name="POL_5EA8345D_5B61_554F_AAF5_2C069A37DFCA" presentation="$(presentation.POL_E57A4D09_C62A_5ACB_BA14_A52FB3A14D54)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <text id="TXT_8F89431E_D922_5610_8770_40BD094BA98D" key="Software\Policies\Samba\smb_conf\password hash userPassword schemes" valueName="password hash userPassword schemes"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_1D36B51B_8AB7_593A_95D8_93B12C9F9EFA)" explainText="$(string.POL_1D36B51B_8AB7_593A_95D8_93B12C9F9EFA_Help)" key="Software\Policies\Samba\smb_conf" name="POL_1D36B51B_8AB7_593A_95D8_93B12C9F9EFA" presentation="$(presentation.POL_8DF1C787_4DD3_5769_981D_AD98697D5FAB)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <text id="TXT_2BD70FBF_B577_55F7_B757_5DE68D1ECB4B" key="Software\Policies\Samba\smb_conf\password server" valueName="password server"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_4605CA34_85F3_51DB_8BCE_C56B51AA39BF)" explainText="$(string.POL_4605CA34_85F3_51DB_8BCE_C56B51AA39BF_Help)" key="Software\Policies\Samba\smb_conf" name="POL_4605CA34_85F3_51DB_8BCE_C56B51AA39BF" presentation="$(presentation.POL_576D7547_5317_5D19_9105_4BFD5714D591)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <text id="TXT_799A2EBA_FC4C_53C2_B724_0838399601DF" key="Software\Policies\Samba\smb_conf\preload modules" valueName="preload modules"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_5103CDE2_436D_5FB9_8633_6BB5EBB59406)" explainText="$(string.POL_5103CDE2_436D_5FB9_8633_6BB5EBB59406_Help)" key="Software\Policies\Samba\smb_conf" name="POL_5103CDE2_436D_5FB9_8633_6BB5EBB59406" presentation="$(presentation.POL_0B74AC8D_E102_5E02_9B21_D264A6662698)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <text id="TXT_97A88495_3A90_5773_AF8C_5D35B63E672A" key="Software\Policies\Samba\smb_conf\private dir" valueName="private dir"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_7DB136EF_7DAD_5A4F_8C40_F3079FCB925F)" explainText="$(string.POL_7DB136EF_7DAD_5A4F_8C40_F3079FCB925F_Help)" key="Software\Policies\Samba\smb_conf" name="POL_7DB136EF_7DAD_5A4F_8C40_F3079FCB925F" presentation="$(presentation.POL_84F44316_118C_5460_A9E9_022AE89D6BC7)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <boolean id="CHK_C2793981_4BCD_5CDF_8F7B_7AD01E207D2C" key="Software\Policies\Samba\smb_conf\raw NTLMv2 auth" valueName="raw NTLMv2 auth"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_E4D542FC_3D67_5397_9AC3_3868BB017F03)" explainText="$(string.POL_E4D542FC_3D67_5397_9AC3_3868BB017F03_Help)" key="Software\Policies\Samba\smb_conf" name="POL_E4D542FC_3D67_5397_9AC3_3868BB017F03" presentation="$(presentation.POL_81A0C9F8_E865_532F_8FF6_EA55C23E6417)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <text id="TXT_3697BE5E_8DCE_5701_A121_A7E36F07CE6C" key="Software\Policies\Samba\smb_conf\rename user script" valueName="rename user script"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_7D42E3F0_DE0E_57E0_8EAF_F56111560EA3)" explainText="$(string.POL_7D42E3F0_DE0E_57E0_8EAF_F56111560EA3_Help)" key="Software\Policies\Samba\smb_conf" name="POL_7D42E3F0_DE0E_57E0_8EAF_F56111560EA3" presentation="$(presentation.POL_61F81501_C5C3_5F3F_8A89_4490F25812D1)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <decimal id="DXT_B5114D77_9A2D_5FB4_8862_313764FA836F" key="Software\Policies\Samba\smb_conf\restrict anonymous" valueName="restrict anonymous"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_6745DAC3_A866_5519_83C8_8086C063AAB7)" explainText="$(string.POL_6745DAC3_A866_5519_83C8_8086C063AAB7_Help)" key="Software\Policies\Samba\smb_conf" name="POL_6745DAC3_A866_5519_83C8_8086C063AAB7" presentation="$(presentation.POL_82E70187_3C79_5C38_837A_F6F7660F7D10)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <text id="TXT_00392C71_F9D4_5A75_8082_F7806B6B7564" key="Software\Policies\Samba\smb_conf\root directory" valueName="root directory"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_9218F54E_BE22_57C0_BEF2_489F89B7D3BA)" explainText="$(string.POL_9218F54E_BE22_57C0_BEF2_489F89B7D3BA_Help)" key="Software\Policies\Samba\smb_conf" name="POL_9218F54E_BE22_57C0_BEF2_489F89B7D3BA" presentation="$(presentation.POL_487E924D_1F5E_52FA_9DD7_7C893DC03299)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <text id="TXT_98D641EC_FAA9_546B_A032_3D7D3D0B28E2" key="Software\Policies\Samba\smb_conf\samba kcc command" valueName="samba kcc command"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_86AEEBA8_5181_54A2_A436_FD35443F7C03)" explainText="$(string.POL_86AEEBA8_5181_54A2_A436_FD35443F7C03_Help)" key="Software\Policies\Samba\smb_conf" name="POL_86AEEBA8_5181_54A2_A436_FD35443F7C03" presentation="$(presentation.POL_1D7DD262_FBC1_53B0_8981_D664D2793B98)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <text id="TXT_94515E41_3367_514F_978D_FB02F7C7ABD1" key="Software\Policies\Samba\smb_conf\security" valueName="security"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_925F9081_BDD3_5BE8_BB73_89EBE3A0A8F0)" explainText="$(string.POL_925F9081_BDD3_5BE8_BB73_89EBE3A0A8F0_Help)" key="Software\Policies\Samba\smb_conf" name="POL_925F9081_BDD3_5BE8_BB73_89EBE3A0A8F0" presentation="$(presentation.POL_E94725FD_24A2_5499_9793_E27F2E3D82AB)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <text id="TXT_7688CBD7_E2F8_573B_AA8D_9EF8C47630F8" key="Software\Policies\Samba\smb_conf\server role" valueName="server role"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_6B0930DB_3CC7_57DB_8798_A6B6D3AF05B9)" explainText="$(string.POL_6B0930DB_3CC7_57DB_8798_A6B6D3AF05B9_Help)" key="Software\Policies\Samba\smb_conf" name="POL_6B0930DB_3CC7_57DB_8798_A6B6D3AF05B9" presentation="$(presentation.POL_51A99ED6_90F2_5884_904E_FBB01AE99010)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <text id="TXT_0DC074F0_E1DE_5232_B834_889409466FB7" key="Software\Policies\Samba\smb_conf\server schannel" valueName="server schannel"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_6DC4F5E8_3493_5D3C_8E35_D928C38C2604)" explainText="$(string.POL_6DC4F5E8_3493_5D3C_8E35_D928C38C2604_Help)" key="Software\Policies\Samba\smb_conf" name="POL_6DC4F5E8_3493_5D3C_8E35_D928C38C2604" presentation="$(presentation.POL_5FCA2961_E0AB_5E89_8361_C30A3FBAB1EC)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <text id="TXT_90F5A286_21F2_5FE7_97F9_88EF3C9B636C" key="Software\Policies\Samba\smb_conf\server signing" valueName="server signing"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_7C0D1957_E0F4_5B60_805D_FBA7399D8737)" explainText="$(string.POL_7C0D1957_E0F4_5B60_805D_FBA7399D8737_Help)" key="Software\Policies\Samba\smb_conf" name="POL_7C0D1957_E0F4_5B60_805D_FBA7399D8737" presentation="$(presentation.POL_619FBE76_46C6_5CD4_8FAB_F6031B681197)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <text id="TXT_A5857127_9668_5119_9FB1_28989C19BE29" key="Software\Policies\Samba\smb_conf\smb passwd file" valueName="smb passwd file"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_94D60BE2_185E_5EC1_8E58_146C4B17C1E7)" explainText="$(string.POL_94D60BE2_185E_5EC1_8E58_146C4B17C1E7_Help)" key="Software\Policies\Samba\smb_conf" name="POL_94D60BE2_185E_5EC1_8E58_146C4B17C1E7" presentation="$(presentation.POL_F01FFF92_4BCB_5309_8B5C_3910D8E2EE4D)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <text id="TXT_18E2AB7A_7B3D_5588_8E22_91549B53719E" key="Software\Policies\Samba\smb_conf\tls cafile" valueName="tls cafile"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_A9FA5D2E_2052_5A81_812D_83A2952DF38B)" explainText="$(string.POL_A9FA5D2E_2052_5A81_812D_83A2952DF38B_Help)" key="Software\Policies\Samba\smb_conf" name="POL_A9FA5D2E_2052_5A81_812D_83A2952DF38B" presentation="$(presentation.POL_2D715716_887A_5F22_B8BF_F4D8239F9576)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <text id="TXT_24A9FF35_91AF_50B7_9C8B_DCB8815A3B19" key="Software\Policies\Samba\smb_conf\tls certfile" valueName="tls certfile"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_C3E30BBB_123E_55E6_9693_7FF6CCF7488D)" explainText="$(string.POL_C3E30BBB_123E_55E6_9693_7FF6CCF7488D_Help)" key="Software\Policies\Samba\smb_conf" name="POL_C3E30BBB_123E_55E6_9693_7FF6CCF7488D" presentation="$(presentation.POL_823C796B_2B4A_5733_B90D_9179CA58C03D)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <text id="TXT_3B707725_83FA_511D_BBC2_69122D141655" key="Software\Policies\Samba\smb_conf\tls crlfile" valueName="tls crlfile"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_ABFC90A0_6AA2_5372_85E6_FCD989E458EE)" explainText="$(string.POL_ABFC90A0_6AA2_5372_85E6_FCD989E458EE_Help)" key="Software\Policies\Samba\smb_conf" name="POL_ABFC90A0_6AA2_5372_85E6_FCD989E458EE" presentation="$(presentation.POL_EE10300D_C58D_5AF3_819F_6707ACE727E9)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <text id="TXT_EB8D2F6A_9929_5004_BD04_03EB0F381453" key="Software\Policies\Samba\smb_conf\tls dh params file" valueName="tls dh params file"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_0F91E806_ADD5_59A1_B4FA_E99A51FED659)" explainText="$(string.POL_0F91E806_ADD5_59A1_B4FA_E99A51FED659_Help)" key="Software\Policies\Samba\smb_conf" name="POL_0F91E806_ADD5_59A1_B4FA_E99A51FED659" presentation="$(presentation.POL_D1A081CF_40D1_5505_9E0F_1DF2B67DC69F)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <boolean id="CHK_FBD1856B_6C06_5CF4_9A53_DDF372A2250F" key="Software\Policies\Samba\smb_conf\tls enabled" valueName="tls enabled"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_D245CE57_C525_5967_A452_F28BFDB9509B)" explainText="$(string.POL_D245CE57_C525_5967_A452_F28BFDB9509B_Help)" key="Software\Policies\Samba\smb_conf" name="POL_D245CE57_C525_5967_A452_F28BFDB9509B" presentation="$(presentation.POL_686F2495_B4CA_5D83_95E3_BF372A1857A3)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <text id="TXT_45D2AB07_CCD6_5350_A04D_DB915B7B79A3" key="Software\Policies\Samba\smb_conf\tls keyfile" valueName="tls keyfile"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_6DB833DB_F8B8_5A20_8E2A_6B7D8E298B9D)" explainText="$(string.POL_6DB833DB_F8B8_5A20_8E2A_6B7D8E298B9D_Help)" key="Software\Policies\Samba\smb_conf" name="POL_6DB833DB_F8B8_5A20_8E2A_6B7D8E298B9D" presentation="$(presentation.POL_869E3C32_6369_5FB5_B149_F982FB872384)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <text id="TXT_09331402_B0D6_59B2_8C69_2758849398CE" key="Software\Policies\Samba\smb_conf\tls verify peer" valueName="tls verify peer"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_82913C09_64C3_59C3_8303_3A815661F70E)" explainText="$(string.POL_82913C09_64C3_59C3_8303_3A815661F70E_Help)" key="Software\Policies\Samba\smb_conf" name="POL_82913C09_64C3_59C3_8303_3A815661F70E" presentation="$(presentation.POL_6B1AC895_029E_5686_B072_4BD0BD8B7C4D)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <boolean id="CHK_1E20CD87_5BB4_5449_9E0C_BFFBE014C934" key="Software\Policies\Samba\smb_conf\unix password sync" valueName="unix password sync"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_37EE4890_B571_50D5_B6D7_3462FF89BCE1)" explainText="$(string.POL_37EE4890_B571_50D5_B6D7_3462FF89BCE1_Help)" key="Software\Policies\Samba\smb_conf" name="POL_37EE4890_B571_50D5_B6D7_3462FF89BCE1" presentation="$(presentation.POL_821FE87C_398B_5051_A106_BB4C41475FA2)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <decimal id="DXT_55E19EF4_DFB4_5F5F_8DF5_D88E4874D090" key="Software\Policies\Samba\smb_conf\username level" valueName="username level"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_086EBC7E_1D72_5C67_9447_F5F6E36EFA8F)" explainText="$(string.POL_086EBC7E_1D72_5C67_9447_F5F6E36EFA8F_Help)" key="Software\Policies\Samba\smb_conf" name="POL_086EBC7E_1D72_5C67_9447_F5F6E36EFA8F" presentation="$(presentation.POL_4A737F54_FE8F_5996_AE22_5AD683E96F64)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <text id="TXT_F413607F_E22F_5652_B367_376C260376CF" key="Software\Policies\Samba\smb_conf\username map" valueName="username map"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_0FE7956E_5744_5658_A2ED_8433C45918D7)" explainText="$(string.POL_0FE7956E_5744_5658_A2ED_8433C45918D7_Help)" key="Software\Policies\Samba\smb_conf" name="POL_0FE7956E_5744_5658_A2ED_8433C45918D7" presentation="$(presentation.POL_B01C544C_C17F_58BE_A8C5_B8B93A5D6D6B)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <decimal id="DXT_54B979EE_6AB6_5CFA_9EE0_CAF728D8EC17" key="Software\Policies\Samba\smb_conf\username map cache time" valueName="username map cache time"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_7C2B49D9_45DE_5D97_B844_9F509F86D211)" explainText="$(string.POL_7C2B49D9_45DE_5D97_B844_9F509F86D211_Help)" key="Software\Policies\Samba\smb_conf" name="POL_7C2B49D9_45DE_5D97_B844_9F509F86D211" presentation="$(presentation.POL_D6C75311_EF00_56FB_BB7E_2AED9360F004)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <text id="TXT_C8B62E8A_0311_5EC2_A8CF_70B60E1BD044" key="Software\Policies\Samba\smb_conf\username map script" valueName="username map script"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_22AAB8AC_4E62_5B51_BC38_C9340E8AC56E)" explainText="$(string.POL_22AAB8AC_4E62_5B51_BC38_C9340E8AC56E_Help)" key="Software\Policies\Samba\smb_conf" name="POL_22AAB8AC_4E62_5B51_BC38_C9340E8AC56E" presentation="$(presentation.POL_D915E5DA_6227_5AF7_84CC_C5FF9079D441)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <text id="TXT_55A11C3A_195F_55F9_852D_0D62FD18327B" key="Software\Policies\Samba\smb_conf\tls priority" valueName="tls priority"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_08DDB9FE_1D88_5264_BEB0_6D60420CE12B)" explainText="$(string.POL_08DDB9FE_1D88_5264_BEB0_6D60420CE12B_Help)" key="Software\Policies\Samba\smb_conf" name="POL_08DDB9FE_1D88_5264_BEB0_6D60420CE12B" presentation="$(presentation.POL_5413F647_D5E0_5620_B00D_101274974D25)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <decimal id="DXT_8BBF5B06_26CE_5BCE_B851_7B1D4E5BA791" key="Software\Policies\Samba\smb_conf\aio max threads" valueName="aio max threads"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_0F98F240_9B2D_5788_AC7C_7B2ECDAE60A2)" explainText="$(string.POL_0F98F240_9B2D_5788_AC7C_7B2ECDAE60A2_Help)" key="Software\Policies\Samba\smb_conf" name="POL_0F98F240_9B2D_5788_AC7C_7B2ECDAE60A2" presentation="$(presentation.POL_B9BCD3D7_045F_57C2_9347_4258B5841D4B)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <decimal id="DXT_1C7D2B97_728C_587E_880B_EDEF41300FAB" key="Software\Policies\Samba\smb_conf\deadtime" valueName="deadtime"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_BAC6D3CB_A32D_5702_93FD_289B714016C3)" explainText="$(string.POL_BAC6D3CB_A32D_5702_93FD_289B714016C3_Help)" key="Software\Policies\Samba\smb_conf" name="POL_BAC6D3CB_A32D_5702_93FD_289B714016C3" presentation="$(presentation.POL_29E85EE4_9F4B_5824_AAD0_B71BC3AD529A)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <boolean id="CHK_18CC19EE_D0BD_5776_9816_F100799183AB" key="Software\Policies\Samba\smb_conf\getwd cache" valueName="getwd cache"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_0FB07FB9_33B4_5ECF_9725_9B7A38F863AF)" explainText="$(string.POL_0FB07FB9_33B4_5ECF_9725_9B7A38F863AF_Help)" key="Software\Policies\Samba\smb_conf" name="POL_0FB07FB9_33B4_5ECF_9725_9B7A38F863AF" presentation="$(presentation.POL_9FC38F18_A498_5A48_A001_E1C9DF302BAD)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <boolean id="CHK_04B2F1DF_E88E_5792_B491_793217A0C8C8" key="Software\Policies\Samba\smb_conf\hostname lookups" valueName="hostname lookups"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_C2D014CF_45D1_5A08_9727_3F2B500A4D58)" explainText="$(string.POL_C2D014CF_45D1_5A08_9727_3F2B500A4D58_Help)" key="Software\Policies\Samba\smb_conf" name="POL_C2D014CF_45D1_5A08_9727_3F2B500A4D58" presentation="$(presentation.POL_A09855DC_589A_515D_B123_3846F60F4908)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <decimal id="DXT_3DAC248C_C8A8_5C1C_8CFB_443894213FC9" key="Software\Policies\Samba\smb_conf\keepalive" valueName="keepalive"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_AF4738EE_230C_5D39_A4CE_F270B28FE9AB)" explainText="$(string.POL_AF4738EE_230C_5D39_A4CE_F270B28FE9AB_Help)" key="Software\Policies\Samba\smb_conf" name="POL_AF4738EE_230C_5D39_A4CE_F270B28FE9AB" presentation="$(presentation.POL_8C101F96_8BD1_5E91_ACA0_813AA7EB6F03)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <decimal id="DXT_4DAE2123_2535_5E0D_BCD1_D5D819A750B9" key="Software\Policies\Samba\smb_conf\max disk size" valueName="max disk size"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_21C3BE22_42E5_544F_97AB_732B2163839B)" explainText="$(string.POL_21C3BE22_42E5_544F_97AB_732B2163839B_Help)" key="Software\Policies\Samba\smb_conf" name="POL_21C3BE22_42E5_544F_97AB_732B2163839B" presentation="$(presentation.POL_571D0589_CE6E_50D9_A04F_4070993911D4)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <decimal id="DXT_E36137FA_C613_5FBE_B6FE_1A0554C4130E" key="Software\Policies\Samba\smb_conf\max open files" valueName="max open files"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_67BA8388_A439_54EA_8A1B_B6D2CCD8BB9B)" explainText="$(string.POL_67BA8388_A439_54EA_8A1B_B6D2CCD8BB9B_Help)" key="Software\Policies\Samba\smb_conf" name="POL_67BA8388_A439_54EA_8A1B_B6D2CCD8BB9B" presentation="$(presentation.POL_4B0BF94D_F644_5874_9963_FB1DB672DFCF)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <decimal id="DXT_3DC584F7_71D3_5762_BB59_FB55D524AF1D" key="Software\Policies\Samba\smb_conf\max smbd processes" valueName="max smbd processes"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_7CB978B4_3314_5AE7_9821_574DC024294B)" explainText="$(string.POL_7CB978B4_3314_5AE7_9821_574DC024294B_Help)" key="Software\Policies\Samba\smb_conf" name="POL_7CB978B4_3314_5AE7_9821_574DC024294B" presentation="$(presentation.POL_CCB2A269_DED1_5A89_B0EA_AC8B9A248E01)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <decimal id="DXT_23802D96_34E6_5E30_BB47_2839CFF09E5E" key="Software\Policies\Samba\smb_conf\name cache timeout" valueName="name cache timeout"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_93A78BFD_8C1E_5643_8329_A90FF5CE5A6B)" explainText="$(string.POL_93A78BFD_8C1E_5643_8329_A90FF5CE5A6B_Help)" key="Software\Policies\Samba\smb_conf" name="POL_93A78BFD_8C1E_5643_8329_A90FF5CE5A6B" presentation="$(presentation.POL_D0EACF0A_A7EC_5114_84E9_A119EAB06054)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <text id="TXT_9F944C4E_3CCB_5C34_AC11_84D5E8AE9675" key="Software\Policies\Samba\smb_conf\socket options" valueName="socket options"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_3FD02174_8A27_5426_848C_B3123EA8C4C3)" explainText="$(string.POL_3FD02174_8A27_5426_848C_B3123EA8C4C3_Help)" key="Software\Policies\Samba\smb_conf" name="POL_3FD02174_8A27_5426_848C_B3123EA8C4C3" presentation="$(presentation.POL_0BEE9D62_728C_5BEC_B208_C6413ACB23CA)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <boolean id="CHK_AE0F9277_9994_5245_9AF5_2FE2694EADB3" key="Software\Policies\Samba\smb_conf\use mmap" valueName="use mmap"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_77FC1090_5D4B_587E_BD3B_DAE9F7A9682F)" explainText="$(string.POL_77FC1090_5D4B_587E_BD3B_DAE9F7A9682F_Help)" key="Software\Policies\Samba\smb_conf" name="POL_77FC1090_5D4B_587E_BD3B_DAE9F7A9682F" presentation="$(presentation.POL_F0BBD72A_2F52_5518_978A_E4DE80EA63A7)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <text id="TXT_1299FC9B_B974_5807_B85B_96EF03DF6E7E" key="Software\Policies\Samba\smb_conf\get quota command" valueName="get quota command"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_B093DF52_6C77_5327_AC90_AAC6AF6CB126)" explainText="$(string.POL_B093DF52_6C77_5327_AC90_AAC6AF6CB126_Help)" key="Software\Policies\Samba\smb_conf" name="POL_B093DF52_6C77_5327_AC90_AAC6AF6CB126" presentation="$(presentation.POL_1B9A680B_C7D9_5909_A73A_4A88884B1A1A)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <boolean id="CHK_D8B6A576_57BD_5C1B_8503_D7514BF9A79A" key="Software\Policies\Samba\smb_conf\host msdfs" valueName="host msdfs"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_6B9A8C91_49AF_58C8_931C_0304B60491D2)" explainText="$(string.POL_6B9A8C91_49AF_58C8_931C_0304B60491D2_Help)" key="Software\Policies\Samba\smb_conf" name="POL_6B9A8C91_49AF_58C8_931C_0304B60491D2" presentation="$(presentation.POL_23841534_EA5C_5066_9A34_A81201DFA255)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <text id="TXT_CB4EB282_B71E_5E88_AAD0_CBE322ED1354" key="Software\Policies\Samba\smb_conf\set quota command" valueName="set quota command"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_6A683A86_8075_55FF_B1E6_D7874A3539AA)" explainText="$(string.POL_6A683A86_8075_55FF_B1E6_D7874A3539AA_Help)" key="Software\Policies\Samba\smb_conf" name="POL_6A683A86_8075_55FF_B1E6_D7874A3539AA" presentation="$(presentation.POL_A8D8A049_7017_5627_B698_79DB288ACF3D)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <boolean id="CHK_E3F6F2BF_E5EF_5ECD_B4EF_525C704252CE" key="Software\Policies\Samba\smb_conf\apply group policies" valueName="apply group policies"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_0471CC71_51D5_58F6_A00A_6E8B283C3AF5)" explainText="$(string.POL_0471CC71_51D5_58F6_A00A_6E8B283C3AF5_Help)" key="Software\Policies\Samba\smb_conf" name="POL_0471CC71_51D5_58F6_A00A_6E8B283C3AF5" presentation="$(presentation.POL_322C552E_7DC6_57F9_845A_F76107A65059)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <boolean id="CHK_4D19E247_9D41_57FC_A81B_7AAA3DA70D22" key="Software\Policies\Samba\smb_conf\create krb5 conf" valueName="create krb5 conf"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_46FF92BD_F484_5B2C_A639_ACBE73F15F3A)" explainText="$(string.POL_46FF92BD_F484_5B2C_A639_ACBE73F15F3A_Help)" key="Software\Policies\Samba\smb_conf" name="POL_46FF92BD_F484_5B2C_A639_ACBE73F15F3A" presentation="$(presentation.POL_D65A78B4_B284_51E5_86B8_548907E5B99E)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <text id="TXT_E8A538AD_C502_5298_A571_D37AF30908B1" key="Software\Policies\Samba\smb_conf\idmap backend" valueName="idmap backend"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_309434B4_68BA_53E0_BDF9_CA589711EA29)" explainText="$(string.POL_309434B4_68BA_53E0_BDF9_CA589711EA29_Help)" key="Software\Policies\Samba\smb_conf" name="POL_309434B4_68BA_53E0_BDF9_CA589711EA29" presentation="$(presentation.POL_D9437864_AD98_5DE6_A280_76BF74DF6241)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <decimal id="DXT_9707658F_1F28_5859_A19A_74FA303C63FD" key="Software\Policies\Samba\smb_conf\idmap cache time" valueName="idmap cache time"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_066B06D4_3BC0_5CFA_80A9_D2B1C046B5B0)" explainText="$(string.POL_066B06D4_3BC0_5CFA_80A9_D2B1C046B5B0_Help)" key="Software\Policies\Samba\smb_conf" name="POL_066B06D4_3BC0_5CFA_80A9_D2B1C046B5B0" presentation="$(presentation.POL_DADA8FE7_2FB0_5AFE_AE6F_5CDE2F6C835A)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <text id="TXT_8E0B0FA4_3946_55DD_9AD6_B31C5AC79265" key="Software\Policies\Samba\smb_conf\idmap gid" valueName="idmap gid"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_9B5D009F_1EBE_5E94_A46B_8644157A6061)" explainText="$(string.POL_9B5D009F_1EBE_5E94_A46B_8644157A6061_Help)" key="Software\Policies\Samba\smb_conf" name="POL_9B5D009F_1EBE_5E94_A46B_8644157A6061" presentation="$(presentation.POL_595CE1B7_F379_543C_99B1_DDF5DCBB2034)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <decimal id="DXT_DB0243EE_0466_539F_8844_6C0FFDEC6AA3" key="Software\Policies\Samba\smb_conf\idmap negative cache time" valueName="idmap negative cache time"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_37D1856A_CAF9_5395_AC8E_8E0F3E9C03E4)" explainText="$(string.POL_37D1856A_CAF9_5395_AC8E_8E0F3E9C03E4_Help)" key="Software\Policies\Samba\smb_conf" name="POL_37D1856A_CAF9_5395_AC8E_8E0F3E9C03E4" presentation="$(presentation.POL_1493AE04_9E17_51E3_BF56_61A594C41065)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <text id="TXT_5BC5E3D4_DCD5_5F0A_92C3_74C651DE0CEA" key="Software\Policies\Samba\smb_conf\idmap uid" valueName="idmap uid"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_283F0A5F_5841_5D1D_8EE3_D2715805A463)" explainText="$(string.POL_283F0A5F_5841_5D1D_8EE3_D2715805A463_Help)" key="Software\Policies\Samba\smb_conf" name="POL_283F0A5F_5841_5D1D_8EE3_D2715805A463" presentation="$(presentation.POL_BFD4E3E9_B3CF_5703_95C9_D5AF443628EC)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <boolean id="CHK_09A137C2_9429_5D4A_A327_A5F475E367AE" key="Software\Policies\Samba\smb_conf\include system krb5 conf" valueName="include system krb5 conf"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_61C9E6AE_96EF_5E8D_9AB8_7598584D391E)" explainText="$(string.POL_61C9E6AE_96EF_5E8D_9AB8_7598584D391E_Help)" key="Software\Policies\Samba\smb_conf" name="POL_61C9E6AE_96EF_5E8D_9AB8_7598584D391E" presentation="$(presentation.POL_B2DF30E2_2C79_5DB4_BDD4_2A72F3AAE4D1)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <boolean id="CHK_5CF9E5FF_8158_5689_9FD3_E408D710EC13" key="Software\Policies\Samba\smb_conf\neutralize nt4 emulation" valueName="neutralize nt4 emulation"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_D8459DE9_6E91_58A6_8E4E_83BFBB41AE4E)" explainText="$(string.POL_D8459DE9_6E91_58A6_8E4E_83BFBB41AE4E_Help)" key="Software\Policies\Samba\smb_conf" name="POL_D8459DE9_6E91_58A6_8E4E_83BFBB41AE4E" presentation="$(presentation.POL_D5D3240F_0956_5A05_8847_1B20DF57BEC8)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <boolean id="CHK_25E7D915_B85C_5F5B_9A60_056A326ED8F5" key="Software\Policies\Samba\smb_conf\reject md5 servers" valueName="reject md5 servers"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_E3A88031_AF89_5D12_9F48_5BD36B25F58C)" explainText="$(string.POL_E3A88031_AF89_5D12_9F48_5BD36B25F58C_Help)" key="Software\Policies\Samba\smb_conf" name="POL_E3A88031_AF89_5D12_9F48_5BD36B25F58C" presentation="$(presentation.POL_5D72D99B_EFA5_5B2F_8616_2FBE8DBBCF81)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <boolean id="CHK_C103A13B_7017_50F6_A337_C2A90DAE4419" key="Software\Policies\Samba\smb_conf\require strong key" valueName="require strong key"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_D55FF104_CF84_512D_9962_D01784923C49)" explainText="$(string.POL_D55FF104_CF84_512D_9962_D01784923C49_Help)" key="Software\Policies\Samba\smb_conf" name="POL_D55FF104_CF84_512D_9962_D01784923C49" presentation="$(presentation.POL_A7D4A2B5_A2CB_5BE6_A7D2_111FFC0BB9C5)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <text id="TXT_A6A67F77_1744_5905_9C6F_A3468BBFC424" key="Software\Policies\Samba\smb_conf\template homedir" valueName="template homedir"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_A317595E_2C79_5B73_9043_CEB7525F6692)" explainText="$(string.POL_A317595E_2C79_5B73_9043_CEB7525F6692_Help)" key="Software\Policies\Samba\smb_conf" name="POL_A317595E_2C79_5B73_9043_CEB7525F6692" presentation="$(presentation.POL_D7A44478_576C_554E_B31A_5316A836F68E)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <text id="TXT_73F5972B_1879_58A0_9815_A627E1F6D5BC" key="Software\Policies\Samba\smb_conf\template shell" valueName="template shell"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_F8F9B8BF_2D26_5079_928E_7168BBCA91BE)" explainText="$(string.POL_F8F9B8BF_2D26_5079_928E_7168BBCA91BE_Help)" key="Software\Policies\Samba\smb_conf" name="POL_F8F9B8BF_2D26_5079_928E_7168BBCA91BE" presentation="$(presentation.POL_EE40BE14_5D1D_5ED4_845C_E7E51C529C2B)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <decimal id="DXT_22E52F9D_8E44_59CE_ACC2_916D022CDFA6" key="Software\Policies\Samba\smb_conf\winbind cache time" valueName="winbind cache time"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_07E24EA1_B340_5215_BDBB_5248537F9540)" explainText="$(string.POL_07E24EA1_B340_5215_BDBB_5248537F9540_Help)" key="Software\Policies\Samba\smb_conf" name="POL_07E24EA1_B340_5215_BDBB_5248537F9540" presentation="$(presentation.POL_76E2E87A_908A_5F9A_AA09_FF096575D9A7)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <text id="TXT_C06A3052_6AD2_53D9_BD21_2A738D8BB155" key="Software\Policies\Samba\smb_conf\winbindd socket directory" valueName="winbindd socket directory"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_8FEAD8B9_8097_5BA2_BD78_7BB0AA8691C1)" explainText="$(string.POL_8FEAD8B9_8097_5BA2_BD78_7BB0AA8691C1_Help)" key="Software\Policies\Samba\smb_conf" name="POL_8FEAD8B9_8097_5BA2_BD78_7BB0AA8691C1" presentation="$(presentation.POL_91508E50_D468_5787_B9AD_BD8160522742)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <boolean id="CHK_F53BC663_D7A1_5D33_8C57_9EC32E71DC68" key="Software\Policies\Samba\smb_conf\winbind enum groups" valueName="winbind enum groups"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_FAB1BAAD_85CD_5FE6_B0AA_AC48B77ACCCC)" explainText="$(string.POL_FAB1BAAD_85CD_5FE6_B0AA_AC48B77ACCCC_Help)" key="Software\Policies\Samba\smb_conf" name="POL_FAB1BAAD_85CD_5FE6_B0AA_AC48B77ACCCC" presentation="$(presentation.POL_F4AED7E2_E1E5_50C5_BBCA_C543EB5E383E)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <boolean id="CHK_08E1CF79_DDA7_588B_B86D_590B4967C1C0" key="Software\Policies\Samba\smb_conf\winbind enum users" valueName="winbind enum users"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_2B331ECE_5A4A_5DE9_8DBF_EFBCE108F070)" explainText="$(string.POL_2B331ECE_5A4A_5DE9_8DBF_EFBCE108F070_Help)" key="Software\Policies\Samba\smb_conf" name="POL_2B331ECE_5A4A_5DE9_8DBF_EFBCE108F070" presentation="$(presentation.POL_FE94B125_13A6_5560_A963_34F8F6C8F4D6)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <decimal id="DXT_B28BA151_1969_59E2_B275_C81CA16B5A23" key="Software\Policies\Samba\smb_conf\winbind expand groups" valueName="winbind expand groups"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_7F3A4DCD_923C_5586_AFFB_1BA559F399CB)" explainText="$(string.POL_7F3A4DCD_923C_5586_AFFB_1BA559F399CB_Help)" key="Software\Policies\Samba\smb_conf" name="POL_7F3A4DCD_923C_5586_AFFB_1BA559F399CB" presentation="$(presentation.POL_7548D0E2_C166_5A7A_9701_063C15E4172D)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <text id="TXT_3C8A3138_1C1C_5FFF_A3F7_513DEA315389" key="Software\Policies\Samba\smb_conf\winbind:ignore domains" valueName="winbind:ignore domains"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_FE5A1763_2311_55A2_AB2E_10D92C3A7FC4)" explainText="$(string.POL_FE5A1763_2311_55A2_AB2E_10D92C3A7FC4_Help)" key="Software\Policies\Samba\smb_conf" name="POL_FE5A1763_2311_55A2_AB2E_10D92C3A7FC4" presentation="$(presentation.POL_DD3D412F_8AD9_54B9_8D5A_A0501DF3AB07)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <decimal id="DXT_C2980001_BA2C_57BA_8C1B_F973C067028B" key="Software\Policies\Samba\smb_conf\winbind max clients" valueName="winbind max clients"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_57855ED8_E596_52E6_A8F8_B710E76BD0F6)" explainText="$(string.POL_57855ED8_E596_52E6_A8F8_B710E76BD0F6_Help)" key="Software\Policies\Samba\smb_conf" name="POL_57855ED8_E596_52E6_A8F8_B710E76BD0F6" presentation="$(presentation.POL_BE09D431_FA6A_5383_994E_1AEA3E9EEC4A)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <decimal id="DXT_6F41A5F1_F003_54F4_88AF_9CC14C5B64F0" key="Software\Policies\Samba\smb_conf\winbind max domain connections" valueName="winbind max domain connections"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_6C096F2D_4DB1_5E05_84BB_9E9E3E0708BB)" explainText="$(string.POL_6C096F2D_4DB1_5E05_84BB_9E9E3E0708BB_Help)" key="Software\Policies\Samba\smb_conf" name="POL_6C096F2D_4DB1_5E05_84BB_9E9E3E0708BB" presentation="$(presentation.POL_2ABFD1ED_23F7_5C67_8ECD_3F7EE2752B7D)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <boolean id="CHK_EE309E41_F404_5CE1_AC86_5E795D0C979A" key="Software\Policies\Samba\smb_conf\winbind nested groups" valueName="winbind nested groups"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_7C9859FE_6BA0_526D_A308_9454D3063550)" explainText="$(string.POL_7C9859FE_6BA0_526D_A308_9454D3063550_Help)" key="Software\Policies\Samba\smb_conf" name="POL_7C9859FE_6BA0_526D_A308_9454D3063550" presentation="$(presentation.POL_4542EFF0_F19C_5215_92F8_0B006803D437)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <boolean id="CHK_E9249CF9_4820_553B_B406_5560E8B3DEFF" key="Software\Policies\Samba\smb_conf\winbind normalize names" valueName="winbind normalize names"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_3D3D280A_1D60_58AA_A7BD_54D13DDBE1A6)" explainText="$(string.POL_3D3D280A_1D60_58AA_A7BD_54D13DDBE1A6_Help)" key="Software\Policies\Samba\smb_conf" name="POL_3D3D280A_1D60_58AA_A7BD_54D13DDBE1A6" presentation="$(presentation.POL_62688BAF_1F03_5CF4_888F_4B88677FF4AC)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <text id="TXT_B2B0FF5C_C714_52AC_BAFE_846EC003D31E" key="Software\Policies\Samba\smb_conf\winbind nss info" valueName="winbind nss info"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_34B48F10_7723_5E77_A57B_AE606BBB43B7)" explainText="$(string.POL_34B48F10_7723_5E77_A57B_AE606BBB43B7_Help)" key="Software\Policies\Samba\smb_conf" name="POL_34B48F10_7723_5E77_A57B_AE606BBB43B7" presentation="$(presentation.POL_053CBE3D_DD33_522A_9B34_9AFF4044D454)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <boolean id="CHK_5945AB58_D8F0_5BA1_9964_D8E69AF19CBB" key="Software\Policies\Samba\smb_conf\winbind offline logon" valueName="winbind offline logon"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_05A14875_99EE_5000_A1E2_100D2F7B079F)" explainText="$(string.POL_05A14875_99EE_5000_A1E2_100D2F7B079F_Help)" key="Software\Policies\Samba\smb_conf" name="POL_05A14875_99EE_5000_A1E2_100D2F7B079F" presentation="$(presentation.POL_3BF15158_B942_5458_999E_4FEBCA3A2290)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <decimal id="DXT_BEC37822_5BBB_56AE_B122_DFA48B55FF4A" key="Software\Policies\Samba\smb_conf\winbind reconnect delay" valueName="winbind reconnect delay"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_98A94538_AA09_51C8_A96D_ACB0B314F5F4)" explainText="$(string.POL_98A94538_AA09_51C8_A96D_ACB0B314F5F4_Help)" key="Software\Policies\Samba\smb_conf" name="POL_98A94538_AA09_51C8_A96D_ACB0B314F5F4" presentation="$(presentation.POL_46E902CB_4766_50A8_8A8A_86893347E86F)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <boolean id="CHK_9DDF19FA_7129_5F46_82E2_FED21BCF9048" key="Software\Policies\Samba\smb_conf\winbind refresh tickets" valueName="winbind refresh tickets"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_96B1E9F8_5418_5EA0_8B87_614B45822D92)" explainText="$(string.POL_96B1E9F8_5418_5EA0_8B87_614B45822D92_Help)" key="Software\Policies\Samba\smb_conf" name="POL_96B1E9F8_5418_5EA0_8B87_614B45822D92" presentation="$(presentation.POL_9F679274_5E36_5B71_BBB3_880590FFB5A4)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <decimal id="DXT_542C16F7_4011_5AFF_A127_7A773681E95B" key="Software\Policies\Samba\smb_conf\winbind request timeout" valueName="winbind request timeout"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_FEC015B1_6B0B_5D76_B23D_71363578FAF7)" explainText="$(string.POL_FEC015B1_6B0B_5D76_B23D_71363578FAF7_Help)" key="Software\Policies\Samba\smb_conf" name="POL_FEC015B1_6B0B_5D76_B23D_71363578FAF7" presentation="$(presentation.POL_B5754213_7C07_59E8_BE54_44BD0B64A8ED)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <boolean id="CHK_2EB29672_8B33_566A_AFE5_41BFDBE0F72E" key="Software\Policies\Samba\smb_conf\winbind rpc only" valueName="winbind rpc only"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_412B470E_EC88_556F_B9DE_1952C70E45B1)" explainText="$(string.POL_412B470E_EC88_556F_B9DE_1952C70E45B1_Help)" key="Software\Policies\Samba\smb_conf" name="POL_412B470E_EC88_556F_B9DE_1952C70E45B1" presentation="$(presentation.POL_923523CB_9B7D_5261_93D6_B5FD86FC39E4)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <boolean id="CHK_3CAC88EA_556D_5AA8_8A29_282B574B2743" key="Software\Policies\Samba\smb_conf\winbind scan trusted domains" valueName="winbind scan trusted domains"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_6247DEB4_05CC_51B8_A8CB_1FF7DEDA741C)" explainText="$(string.POL_6247DEB4_05CC_51B8_A8CB_1FF7DEDA741C_Help)" key="Software\Policies\Samba\smb_conf" name="POL_6247DEB4_05CC_51B8_A8CB_1FF7DEDA741C" presentation="$(presentation.POL_FFF6590E_C5E7_5680_9A62_61DC88079555)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <boolean id="CHK_E93252A7_06C7_566B_B7E6_8D4D7AADFB8D" key="Software\Policies\Samba\smb_conf\winbind sealed pipes" valueName="winbind sealed pipes"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_7E1E179F_7E0D_5CB4_BDAA_B8EDF41428CC)" explainText="$(string.POL_7E1E179F_7E0D_5CB4_BDAA_B8EDF41428CC_Help)" key="Software\Policies\Samba\smb_conf" name="POL_7E1E179F_7E0D_5CB4_BDAA_B8EDF41428CC" presentation="$(presentation.POL_A55D34ED_E614_5500_9F7B_A07E0EE1F7BE)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <text id="TXT_25CC57B6_941F_525A_99F8_1C041F206D9B" key="Software\Policies\Samba\smb_conf\winbind separator" valueName="winbind separator"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_1780A1A5_0535_5D0B_8105_2129879E3C40)" explainText="$(string.POL_1780A1A5_0535_5D0B_8105_2129879E3C40_Help)" key="Software\Policies\Samba\smb_conf" name="POL_1780A1A5_0535_5D0B_8105_2129879E3C40" presentation="$(presentation.POL_14AE5941_E62F_53FC_95AE_441E7EF43F56)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <boolean id="CHK_BF4DA096_841C_5A0D_A5E3_CD564122C924" key="Software\Policies\Samba\smb_conf\winbind use default domain" valueName="winbind use default domain"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_71A1842A_9526_5BF9_A0FC_07322D2C6C81)" explainText="$(string.POL_71A1842A_9526_5BF9_A0FC_07322D2C6C81_Help)" key="Software\Policies\Samba\smb_conf" name="POL_71A1842A_9526_5BF9_A0FC_07322D2C6C81" presentation="$(presentation.POL_4B5E805D_7C7A_5CCE_AAB2_FBD0B9CC6D2E)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <boolean id="CHK_7E9390CD_05D9_570F_A761_7B5A605BA1F9" key="Software\Policies\Samba\smb_conf\winbind use krb5 enterprise principals" valueName="winbind use krb5 enterprise principals"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_B05D0593_B0CE_52A9_977C_E7A897EEA307)" explainText="$(string.POL_B05D0593_B0CE_52A9_977C_E7A897EEA307_Help)" key="Software\Policies\Samba\smb_conf" name="POL_B05D0593_B0CE_52A9_977C_E7A897EEA307" presentation="$(presentation.POL_DBC0E447_01F4_5B72_BA4E_E9248006FD96)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <boolean id="CHK_243E92BD_CBA1_50BC_BD4D_87B750B6FABB" key="Software\Policies\Samba\smb_conf\dns proxy" valueName="dns proxy"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_C1A54865_BE76_5627_B737_BBB708AEC44C)" explainText="$(string.POL_C1A54865_BE76_5627_B737_BBB708AEC44C_Help)" key="Software\Policies\Samba\smb_conf" name="POL_C1A54865_BE76_5627_B737_BBB708AEC44C" presentation="$(presentation.POL_2E4CDFD7_AB3A_5898_B4A1_44EDABBEE713)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <decimal id="DXT_761AB0AD_EED6_5734_BC07_88D6599EF57F" key="Software\Policies\Samba\smb_conf\max wins ttl" valueName="max wins ttl"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_BEE0A696_13BD_578B_B448_1E0A01AB915A)" explainText="$(string.POL_BEE0A696_13BD_578B_B448_1E0A01AB915A_Help)" key="Software\Policies\Samba\smb_conf" name="POL_BEE0A696_13BD_578B_B448_1E0A01AB915A" presentation="$(presentation.POL_584FFB0D_E6B4_51B1_B65D_FBFD4D40C4D9)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <decimal id="DXT_153EA1D4_FC29_50AF_878D_5695C6C186CD" key="Software\Policies\Samba\smb_conf\min wins ttl" valueName="min wins ttl"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_890DE0DC_C0FC_565A_A1D3_AD06EFAC41ED)" explainText="$(string.POL_890DE0DC_C0FC_565A_A1D3_AD06EFAC41ED_Help)" key="Software\Policies\Samba\smb_conf" name="POL_890DE0DC_C0FC_565A_A1D3_AD06EFAC41ED" presentation="$(presentation.POL_6D6BFEF8_655A_59B7_B17E_050ADA0FAD0F)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <text id="TXT_4B630740_3B6C_5FCF_9B93_46CD46767198" key="Software\Policies\Samba\smb_conf\nbtd:wins_prepend1Bto1Cqueries" valueName="nbtd:wins_prepend1Bto1Cqueries"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_06F0FFB1_F595_57BB_B964_6D419A02F468)" explainText="$(string.POL_06F0FFB1_F595_57BB_B964_6D419A02F468_Help)" key="Software\Policies\Samba\smb_conf" name="POL_06F0FFB1_F595_57BB_B964_6D419A02F468" presentation="$(presentation.POL_F145528D_6177_5DA0_9730_05420DF91116)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <text id="TXT_A7D6BC38_6BF1_56CF_85B2_FEEA5DAB1A45" key="Software\Policies\Samba\smb_conf\nbtd:wins_wins_randomize1Clist" valueName="nbtd:wins_wins_randomize1Clist"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_F63D2A1E_D6BA_516E_995D_F9FEE05D49DB)" explainText="$(string.POL_F63D2A1E_D6BA_516E_995D_F9FEE05D49DB_Help)" key="Software\Policies\Samba\smb_conf" name="POL_F63D2A1E_D6BA_516E_995D_F9FEE05D49DB" presentation="$(presentation.POL_1D8649CE_6826_507E_A697_A06B2B693295)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <text id="TXT_845EC4E4_224C_5FE8_B43E_3F417E26E1F8" key="Software\Policies\Samba\smb_conf\nbtd:wins_randomize1Clist_mask" valueName="nbtd:wins_randomize1Clist_mask"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_D0A83CCC_07AF_553B_84AE_4824377AE692)" explainText="$(string.POL_D0A83CCC_07AF_553B_84AE_4824377AE692_Help)" key="Software\Policies\Samba\smb_conf" name="POL_D0A83CCC_07AF_553B_84AE_4824377AE692" presentation="$(presentation.POL_8A6CF1A8_12F0_5EC4_B588_658C72C10C4B)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <text id="TXT_5A9C87F1_E213_5A53_AD54_9B3AFAB13F9C" key="Software\Policies\Samba\smb_conf\winsdb:local_owner" valueName="winsdb:local_owner"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_06442D20_4739_5DE0_820F_516416AD0ECF)" explainText="$(string.POL_06442D20_4739_5DE0_820F_516416AD0ECF_Help)" key="Software\Policies\Samba\smb_conf" name="POL_06442D20_4739_5DE0_820F_516416AD0ECF" presentation="$(presentation.POL_4B068333_B3F0_5408_A84F_05BFDB2AD521)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <text id="TXT_DE8267A0_F6DE_5043_AFDA_3D98B6494A6D" key="Software\Policies\Samba\smb_conf\winsdb:dbnosync" valueName="winsdb:dbnosync"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_F7271C08_2949_53E0_809D_9B976AB9DE2E)" explainText="$(string.POL_F7271C08_2949_53E0_809D_9B976AB9DE2E_Help)" key="Software\Policies\Samba\smb_conf" name="POL_F7271C08_2949_53E0_809D_9B976AB9DE2E" presentation="$(presentation.POL_61D06DDC_5FC1_5A27_9953_0522C71D3C81)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <text id="TXT_7AC86D1C_8F55_5202_9960_E3F76BE03021" key="Software\Policies\Samba\smb_conf\wins hook" valueName="wins hook"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_A1E6C0E7_38BA_5583_816D_73C91FCAADB4)" explainText="$(string.POL_A1E6C0E7_38BA_5583_816D_73C91FCAADB4_Help)" key="Software\Policies\Samba\smb_conf" name="POL_A1E6C0E7_38BA_5583_816D_73C91FCAADB4" presentation="$(presentation.POL_DA957F88_D7CE_566D_A902_4CCDEF755586)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <boolean id="CHK_F6AECF98_9DF6_5B4D_8F4C_1A262B314282" key="Software\Policies\Samba\smb_conf\wins proxy" valueName="wins proxy"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_31C40FB1_1B0A_5AA3_80F9_7914AC38FD99)" explainText="$(string.POL_31C40FB1_1B0A_5AA3_80F9_7914AC38FD99_Help)" key="Software\Policies\Samba\smb_conf" name="POL_31C40FB1_1B0A_5AA3_80F9_7914AC38FD99" presentation="$(presentation.POL_8F4113F9_15A6_5E26_9F02_7CA7971BE6C9)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <text id="TXT_C1395789_AF99_5B0A_89F7_DD274EC794EA" key="Software\Policies\Samba\smb_conf\wins server" valueName="wins server"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_44517D2D_845B_5F7B_90F2_F7BD0DA063A9)" explainText="$(string.POL_44517D2D_845B_5F7B_90F2_F7BD0DA063A9_Help)" key="Software\Policies\Samba\smb_conf" name="POL_44517D2D_845B_5F7B_90F2_F7BD0DA063A9" presentation="$(presentation.POL_0F35BC3D_B809_53E1_9BFD_1765E5E4E934)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <boolean id="CHK_BE0D6F0B_4FEE_5580_AD27_507FBCC53AB5" key="Software\Policies\Samba\smb_conf\wins support" valueName="wins support"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_8A035569_9C85_59DC_9BF8_241994D4E947)" explainText="$(string.POL_8A035569_9C85_59DC_9BF8_241994D4E947_Help)" key="Software\Policies\Samba\smb_conf" name="POL_8A035569_9C85_59DC_9BF8_241994D4E947" presentation="$(presentation.POL_1009764B_DAB3_56F8_A766_B45CFC524A5E)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <text id="TXT_A8EC94D1_CDB1_5E5B_A2D7_D4FDDD78655D" key="Software\Policies\Samba\smb_conf\wreplsrv:periodic_interval" valueName="wreplsrv:periodic_interval"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_186864AE_CE31_5628_BA4E_6B9F06F087E5)" explainText="$(string.POL_186864AE_CE31_5628_BA4E_6B9F06F087E5_Help)" key="Software\Policies\Samba\smb_conf" name="POL_186864AE_CE31_5628_BA4E_6B9F06F087E5" presentation="$(presentation.POL_17929B31_DDBB_5B79_AD9D_F0C7EB54BFFA)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <text id="TXT_C4483400_9388_5705_BB16_A9CD61B3FC01" key="Software\Policies\Samba\smb_conf\wreplsrv:propagate name releases" valueName="wreplsrv:propagate name releases"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_8DC9CC59_A490_5F52_8C69_A9EEC802C48C)" explainText="$(string.POL_8DC9CC59_A490_5F52_8C69_A9EEC802C48C_Help)" key="Software\Policies\Samba\smb_conf" name="POL_8DC9CC59_A490_5F52_8C69_A9EEC802C48C" presentation="$(presentation.POL_E9361CA3_1260_52FE_AD12_742A86788475)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <text id="TXT_7E454192_9281_5588_8F18_A4C13837C555" key="Software\Policies\Samba\smb_conf\wreplsrv:scavenging_interval" valueName="wreplsrv:scavenging_interval"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_DB737BF2_9B47_5895_A3F8_D51BBD764222)" explainText="$(string.POL_DB737BF2_9B47_5895_A3F8_D51BBD764222_Help)" key="Software\Policies\Samba\smb_conf" name="POL_DB737BF2_9B47_5895_A3F8_D51BBD764222" presentation="$(presentation.POL_D3F0B860_C5A4_5E2A_983F_90B40B5AEF46)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <text id="TXT_C4470E01_F859_5E45_B342_290D5974C4D0" key="Software\Policies\Samba\smb_conf\wreplsrv:tombstone_extra_timeout" valueName="wreplsrv:tombstone_extra_timeout"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_30D1C3B2_BDCD_5A5C_A131_11E1E6DA2A76)" explainText="$(string.POL_30D1C3B2_BDCD_5A5C_A131_11E1E6DA2A76_Help)" key="Software\Policies\Samba\smb_conf" name="POL_30D1C3B2_BDCD_5A5C_A131_11E1E6DA2A76" presentation="$(presentation.POL_0CA9F8A3_6092_57F4_8CCC_114358C3B9EB)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <text id="TXT_D81F8827_96DE_500F_B1B8_D6EF10D165FE" key="Software\Policies\Samba\smb_conf\wreplsrv:tombstone_interval" valueName="wreplsrv:tombstone_interval"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_F19C445A_AFD5_51B6_B87A_E42499C3C5D8)" explainText="$(string.POL_F19C445A_AFD5_51B6_B87A_E42499C3C5D8_Help)" key="Software\Policies\Samba\smb_conf" name="POL_F19C445A_AFD5_51B6_B87A_E42499C3C5D8" presentation="$(presentation.POL_B06D59DA_A8FC_53AF_AB8F_9C00812D8832)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <text id="TXT_B8A345EA_EAA9_524C_A511_8121FD7A5EA1" key="Software\Policies\Samba\smb_conf\wreplsrv:tombstone_timeout" valueName="wreplsrv:tombstone_timeout"/>
      </elements>
    </policy>
    <policy class="Machine" displayName="$(string.POL_8CF1FEA3_BD3E_53C0_9F73_34050187A91E)" explainText="$(string.POL_8CF1FEA3_BD3E_53C0_9F73_34050187A91E_Help)" key="Software\Policies\Samba\smb_conf" name="POL_8CF1FEA3_BD3E_53C0_9F73_34050187A91E" presentation="$(presentation.POL_3F2ADB29_E0AE_5723_BC18_0B7ABC97BBE7)">
      <parentCategory ref="CAT_10827749_64ED_5052_87F7_E81AD421856A"/>
      <supportedOn ref="SUPPORTED_WIN7"/>
      <elements>
        <text id="TXT_F35F7924_DBD3_5F6F_B247_7F4893C63844" key="Software\Policies\Samba\smb_conf\wreplsrv:verify_interval" valueName="wreplsrv:verify_interval"/>
      </elements>
    </policy>
    <policy name="POL_38DA04F0_3FD6_4425_8924_1CEEA685FD07" class="Machine" displayName="$(string.POL_38DA04F0_3FD6_4425_8924_1CEEA685FD07)" explainText="$(string.POL_38DA04F0_3FD6_4425_8924_1CEEA685FD07_Help)" presentation="$(presentation.POL_38DA04F0_3FD6_4425_8924_1CEEA685FD07)" key="Software\Policies\Samba\Unix Settings\Messages">
      <parentCategory ref="CAT_9DEF582D_447A_47E9_A1F5_363558D03FA9" />
      <supportedOn ref="windows:SUPPORTED_WindowsVista" />
      <elements>
        <text id="TXT_609C208A_3B4D_48F1_8A15_C0DF08EAD4D6" key="Software\Policies\Samba\Unix Settings\Messages" valueName="motd" />
      </elements>
    </policy>
    <policy name="POL_68E9155C_CB49_428E_AFE0_B89316FFD948" class="Machine" displayName="$(string.POL_68E9155C_CB49_428E_AFE0_B89316FFD948)" explainText="$(string.POL_68E9155C_CB49_428E_AFE0_B89316FFD948_Help)" presentation="$(presentation.POL_68E9155C_CB49_428E_AFE0_B89316FFD948)" key="Software\Policies\Samba\Unix Settings\Messages">
      <parentCategory ref="CAT_9DEF582D_447A_47E9_A1F5_363558D03FA9" />
      <supportedOn ref="windows:SUPPORTED_WindowsVista" />
      <elements>
        <text id="TXT_8075D9EA_6E15_4B2A_833A_B918EE90856F" key="Software\Policies\Samba\Unix Settings\Messages" valueName="issue" />
      </elements>
    </policy>
    <policy name="POL_ADABE9E0_FFF9_4FFE_A105_03E646C79978" class="Machine" displayName="$(string.POL_ADABE9E0_FFF9_4FFE_A105_03E646C79978)" explainText="$(string.POL_ADABE9E0_FFF9_4FFE_A105_03E646C79978_Help)" presentation="$(presentation.POL_ADABE9E0_FFF9_4FFE_A105_03E646C79978)" key="Software\Policies\Samba\Unix Settings\Firewalld" valueName="Zones">
      <parentCategory ref="CAT_371A8FF5_990F_47DD_B200_D436AC28A4F9" />
      <supportedOn ref="SUPPORTED_SAMBA_4_16" />
      <elements>
        <list id="LST_5B9AE80A_6529_4313_A9A1_764DF5320930" key="Software\Policies\Samba\Unix Settings\Firewalld\Zones" />
      </elements>
    </policy>
    <policy name="POL_B21F349F_4BF6_473E_8452_047D714F156C" class="Machine" displayName="$(string.POL_B21F349F_4BF6_473E_8452_047D714F156C)" explainText="$(string.POL_B21F349F_4BF6_473E_8452_047D714F156C_Help)" presentation="$(presentation.POL_B21F349F_4BF6_473E_8452_047D714F156C)" key="Software\Policies\Samba\Unix Settings\Firewalld" valueName="Rules">
      <parentCategory ref="CAT_371A8FF5_990F_47DD_B200_D436AC28A4F9" />
      <supportedOn ref="SUPPORTED_SAMBA_4_16" />
      <elements>
        <text id="TXT_76109A0B_AA79_4F69_ADFC_2B3CA52763D2" key="Software\Policies\Samba\Unix Settings\Firewalld\Rules" valueName="Rules" />
      </elements>
    </policy>
  </policies>
</policyDefinitions>
